export default [
  {
    name: '仙桃',
    quality: '白',
    cost: 1,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/xiantao.jpg', import.meta.url),
    data: [
      [0, 0, '目标单位+4/+9'],
      [0, 0, '目标单位+4/+10，魔防+2'],
      [0, 0, '目标单位+5/+10，魔防+2'],
      [0, 0, '目标单位+6/+10，魔防+3'],
      [0, 0, '目标单位+6/+12，魔防+3'],
      [0, 0, '目标单位+6/+13，魔防+4'],
      [0, 0, '目标单位+7/+13，魔防+5'],
      [0, 0, '目标单位+7/+14，魔防+5'],
      [0, 0, '目标单位+7/+15，魔防+5']
    ]
  },
  {
    name: '鹿行者',
    quality: '白',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/luxingzhe.jpg', import.meta.url),
    data: [
      [14, 1, '【传承2】'],
      [15, 2, '【传承2】'],
      [16, 3, '【传承2】'],
      [17, 3, '【传承3】'],
      [19, 3, '【传承3】'],
      [21, 3, '【传承3】'],
      [23, 3, '【传承3】'],
      [25, 3, '【传承3】'],
      [28, 3, '【传承3】']
    ]
  },
  {
    name: '鹿剑客',
    quality: '白',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/lujianke.jpg', import.meta.url),
    data: [
      [12, 3, '前排登场:自身+0/+3；后排登场:自身+1/+1'],
      [13, 3, '前排登场:自身+0/+6；后排登场:自身+3/+1'],
      [14, 3, '前排登场:自身+0/+6；后排登场:自身+3/+1'],
      [15, 3, '前排登场:自身+0/+6；后排登场:自身+3/+1'],
      [16, 4, '前排登场:自身+0/+6；后排登场:自身+3/+1'],
      [17, 4, '前排登场:自身+0/+7；后排登场:自身+4/+1'],
      [18, 5, '前排登场:自身+0/+7；后排登场:自身+4/+1'],
      [19, 6, '前排登场:自身+0/+8；后排登场:自身+5/+1'],
      [20, 7, '前排登场:自身+0/+9；后排登场:自身+5/+1']
    ]
  },
  {
    name: '人参果',
    quality: '白',
    cost: 2,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/renshenguo.jpg', import.meta.url),
    data: [
      [0, 0, '己方英雄生命+28'],
      [0, 0, '己方英雄生命+32'],
      [0, 0, '己方英雄生命+36'],
      [0, 0, '己方英雄生命+40'],
      [0, 0, '己方英雄生命+45'],
      [0, 0, '己方英雄生命+50'],
      [0, 0, '己方英雄生命+55'],
      [0, 0, '己方英雄生命+60'],
      [0, 0, '己方英雄生命+65']
    ]
  },
  {
    name: '昆莱云游客',
    quality: '白',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/kunlaiyunyouke.jpg', import.meta.url),
    data: [
      [3, 15, '【传承2】'],
      [3, 17, '【传承2】'],
      [3, 19, '【传承2】'],
      [4, 20, '【传承2】'],
      [4, 22, '【传承3】'],
      [5, 24, '【传承3】'],
      [5, 29, '【传承3】'],
      [6, 32, '【传承3】'],
      [7, 35, '【传承3】']
    ]
  },
  {
    name: '柏松隐者',
    quality: '白',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/bosongyinzhe.jpg', import.meta.url),
    data: [
      [1, 30, '回合结束:英雄生命+7'],
      [1, 33, '回合结束:英雄生命+8'],
      [1, 36, '回合结束:英雄生命+9'],
      [1, 40, '回合结束:英雄生命+10'],
      [2, 45, '回合结束:英雄生命+10'],
      [2, 50, '回合结束:英雄生命+11'],
      [2, 55, '回合结束:英雄生命+12'],
      [2, 60, '回合结束:英雄生命+13'],
      [3, 63, '回合结束:英雄生命+15']
    ]
  },
  {
    name: '熊大宝',
    quality: '蓝',
    cost: 0,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/xiongdabao.jpg', import.meta.url),
    data: [
      [5, 5, '【传承5】'],
      [6, 6, '【传承5】'],
      [6, 6, '【传承6】'],
      [7, 7, '【传承6】'],
      [7, 7, '【传承7】'],
      [8, 8, '【传承7】'],
      [8, 8, '【传承8】'],
      [9, 9, '【传承8】'],
      [10, 10, '【传承8】']
    ]
  },
  {
    name: '卜命道长',
    quality: '蓝',
    cost: 1,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/bumingdaozhang.jpg', import.meta.url),
    data: [
      [9, 6, '【传承3】'],
      [10, 7, '【传承3】'],
      [11, 8, '【传承4】'],
      [12, 10, '【传承4】'],
      [14, 11, '【传承4】'],
      [16, 12, '【传承4】'],
      [18, 13, '【传承5】'],
      [20, 14, '【传承5】'],
      [22, 16, '【传承5】']
    ]
  },
  {
    name: '箭竹守卫',
    quality: '蓝',
    cost: 1,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/jianzhushouwei.jpg', import.meta.url),
    data: [
      [9, 2, '登场:向敌横排投掷竹矛，6点伤害、攻击前:向敌前排投掷竹矛，3点伤害'],
      [10, 3, '登场:向敌横排投掷竹矛，7点伤害、攻击前:向敌前排投掷竹矛，3点伤害'],
      [11, 3, '登场:向敌横排投掷竹矛，8点伤害、攻击前:向敌前排投掷竹矛，4点伤害'],
      [13, 3, '登场:向敌横排投掷竹矛，9点伤害、攻击前:向敌前排投掷竹矛，4点伤害'],
      [14, 4, '登场:向敌横排投掷竹矛，9点伤害、攻击前:向敌前排投掷竹矛，5点伤害'],
      [16, 4, '登场:向敌横排投掷竹矛，10点伤害、攻击前:向敌前排投掷竹矛，5点伤害'],
      [18, 4, '登场:向敌横排投掷竹矛，10点伤害、攻击前:向敌前排投掷竹矛，6点伤害'],
      [19, 5, '登场:向敌横排投掷竹矛，12点伤害、攻击前:向敌前排投掷竹矛，6点伤害'],
      [21, 5, '登场:向敌横排投掷竹矛，12点伤害、攻击前:向敌前排投掷竹矛，7点伤害']
    ]
  },
  {
    name: '雪庐草人',
    quality: '蓝',
    cost: 1,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/xuelucaoren.jpg', import.meta.url),
    data: [
      [0, 1, '【传承6】、死亡：英雄生命+20，若脚下已冰封，抽一张牌'],
      [0, 1, '【传承7】、死亡：英雄生命+22，若脚下已冰封，抽一张牌'],
      [0, 1, '【传承8】、死亡：英雄生命+25，若脚下已冰封，抽一张牌'],
      [0, 1, '【传承9】、死亡：英雄生命+30，若脚下已冰封，抽一张牌'],
      [0, 1, '【传承10】、死亡：英雄生命+35，若脚下已冰封，抽一张牌'],
      [0, 1, '【传承11】、死亡：英雄生命+40，若脚下已冰封，抽一张牌'],
      [0, 1, '【传承12】、死亡：英雄生命+45，若脚下已冰封，抽一张牌'],
      [0, 1, '【传承13】、死亡：英雄生命+50，若脚下已冰封，抽一张牌'],
      [0, 1, '【传承15】、死亡：英雄生命+55，若脚下已冰封，抽一张牌']
    ]
  },
  {
    name: '熊二宝',
    quality: '蓝',
    cost: 1,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/xiongerbao.jpg', import.meta.url),
    data: [
      [7, 2, '【传承3】、【践踏】'],
      [8, 2, '【传承3】、【践踏】'],
      [9, 2, '【传承3】、【践踏】'],
      [10, 2, '【传承3】、【践踏】'],
      [11, 2, '【传承3】、【践踏】'],
      [12, 2, '【传承3】、【践踏】'],
      [13, 3, '【传承3】、【践踏】'],
      [14, 2, '【传承3】、【践踏】'],
      [15, 3, '【传承3】、【践踏】']
    ]
  },
  {
    name: '白羊药师',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/baiyangyaoshi.jpg', import.meta.url),
    data: [
      [11, 11, '前排登场:英雄生命+11；后排登场:敌方英雄生命-11'],
      [13, 13, '前排登场:英雄生命+13；后排登场:敌方英雄生命-13'],
      [14, 15, '前排登场:英雄生命+14；后排登场:敌方英雄生命-14'],
      [16, 16, '前排登场:英雄生命+16；后排登场:敌方英雄生命-16'],
      [17, 18, '前排登场:英雄生命+18；后排登场:敌方英雄生命-18'],
      [19, 19, '前排登场:英雄生命+19；后排登场:敌方英雄生命-19'],
      [21, 21, '前排登场:英雄生命+21；后排登场:敌方英雄生命-21'],
      [23, 23, '前排登场:英雄生命+23；后排登场:敌方英雄生命-23'],
      [25, 25, '前排登场:英雄生命+25；后排登场:敌方英雄生命-25']
    ]
  },
  {
    name: '拒马',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/juma.jpg', import.meta.url),
    data: [
      [8, 23, '【守军】、【荆棘】'],
      [9, 25, '【守军】、【荆棘】'],
      [10, 27, '【守军】、【荆棘】'],
      [12, 28, '【守军】、【荆棘】'],
      [13, 30, '【守军】、【荆棘】'],
      [14, 34, '【守军】、【荆棘】'],
      [16, 36, '【守军】、【荆棘】'],
      [18, 38, '【守军】、【荆棘】'],
      [20, 40, '【守军】、【荆棘】']
    ]
  },
  {
    name: '长耳庄巧姑',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/changerzhuangqiaogu.jpg', import.meta.url),
    data: [
      [6, 7, '【洞察1】、【传承6】、法力上限+1'],
      [6, 9, '【洞察1】、【传承6】、法力上限+1'],
      [7, 9, '【洞察1】、【传承7】、法力上限+1'],
      [7, 10, '【洞察1】、【传承8】、法力上限+1'],
      [8, 11, '【洞察1】、【传承8】、法力上限+1'],
      [9, 11, '【洞察1】、【传承9】、法力上限+1'],
      [10, 12, '【洞察1】、【传承10】、法力上限+1'],
      [12, 13, '【洞察1】、【传承10】、法力上限+1'],
      [14, 15, '【洞察1】、【传承10】、法力上限+1']
    ]
  },
  {
    name: '黑竹守卫',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/heizhushouwei.jpg', import.meta.url),
    data: [
      [3, 20, '受到传承:自身+5/-1，竹枪投向随机敌军，9点伤害'],
      [3, 23, '受到传承:自身+5/-1，竹枪投向随机敌军，10点伤害'],
      [4, 24, '受到传承:自身+6/-1，竹枪投向随机敌军，11点伤害'],
      [5, 27, '受到传承:自身+6/-1，竹枪投向随机敌军，12点伤害'],
      [6, 30, '受到传承:自身+7/-1，竹枪投向随机敌军，13点伤害'],
      [6, 36, '受到传承:自身+7/-1，竹枪投向随机敌军，14点伤害'],
      [7, 39, '受到传承:自身+8/-1，竹枪投向随机敌军，15点伤害'],
      [7, 45, '受到传承:自身+9/-1，竹枪投向随机敌军，16点伤害'],
      [8, 48, '受到传承:自身+9/-1，竹枪投向随机敌军，18点伤害']
    ]
  },
  {
    name: '苦行武僧',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/kuxingwuseng.jpg', import.meta.url),
    data: [
      [10, 14, '【传承4】、回合结束:自身+3/+2，魔防+2'],
      [11, 15, '【传承4】、回合结束:自身+3/+3，魔防+2'],
      [12, 18, '【传承5】、回合结束:自身+3/+3，魔防+3'],
      [13, 21, '【传承5】、回合结束:自身+3/+3，魔防+3'],
      [14, 23, '【传承5】、回合结束:自身+4/+3，魔防+3'],
      [15, 27, '【传承6】、回合结束:自身+4/+3，魔防+4'],
      [16, 30, '【传承6】、回合结束:自身+4/+4，魔防+4'],
      [18, 32, '【传承7】、回合结束:自身+4/+4，魔防+4'],
      [20, 35, '【传承7】、回合结束:自身+4/+4，魔防+5']
    ]
  },
  {
    name: '树木之怒',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/shumuzhinu.jpg', import.meta.url),
    data: [
      [0, 0, '随机区域敌军、及敌方玩家受到20点伤害'],
      [0, 0, '随机区域敌军、及敌方玩家受到25点伤害'],
      [0, 0, '随机区域敌军、及敌方玩家受到30点伤害'],
      [0, 0, '随机区域敌军、及敌方玩家受到35点伤害'],
      [0, 0, '随机区域敌军、及敌方玩家受到39点伤害'],
      [0, 0, '随机区域敌军、及敌方玩家受到43点伤害'],
      [0, 0, '随机区域敌军、及敌方玩家受到48点伤害'],
      [0, 0, '随机区域敌军、及敌方玩家受到51点伤害'],
      [0, 0, '随机区域敌军、及敌方玩家受到54点伤害']
    ]
  },
  {
    name: '飓风术',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/jufengshu.jpg', import.meta.url),
    data: [
      [0, 0, '目标敌军吹回手上、英雄生命+14'],
      [0, 0, '【洞察1】、目标敌军吹回手上、英雄生命+15'],
      [0, 0, '【洞察1】、目标敌军吹回手上、英雄生命+18'],
      [0, 0, '【洞察1】、目标敌军吹回手上、英雄生命+21'],
      [0, 0, '【洞察1】、目标敌军吹回手上、英雄生命+24'],
      [0, 0, '【洞察1】、目标敌军吹回手上、英雄生命+27'],
      [0, 0, '【洞察1】、目标敌军吹回手上、英雄生命+30'],
      [0, 0, '【洞察1】、目标敌军吹回手上、英雄生命+33'],
      [0, 0, '【洞察1】、目标敌军吹回手上、英雄生命+36']
    ]
  },
  {
    name: '锁妖塔守卫',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/suoyaotashouwei.jpg', import.meta.url),
    data: [
      [14, 13, '【洞察1】、【法力封锁1】'],
      [15, 15, '【洞察1】、【法力封锁1】'],
      [16, 17, '【洞察1】、【法力封锁1】'],
      [18, 18, '【洞察1】、【法力封锁1】'],
      [20, 20, '【洞察1】、【法力封锁1】'],
      [23, 22, '【洞察1】、【法力封锁1】'],
      [26, 24, '【洞察1】、【法力封锁1】'],
      [28, 27, '【洞察1】、【法力封锁1】'],
      [30, 30, '【洞察1】、【法力封锁1】']
    ]
  },
  {
    name: '熊小宝',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/xiongxiaobao.jpg', import.meta.url),
    data: [
      [3, 5, '【传承4】、【连击】'],
      [4, 5, '【传承4】、【连击】'],
      [4, 5, '【传承5】、【连击】'],
      [5, 5, '【传承5】、【连击】'],
      [6, 5, '【传承5】、【连击】'],
      [6, 6, '【传承6】、【连击】'],
      [7, 6, '【传承6】、【连击】'],
      [7, 8, '【传承6】、【连击】'],
      [8, 8, '【传承6】、【连击】']
    ]
  },
  {
    name: '明月心',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/mingyuexin.jpg', import.meta.url),
    data: [
      [0, 0, '目标友军+7/+7，获得【魂歌】、抽一张牌'],
      [0, 0, '目标友军+8/+8，获得【魂歌】、抽一张牌'],
      [0, 0, '目标友军+9/+9，获得【魂歌】、抽一张牌'],
      [0, 0, '目标友军+10/+10，获得【魂歌】、抽一张牌'],
      [0, 0, '目标友军+11/+11，获得【魂歌】、抽一张牌'],
      [0, 0, '目标友军+12/+13，获得【魂歌】、抽一张牌'],
      [0, 0, '目标友军+14/+14，获得【魂歌】、抽一张牌'],
      [0, 0, '目标友军+16/+16，获得【魂歌】、抽一张牌'],
      [0, 0, '目标友军+18/+18，获得【魂歌】、抽一张牌']
    ]
  },
  {
    name: '叶幻师',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/yehuanshi.jpg', import.meta.url),
    data: [
      [20, 1, '【传承5】、登场:和随机相邻友军调换位置'],
      [23, 1, '【传承6】、登场:和随机相邻友军调换位置'],
      [26, 1, '【传承7】、登场:和随机相邻友军调换位置'],
      [29, 1, '【传承8】、登场:和随机相邻友军调换位置'],
      [32, 1, '【传承9】、登场:和随机相邻友军调换位置'],
      [36, 1, '【传承9】、登场:和随机相邻友军调换位置'],
      [40, 1, '【传承10】、登场:和随机相邻友军调换位置'],
      [44, 1, '【传承11】、登场:和随机相邻友军调换位置'],
      [49, 1, '【传承12】、登场:和随机相邻友军调换位置']
    ]
  },
  {
    name: '龟族僧人',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/guizusengren.jpg', import.meta.url),
    data: [
      [10, 17, '【护甲3】、【回命】、获得传承:护甲+4'],
      [12, 18, '【护甲4】、【回命】、获得传承:护甲+4'],
      [13, 21, '【护甲4】、【回命】、获得传承:护甲+4'],
      [14, 24, '【护甲4】、【回命】、获得传承:护甲+5'],
      [16, 25, '【护甲5】、【回命】、获得传承:护甲+5'],
      [18, 28, '【护甲5】、【回命】、获得传承:护甲+5'],
      [20, 30, '【护甲5】、【回命】、获得传承:护甲+6'],
      [22, 32, '【护甲6】、【回命】、获得传承:护甲+6'],
      [25, 35, '【护甲6】、【回命】、获得传承:护甲+6']
    ]
  },
  {
    name: '执剑道者',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/zhijiandaozhe.jpg', import.meta.url),
    data: [
      [11, 18, '命中玩家:全体友军+2/+2'],
      [13, 19, '命中玩家:全体友军+2/+3'],
      [15, 22, '命中玩家:全体友军+2/+3'],
      [16, 25, '命中玩家:全体友军+3/+3'],
      [19, 26, '命中玩家:全体友军+3/+3'],
      [21, 28, '命中玩家:全体友军+3/+4'],
      [24, 30, '命中玩家:全体友军+3/+4'],
      [27, 33, '命中玩家:全体友军+3/+4'],
      [30, 35, '命中玩家:全体友军+4/+4']
    ]
  },
  {
    name: '深山采药人',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/shenshancaiyaoren.jpg', import.meta.url),
    data: [
      [9, 15, '【传承5】、登场:英雄生命+13'],
      [10, 18, '【传承5】、登场:英雄生命+15'],
      [12, 20, '【传承6】、登场:英雄生命+18'],
      [13, 23, '【传承6】、登场:英雄生命+20'],
      [14, 25, '【传承6】、登场:英雄生命+22'],
      [16, 26, '【传承7】、登场:英雄生命+25'],
      [18, 28, '【传承8】、登场:英雄生命+25'],
      [20, 30, '【传承9】、登场:英雄生命+30'],
      [22, 35, '【传承10】、登场:英雄生命+30']
    ]
  },
  {
    name: '连击',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/lianji.jpg', import.meta.url),
    data: [
      [0, 0, '目标友军+3/+15，魔防+1，获得【二连击】'],
      [0, 0, '目标友军+3/+17，魔防+2，获得【二连击】'],
      [0, 0, '目标友军+4/+18，魔防+3，获得【二连击】'],
      [0, 0, '目标友军+5/+19，魔防+4，获得【二连击】'],
      [0, 0, '目标友军+6/+20，魔防+5，获得【二连击】'],
      [0, 0, '目标友军+6/+23，魔防+5，获得【二连击】'],
      [0, 0, '目标友军+7/+25，魔防+5，获得【二连击】'],
      [0, 0, '目标友军+7/+28，魔防+6，获得【二连击】'],
      [0, 0, '目标友军+8/+30，魔防+6，获得【二连击】']
    ]
  },
  {
    name: '铁山靠',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/tieshankao.jpg', import.meta.url),
    data: [
      [0, 0, '【洞察1】、目标友军加攻，等同其一半生命值、另一友军生命+5、70%几率抽一张牌'],
      [0, 0, '【洞察1】、目标友军加攻，等同其一半生命值、另一友军生命+6、75%几率抽一张牌'],
      [0, 0, '【洞察1】、目标友军加攻，等同其一半生命值、另一友军生命+8、75%几率抽一张牌'],
      [0, 0, '【洞察1】、目标友军加攻，等同其一半生命值、另一友军生命+10、75%几率抽一张牌'],
      [0, 0, '【洞察1】、目标友军加攻，等同其一半生命值、另一友军生命+12、75%几率抽一张牌'],
      [0, 0, '【洞察1】、目标友军加攻，等同其一半生命值、另一友军生命+15、75%几率抽一张牌'],
      [0, 0, '【洞察1】、目标友军加攻，等同其一半生命值、另一友军生命+18、75%几率抽一张牌'],
      [0, 0, '【洞察1】、目标友军加攻，等同其一半生命值、另一友军生命+21、75%几率抽一张牌'],
      [0, 0, '【洞察1】、目标友军加攻，等同其一半生命值、另一友军生命+24、75%几率抽一张牌']
    ]
  },
  {
    name: '味仙居小妹',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/weixianjuxiaomei.jpg', import.meta.url),
    data: [
      [10, 11, '前排登场:另一友军攻击+10；后排登场:另一友军生命+16'],
      [12, 12, '前排登场:另一友军攻击+12；后排登场:另一友军生命+18'],
      [13, 14, '前排登场:另一友军攻击+13；后排登场:另一友军生命+20'],
      [15, 15, '前排登场:另一友军攻击+15；后排登场:另一友军生命+25'],
      [16, 17, '前排登场:另一友军攻击+16；后排登场:另一友军生命+30'],
      [18, 18, '前排登场:另一友军攻击+18；后排登场:另一友军生命+32'],
      [20, 20, '前排登场:另一友军攻击+20；后排登场:另一友军生命+35'],
      [22, 22, '前排登场:另一友军攻击+23；后排登场:另一友军生命+40'],
      [25, 25, '前排登场:另一友军攻击+25；后排登场:另一友军生命+45']
    ]
  },
  {
    name: '醉道人',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/zuidaoren.jpg', import.meta.url),
    data: [
      [14, 20, '攻击前、死亡:全场其他生物受到1点伤害'],
      [16, 21, '攻击前、死亡:全场其他生物受到1点伤害'],
      [17, 25, '攻击前、死亡:全场其他生物受到1点伤害'],
      [19, 27, '攻击前、死亡:全场其他生物受到1点伤害'],
      [21, 30, '攻击前、死亡:全场其他生物受到1点伤害'],
      [23, 33, '攻击前、死亡:全场其他生物受到1点伤害'],
      [25, 37, '攻击前、死亡:全场其他生物受到1点伤害'],
      [27, 42, '攻击前、死亡:全场其他生物受到1点伤害'],
      [30, 45, '攻击前、死亡:全场其他生物受到1点伤害']
    ]
  },
  {
    name: '明月曲',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/mingyuequ.jpg', import.meta.url),
    data: [
      [0, 0, '【洞察1】、7个友军+3/+3、抽一张牌'],
      [0, 0, '【洞察1】、7个友军+3/+4、抽一张牌'],
      [0, 0, '【洞察1】、7个友军+4/+4、抽一张牌'],
      [0, 0, '【洞察1】、7个友军+4/+5、抽一张牌'],
      [0, 0, '【洞察1】、7个友军+5/+5、抽一张牌'],
      [0, 0, '【洞察1】、7个友军+5/+6、抽一张牌'],
      [0, 0, '【洞察1】、7个友军+6/+6、抽一张牌'],
      [0, 0, '【洞察1】、7个友军+6/+7、抽一张牌'],
      [0, 0, '【洞察1】、7个友军+7/+7、抽一张牌']
    ]
  },
  {
    name: '雪狐剑客',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/xuehujianke.jpg', import.meta.url),
    data: [
      [14, 13, '登场：飞剑攻击随机敌军（5点伤害）、攻击前：友方若有冰封，飞剑攻击'],
      [15, 15, '登场：飞剑攻击随机敌军（5点伤害）、攻击前：友方若有冰封，飞剑攻击'],
      [17, 16, '登场：飞剑攻击随机敌军（6点伤害）、攻击前：友方若有冰封，飞剑攻击'],
      [18, 18, '登场：飞剑攻击随机敌军（7点伤害）、攻击前：友方若有冰封，飞剑攻击'],
      [20, 20, '登场：飞剑攻击随机敌军（8点伤害）、攻击前：友方若有冰封，飞剑攻击'],
      [23, 22, '登场：飞剑攻击随机敌军（9点伤害）、攻击前：友方若有冰封，飞剑攻击'],
      [26, 24, '登场：飞剑攻击随机敌军（10点伤害）、攻击前：友方若有冰封，飞剑攻击'],
      [29, 26, '登场：飞剑攻击随机敌军（11点伤害）、攻击前：友方若有冰封，飞剑攻击'],
      [33, 28, '登场：飞剑攻击随机敌军（12点伤害）、攻击前：友方若有冰封，飞剑攻击']
    ]
  },
  {
    name: '雪隐谷樵夫',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/xueyinguqiaofu.jpg', import.meta.url),
    data: [
      [12, 15, '【传承3】、回合开始：友方若有冰封，传承+3'],
      [13, 18, '【传承4】、回合开始：友方若有冰封，传承+3'],
      [15, 19, '【传承4】、回合开始：友方若有冰封，传承+4'],
      [16, 22, '【传承5】、回合开始：友方若有冰封，传承+4'],
      [18, 24, '【传承5】、回合开始：友方若有冰封，传承+4'],
      [20, 27, '【传承6】、回合开始：友方若有冰封，传承+4'],
      [22, 30, '【传承6】、回合开始：友方若有冰封，传承+5'],
      [25, 33, '【传承6】、回合开始：友方若有冰封，传承+5'],
      [27, 36, '【传承6】、回合开始：友方若有冰封，传承+6']
    ]
  },
  {
    name: '疾风猎手',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/jifenglieshou.jpg', import.meta.url),
    data: [
      [16, 11, '登场回合结束:射击敌方英雄'],
      [18, 12, '登场回合结束:射击敌方英雄'],
      [20, 13, '登场回合结束:射击敌方英雄'],
      [22, 15, '登场回合结束:射击敌方英雄'],
      [25, 15, '登场回合结束:射击敌方英雄'],
      [27, 17, '登场回合结束:射击敌方英雄'],
      [30, 18, '登场回合结束:射击敌方英雄'],
      [32, 20, '登场回合结束:射击敌方英雄'],
      [35, 21, '登场回合结束:射击敌方英雄']
    ]
  },
  {
    name: '妙音坊乐师',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/miaoyinfangyueshi.jpg', import.meta.url),
    data: [
      [12, 7, '【传承6】、【魂歌】、登场:相邻友军攻击+5，并获得【魂歌】'],
      [13, 8, '【传承7】、【魂歌】、登场:相邻友军攻击+5，并获得【魂歌】'],
      [14, 9, '【传承7】、【魂歌】、登场:相邻友军攻击+6，并获得【魂歌】'],
      [15, 10, '【传承8】、【魂歌】、登场:相邻友军攻击+6，并获得【魂歌】'],
      [17, 10, '【传承8】、【魂歌】、登场:相邻友军攻击+7，并获得【魂歌】'],
      [18, 12, '【传承8】、【魂歌】、登场:相邻友军攻击+8，并获得【魂歌】'],
      [19, 13, '【传承9】、【魂歌】、登场:相邻友军攻击+9，并获得【魂歌】'],
      [20, 15, '【传承9】、【魂歌】、登场:相邻友军攻击+10，并获得【魂歌】'],
      [22, 16, '【传承10】、【魂歌】、登场:相邻友军攻击+10，并获得【魂歌】']
    ]
  },
  {
    name: '风铃道人',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/fenglingdaoren.jpg', import.meta.url),
    data: [
      [13, 12, '【洞察1】、登场:吹回随机敌军'],
      [14, 14, '【洞察1】、登场:吹回随机敌军'],
      [16, 15, '【洞察1】、登场:吹回随机敌军'],
      [17, 17, '【洞察1】、登场:吹回随机敌军'],
      [19, 19, '【洞察1】、登场:吹回随机敌军'],
      [21, 21, '【洞察1】、登场:吹回随机敌军'],
      [23, 23, '【洞察1】、登场:吹回随机敌军'],
      [26, 26, '【洞察1】、登场:吹回随机敌军'],
      [29, 29, '【洞察1】、登场:吹回随机敌军']
    ]
  },
  {
    name: '祥云师太',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/xiangyunshitai.jpg', import.meta.url),
    data: [
      [10, 10, '【传承10】、登场:随机相邻友军生命加倍，获得【护甲1】'],
      [11, 11, '【传承10】、登场:随机相邻友军生命加倍，获得【护甲2】'],
      [12, 12, '【传承11】、登场:随机相邻友军生命加倍，获得【护甲2】'],
      [13, 13, '【传承12】、登场:随机相邻友军生命加倍，获得【护甲3】'],
      [14, 15, '【传承13】、登场:随机相邻友军生命加倍，获得【护甲3】'],
      [16, 16, '【传承14】、登场:随机相邻友军生命加倍，获得【护甲3】'],
      [18, 18, '【传承15】、登场:随机相邻友军生命加倍，获得【护甲3】'],
      [21, 21, '【传承16】、登场:随机相邻友军生命加倍，获得【护甲3】'],
      [24, 24, '【传承16】、登场:随机相邻友军生命加倍，获得【护甲4】']
    ]
  },
  {
    name: '幽谷粮仓',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/youguliangcang.jpg', import.meta.url),
    data: [
      [0, 36, '回合开始:另一随机友军+3/+7，魔防+2'],
      [0, 42, '回合开始:另一随机友军+3/+8，魔防+2'],
      [0, 48, '回合开始:另一随机友军+3/+8，魔防+3'],
      [0, 55, '回合开始:另一随机友军+3/+9，魔防+3'],
      [0, 60, '回合开始:另一随机友军+3/+10，魔防+3'],
      [0, 68, '回合开始:另一随机友军+3/+12，魔防+3'],
      [0, 75, '回合开始:另一随机友军+4/+12，魔防+4'],
      [0, 82, '回合开始:另一随机友军+4/+14，魔防+4'],
      [0, 90, '回合开始:另一随机友军+5/+15，魔防+4']
    ]
  },
  {
    name: '风卷残云',
    quality: '蓝',
    cost: 4,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/fengjuancanyun.jpg', import.meta.url),
    data: [
      [0, 0, '吹回横排所有敌军，英雄生命+15，60%几率获得《真理石碎片》'],
      [0, 0, '吹回横排所有敌军，英雄生命+16，66%几率获得《真理石碎片》'],
      [0, 0, '吹回横排所有敌军，英雄生命+18，66%几率获得《真理石碎片》'],
      [0, 0, '吹回横排所有敌军，英雄生命+20，66%几率获得《真理石碎片》'],
      [0, 0, '吹回横排所有敌军，英雄生命+22，66%几率获得《真理石碎片》'],
      [0, 0, '吹回横排所有敌军，英雄生命+24，66%几率获得《真理石碎片》'],
      [0, 0, '吹回横排所有敌军，英雄生命+27，66%几率获得《真理石碎片》'],
      [0, 0, '吹回横排所有敌军，英雄生命+30，66%几率获得《真理石碎片》'],
      [0, 0, '吹回横排所有敌军，英雄生命+33，66%几率获得《真理石碎片》']
    ]
  },
  {
    name: '茁壮生长',
    quality: '蓝',
    cost: 4,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/zhuozhuangchengzhang.jpg', import.meta.url),
    data: [
      [0, 0, '目标生物+5/+26、英雄生命+26'],
      [0, 0, '目标生物+5/+30、英雄生命+30'],
      [0, 0, '目标生物+5/+35、英雄生命+35'],
      [0, 0, '目标生物+6/+40、英雄生命+40'],
      [0, 0, '目标生物+6/+45、英雄生命+45'],
      [0, 0, '目标生物+7/+50、英雄生命+50'],
      [0, 0, '目标生物+7/+60、英雄生命+60'],
      [0, 0, '目标生物+8/+65、英雄生命+65'],
      [0, 0, '目标生物+9/+70、英雄生命+70']
    ]
  },
  {
    name: '羊族壮士',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/yangzuzhuangshi.jpg', import.meta.url),
    data: [
      [17, 23, '登场:英雄生命+23、受到传承:英雄生命+23'],
      [19, 28, '登场:英雄生命+28、受到传承:英雄生命+28'],
      [21, 32, '登场:英雄生命+32、受到传承:英雄生命+32'],
      [23, 36, '登场:英雄生命+36、受到传承:英雄生命+36'],
      [25, 40, '登场:英雄生命+40、受到传承:英雄生命+40'],
      [27, 45, '登场:英雄生命+45、受到传承:英雄生命+45'],
      [30, 50, '登场:英雄生命+50、受到传承:英雄生命+50'],
      [33, 55, '登场:英雄生命+55、受到传承:英雄生命+55'],
      [36, 60, '登场:英雄生命+60、受到传承:英雄生命+60']
    ]
  },
  {
    name: '勇气师范',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/yongqishifan.jpg', import.meta.url),
    data: [
      [9, 30, '登场:随机相邻友军加攻，等同其一半生命值'],
      [10, 32, '登场:随机相邻友军加攻，等同其一半生命值'],
      [11, 35, '登场:随机相邻友军加攻，等同其一半生命值'],
      [12, 39, '登场:随机相邻友军加攻，等同其一半生命值'],
      [13, 45, '登场:随机相邻友军加攻，等同其一半生命值'],
      [15, 50, '登场:随机相邻友军加攻，等同其一半生命值'],
      [17, 65, '登场:随机相邻友军加攻，等同其一半生命值'],
      [19, 60, '登场:随机相邻友军加攻，等同其一半生命值'],
      [22, 66, '登场:随机相邻友军加攻，等同其一半生命值']
    ]
  },
  {
    name: '传记·前世',
    quality: '蓝',
    cost: 2,
    type: 3,
    img: new URL('@/assets/zhongzu/chanyigu/zhuanji_qianshi.jpg', import.meta.url),
    data: [
      [0, 0, '召唤斑毛幼猪-lv12，获得【传记·今生】'],
      [0, 0, '召唤斑毛幼猪-lv13，获得【传记·今生】'],
      [0, 0, '召唤斑毛幼猪-lv14，获得【传记·今生】'],
      [0, 0, '召唤斑毛幼猪-lv15，获得【传记·今生】'],
      [0, 0, '召唤斑毛幼猪-lv16，获得【传记·今生】'],
      [0, 0, '召唤斑毛幼猪-lv17，获得【传记·今生】'],
      [0, 0, '召唤斑毛幼猪-lv18，获得【传记·今生】'],
      [0, 0, '召唤斑毛幼猪-lv19，获得【传记·今生】'],
      [0, 0, '召唤斑毛幼猪-lv20，获得【传记·今生】']
    ]
  },
  {
    name: '传记·今生',
    quality: '蓝',
    cost: 3,
    type: 3,
    img: new URL('@/assets/zhongzu/chanyigu/zhuanji_jinsheng.jpg', import.meta.url),
    data: [
      [0, 0, '召唤深山采药人-lv12'],
      [0, 0, '召唤深山采药人-lv13'],
      [0, 0, '召唤深山采药人-lv14'],
      [0, 0, '召唤深山采药人-lv15'],
      [0, 0, '召唤深山采药人-lv16'],
      [0, 0, '召唤深山采药人-lv17'],
      [0, 0, '召唤深山采药人-lv18'],
      [0, 0, '召唤深山采药人-lv19'],
      [0, 0, '召唤深山采药人-lv20']
    ]
  },
  {
    name: '蟠桃隐士',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/pantaoyinshi.jpg', import.meta.url),
    data: [
      [0, 22, '【洞察1】、回合结束:获得手牌:仙桃-lv12'],
      [0, 25, '【洞察1】、回合结束:获得手牌:仙桃-lv13'],
      [0, 29, '【洞察1】、回合结束:获得手牌:仙桃-lv14'],
      [0, 33, '【洞察1】、回合结束:获得手牌:仙桃-lv15'],
      [0, 37, '【洞察1】、回合结束:获得手牌:仙桃-lv16'],
      [0, 40, '【洞察1】、回合结束:获得手牌:仙桃-lv17'],
      [0, 45, '【洞察1】、回合结束:获得手牌:仙桃-lv18'],
      [0, 52, '【洞察1】、回合结束:获得手牌:仙桃-lv19'],
      [0, 60, '【洞察1】、回合结束:获得手牌:仙桃-lv20']
    ]
  },
  {
    name: '仙灵藤蔓',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/xianlingtengwan.jpg', import.meta.url),
    data: [
      [2, 25, '回合结束:自身生命+12，若生命高于50，获得【磐龙】'],
      [3, 28, '回合结束:自身生命+12，若生命高于50，获得【磐龙】'],
      [3, 30, '回合结束:自身生命+15，若生命高于50，获得【磐龙】'],
      [3, 33, '回合结束:自身生命+16，若生命高于50，获得【磐龙】'],
      [3, 38, '回合结束:自身生命+18，若生命高于50，获得【磐龙】'],
      [4, 42, '回合结束:自身生命+20，若生命高于50，获得【磐龙】'],
      [4, 48, '回合结束:自身生命+22，若生命高于50，获得【磐龙】'],
      [5, 49, '回合结束:自身生命+25，若生命高于50，获得【磐龙】'],
      [6, 49, '回合结束:自身生命+30，若生命高于50，获得【磐龙】']
    ]
  },
  {
    name: '植甲师',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/zhijiashi.jpg', import.meta.url),
    data: [
      [12, 15, '【护甲3】、【传承3】、受到传承:全体友军+2/+3，护甲+3'],
      [13, 16, '【护甲3】、【传承3】、受到传承:全体友军+2/+3，护甲+3'],
      [14, 19, '【护甲3】、【传承3】、受到传承:全体友军+3/+3，护甲+3'],
      [16, 21, '【护甲3】、【传承3】、受到传承:全体友军+3/+3，护甲+3'],
      [18, 22, '【护甲3】、【传承3】、受到传承:全体友军+3/+3，护甲+3'],
      [19, 25, '【护甲4】、【传承3】、受到传承:全体友军+3/+3，护甲+3'],
      [21, 27, '【护甲4】、【传承4】、受到传承:全体友军+3/+3，护甲+3'],
      [23, 29, '【护甲4】、【传承4】、受到传承:全体友军+4/+4，护甲+3'],
      [25, 32, '【护甲4】、【传承4】、受到传承:全体友军+4/+4，护甲+4']
    ]
  },
  {
    name: '扫叶僧',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/saoyeseng.jpg', import.meta.url),
    data: [
      [15, 7, '前排登场:自身获得【传承5】；后排登场:对面首位敌军移回英雄手上'],
      [16, 8, '前排登场:自身获得【传承6】；后排登场:对面首位敌军移回英雄手上'],
      [17, 9, '前排登场:自身获得【传承7】；后排登场:对面首位敌军移回英雄手上'],
      [18, 10, '前排登场:自身获得【传承8】；后排登场:对面首位敌军移回英雄手上'],
      [20, 11, '前排登场:自身获得【传承9】；后排登场:对面首位敌军移回英雄手上'],
      [22, 12, '前排登场:自身获得【传承10】；后排登场:对面首位敌军移回英雄手上'],
      [25, 13, '前排登场:自身获得【传承10】；后排登场:对面首位敌军移回英雄手上'],
      [27, 15, '前排登场:自身获得【传承11】；后排登场:对面首位敌军移回英雄手上'],
      [30, 16, '前排登场:自身获得【传承12】；后排登场:对面首位敌军移回英雄手上']
    ]
  },
  {
    name: '逍遥琴师',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/xiaoyaoqinshi.jpg', import.meta.url),
    data: [
      [10, 17, '回合开始:魔音攻击全体敌军和英雄2点伤害、回合结束:60%几率，魔音攻击'],
      [12, 19, '回合开始:魔音攻击全体敌军和英雄2点伤害、回合结束:65%几率，魔音攻击'],
      [13, 20, '回合开始:魔音攻击全体敌军和英雄3点伤害、回合结束:65%几率，魔音攻击'],
      [16, 21, '回合开始:魔音攻击全体敌军和英雄3点伤害、回合结束:70%几率，魔音攻击'],
      [19, 23, '回合开始:魔音攻击全体敌军和英雄3点伤害、回合结束:70%几率，魔音攻击'],
      [23, 25, '回合开始:魔音攻击全体敌军和英雄3点伤害、回合结束:75%几率，魔音攻击'],
      [25, 27, '回合开始:魔音攻击全体敌军和英雄4点伤害、回合结束:75%几率，魔音攻击'],
      [28, 31, '回合开始:魔音攻击全体敌军和英雄4点伤害、回合结束:75%几率，魔音攻击'],
      [33, 33, '回合开始:魔音攻击全体敌军和英雄4点伤害、回合结束:75%几率，魔音攻击']
    ]
  },
  {
    name: '驱魔道人',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/qumodaoren.jpg', import.meta.url),
    data: [
      [10, 14, '【洞察1】、【神佑】、命中时:自身+2/+3'],
      [12, 15, '【洞察1】、【神佑】、命中时:自身+2/+3'],
      [13, 18, '【洞察1】、【神佑】、命中时:自身+3/+3'],
      [15, 20, '【洞察1】、【神佑】、命中时:自身+3/+3'],
      [16, 22, '【洞察1】、【神佑】、命中时:自身+3/+4'],
      [19, 24, '【洞察1】、【神佑】、命中时:自身+3/+4'],
      [22, 25, '【洞察1】、【神佑】、命中时:自身+4/+4'],
      [25, 27, '【洞察1】、【神佑】、命中时:自身+4/+4'],
      [28, 29, '【洞察1】、【神佑】、命中时:自身+4/+4']
    ]
  },
  {
    name: '雪山飞狐',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/xueshanfeihu.jpg', import.meta.url),
    data: [
      [16, 11, '【魂歌】、回合开始：若脚下已冰封，攻击+4，获得【先攻】、首次获得传承：获得【连击】'],
      [18, 13, '【魂歌】、回合开始：若脚下已冰封，攻击+5，获得【先攻】、首次获得传承：获得【连击】'],
      [19, 15, '【魂歌】、回合开始：若脚下已冰封，攻击+5，获得【先攻】、首次获得传承：获得【连击】'],
      [21, 18, '【魂歌】、回合开始：若脚下已冰封，攻击+6，获得【先攻】、首次获得传承：获得【连击】'],
      [23, 20, '【魂歌】、回合开始：若脚下已冰封，攻击+6，获得【先攻】、首次获得传承：获得【连击】'],
      [26, 23, '【魂歌】、回合开始：若脚下已冰封，攻击+7，获得【先攻】、首次获得传承：获得【连击】'],
      [28, 26, '【魂歌】、回合开始：若脚下已冰封，攻击+7，获得【先攻】、首次获得传承：获得【连击】'],
      [30, 30, '【魂歌】、回合开始：若脚下已冰封，攻击+8，获得【先攻】、首次获得传承：获得【连击】'],
      [33, 33, '【魂歌】、回合开始：若脚下已冰封，攻击+9，获得【先攻】、首次获得传承：获得【连击】']
    ]
  },
  {
    name: '白鹿贤士',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/bailuxianshi.jpg', import.meta.url),
    data: [
      [14, 14, '前排登场:所有敌军-3/-3；后排登场:所有友军+5/+5'],
      [15, 16, '前排登场:所有敌军-4/-4；后排登场:所有友军+5/+5'],
      [17, 17, '前排登场:所有敌军-5/-5；后排登场:所有友军+5/+5'],
      [19, 19, '前排登场:所有敌军-5/-5；后排登场:所有友军+6/+6'],
      [21, 21, '前排登场:所有敌军-6/-6；后排登场:所有友军+6/+6'],
      [23, 23, '前排登场:所有敌军-7/-7；后排登场:所有友军+7/+7'],
      [25, 25, '前排登场:所有敌军-8/-8；后排登场:所有友军+8/+8'],
      [28, 28, '前排登场:所有敌军-9/-9；后排登场:所有友军+9/+9'],
      [32, 32, '前排登场:所有敌军-10/-10；后排登场:所有友军+10/+10']
    ]
  },
  {
    name: '御风武者',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/yufengwuzhe.jpg', import.meta.url),
    data: [
      [19, 12, '【先攻】、命中英雄时:75%几率吹回随机敌军'],
      [21, 13, '【先攻】、命中英雄时:75%几率吹回随机敌军'],
      [23, 15, '【先攻】、命中英雄时:75%几率吹回随机敌军'],
      [26, 17, '【先攻】、命中英雄时:75%几率吹回随机敌军'],
      [29, 19, '【先攻】、命中英雄时:75%几率吹回随机敌军'],
      [32, 21, '【先攻】、命中英雄时:75%几率吹回随机敌军'],
      [35, 24, '【先攻】、命中英雄时:75%几率吹回随机敌军'],
      [37, 29, '【先攻】、命中英雄时:75%几率吹回随机敌军'],
      [40, 32, '【先攻】、命中英雄时:75%几率吹回随机敌军']
    ]
  },
  {
    name: '墨轩隐士',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/moxuanyinshi.jpg', import.meta.url),
    data: [
      [3, 23, '法力上限+1、回合结束:复制场上另一单位，到你手上'],
      [3, 25, '【洞察1】、法力上限+1、回合结束:复制场上另一单位，到你手上'],
      [4, 26, '【洞察1】、法力上限+1、回合结束:复制场上另一单位，到你手上'],
      [4, 29, '【洞察1】、法力上限+1、回合结束:复制场上另一单位，到你手上'],
      [5, 33, '【洞察1】、法力上限+1、回合结束:复制场上另一单位，到你手上'],
      [5, 39, '【洞察1】、法力上限+1、回合结束:复制场上另一单位，到你手上'],
      [6, 45, '【洞察1】、法力上限+1、回合结束:复制场上另一单位，到你手上'],
      [6, 55, '【洞察1】、法力上限+1、回合结束:复制场上另一单位，到你手上'],
      [7, 60, '【洞察1】、法力上限+1、回合结束:复制场上另一单位，到你手上']
    ]
  },
  {
    name: '黑竹林地',
    quality: '紫',
    cost: 4,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/heizhulindi.jpg', import.meta.url),
    data: [
      [0, 0, '随机位置召唤3个3/20黑竹守卫-lv12'],
      [0, 0, '随机位置召唤3个3/23黑竹守卫-lv13'],
      [0, 0, '随机位置召唤3个4/24黑竹守卫-lv14'],
      [0, 0, '随机位置召唤3个5/27黑竹守卫-lv15'],
      [0, 0, '随机位置召唤3个6/30黑竹守卫-lv16'],
      [0, 0, '随机位置召唤3个6/36黑竹守卫-lv17'],
      [0, 0, '随机位置召唤3个7/39黑竹守卫-lv18'],
      [0, 0, '随机位置召唤3个7/45黑竹守卫-lv19'],
      [0, 0, '随机位置召唤3个8/48黑竹守卫-lv20']
    ]
  },
  {
    name: '蟠桃会',
    quality: '紫',
    cost: 4,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/pantaohui.jpg', import.meta.url),
    data: [
      [0, 0, '【洞察1】、抓3张牌，英雄生命+18、随机一个友军+4/+4'],
      [0, 0, '【洞察1】、抓3张牌，英雄生命+19、随机一个友军+5/+5'],
      [0, 0, '【洞察1】、抓3张牌，英雄生命+24、随机一个友军+5/+5'],
      [0, 0, '【洞察1】、抓3张牌，英雄生命+30、随机一个友军+5/+5'],
      [0, 0, '【洞察1】、抓3张牌，英雄生命+33、随机一个友军+6/+6'],
      [0, 0, '【洞察1】、抓3张牌，英雄生命+38、随机一个友军+6/+6'],
      [0, 0, '【洞察1】、抓3张牌，英雄生命+40、随机一个友军+7/+7'],
      [0, 0, '【洞察1】、抓3张牌，英雄生命+45、随机一个友军+8/+8'],
      [0, 0, '【洞察1】、抓3张牌，英雄生命+50、随机一个友军+9/+9']
    ]
  },
  {
    name: '泰山之力',
    quality: '紫',
    cost: 4,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/taishanzhili.jpg', import.meta.url),
    data: [
      [0, 0, '目标友军加攻，等同其一半生命值，并获得【护甲12】、【魔防2】'],
      [0, 0, '目标友军加攻，等同其一半生命值，并获得【护甲13】、【魔防3】'],
      [0, 0, '目标友军加攻，等同其一半生命值，并获得【护甲14】、【魔防4】'],
      [0, 0, '目标友军加攻，等同其一半生命值，并获得【护甲15】、【魔防5】'],
      [0, 0, '目标友军加攻，等同其一半生命值，并获得【护甲16】、【魔防6】'],
      [0, 0, '目标友军加攻，等同其一半生命值，并获得【护甲17】、【魔防7】'],
      [0, 0, '目标友军加攻，等同其一半生命值，并获得【护甲18】、【魔防8】'],
      [0, 0, '目标友军加攻，等同其一半生命值，并获得【护甲19】、【魔防9】'],
      [0, 0, '目标友军加攻，等同其一半生命值，并获得【护甲20】、【魔防10】']
    ]
  },
  {
    name: '龙纹尊者',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/longwenzunzhe.jpg', import.meta.url),
    data: [
      [14, 30, '【磐龙】、【护甲5】、受到传承时:自身额外+6/+6'],
      [16, 32, '【磐龙】、【护甲6】、受到传承时:自身额外+6/+6'],
      [18, 35, '【磐龙】、【护甲6】、受到传承时:自身额外+7/+7'],
      [20, 40, '【磐龙】、【护甲7】、受到传承时:自身额外+7/+7'],
      [23, 45, '【磐龙】、【护甲7】、受到传承时:自身额外+7/+7'],
      [26, 50, '【磐龙】、【护甲8】、受到传承时:自身额外+7/+7'],
      [29, 55, '【磐龙】、【护甲8】、受到传承时:自身额外+8/+8'],
      [32, 60, '【磐龙】、【护甲9】、受到传承时:自身额外+8/+8'],
      [35, 65, '【磐龙】、【护甲9】、受到传承时:自身额外+9/+9']
    ]
  },
  {
    name: '赏金刺客',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/shangjincike.jpg', import.meta.url),
    data: [
      [10, 20, '【连击】、每当一个敌军死亡：自身+1/+7、生命大于30，获得【磐龙】'],
      [11, 24, '【连击】、每当一个敌军死亡：自身+1/+7、生命大于30，获得【磐龙】'],
      [12, 26, '【连击】、每当一个敌军死亡：自身+2/+7、生命大于30，获得【磐龙】'],
      [14, 27, '【连击】、每当一个敌军死亡：自身+2/+8、生命大于30，获得【磐龙】'],
      [16, 29, '【连击】、每当一个敌军死亡：自身+2/+9、生命大于30，获得【磐龙】'],
      [18, 31, '【连击】、每当一个敌军死亡：自身+2/+9、生命大于40，获得【磐龙】'],
      [20, 33, '【连击】、每当一个敌军死亡：自身+2/+10、生命大于40，获得【磐龙】'],
      [23, 36, '【连击】、每当一个敌军死亡：自身+2/+12、生命大于40，获得【磐龙】'],
      [26, 39, '【连击】、每当一个敌军死亡：自身+3/+12、生命大于40，获得【磐龙】']
    ]
  },
  {
    name: '疾风传说',
    quality: '紫',
    cost: 4,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/jifengchuanshuo.jpg', import.meta.url),
    data: [
      [0, 0, '回手目标区域敌军，随机后排位置召唤疾风猎手-lv12'],
      [0, 0, '回手目标区域敌军，随机后排位置召唤疾风猎手-lv13'],
      [0, 0, '回手目标区域敌军，随机后排位置召唤疾风猎手-lv14'],
      [0, 0, '回手目标区域敌军，随机后排位置召唤疾风猎手-lv15'],
      [0, 0, '回手目标区域敌军，随机后排位置召唤疾风猎手-lv16'],
      [0, 0, '回手目标区域敌军，随机后排位置召唤疾风猎手-lv17'],
      [0, 0, '回手目标区域敌军，随机后排位置召唤疾风猎手-lv18'],
      [0, 0, '回手目标区域敌军，随机后排位置召唤疾风猎手-lv19'],
      [0, 0, '回手目标区域敌军，随机后排位置召唤疾风猎手-lv20']
    ]
  },
  {
    name: '渡船隐士',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/duchuanyinshi.jpg', import.meta.url),
    data: [
      [25, 16, '死亡:抓一张牌，生命+16、获得传承时:在相邻位置召唤渡船隐士'],
      [28, 18, '死亡:抓一张牌，生命+18、获得传承时:在相邻位置召唤渡船隐士'],
      [30, 20, '死亡:抓一张牌，生命+20、获得传承时:在相邻位置召唤渡船隐士'],
      [33, 22, '死亡:抓一张牌，生命+22、获得传承时:在相邻位置召唤渡船隐士'],
      [36, 24, '死亡:抓一张牌，生命+24、获得传承时:在相邻位置召唤渡船隐士'],
      [39, 26, '死亡:抓一张牌，生命+26、获得传承时:在相邻位置召唤渡船隐士'],
      [42, 28, '死亡:抓一张牌，生命+28、获得传承时:在相邻位置召唤渡船隐士'],
      [45, 30, '死亡:抓一张牌，生命+30、获得传承时:在相邻位置召唤渡船隐士'],
      [49, 32, '死亡:抓一张牌，生命+32、获得传承时:在相邻位置召唤渡船隐士']
    ]
  },
  {
    name: '狐剑仙',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/hujianxian.jpg', import.meta.url),
    data: [
      [20, 10, '回合开始:飞剑贯穿横排敌军10点伤害'],
      [23, 11, '回合开始:飞剑贯穿横排敌军11点伤害'],
      [26, 12, '回合开始:飞剑贯穿横排敌军12点伤害'],
      [30, 13, '回合开始:飞剑贯穿横排敌军13点伤害'],
      [35, 14, '回合开始:飞剑贯穿横排敌军14点伤害'],
      [40, 15, '回合开始:飞剑贯穿横排敌军15点伤害'],
      [45, 16, '回合开始:飞剑贯穿横排敌军16点伤害'],
      [50, 18, '回合开始:飞剑贯穿横排敌军18点伤害'],
      [55, 20, '回合开始:飞剑贯穿横排敌军20点伤害']
    ]
  },
  {
    name: '万物之灵',
    quality: '紫',
    cost: 5,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/wanwuzhiling.jpg', import.meta.url),
    data: [
      [0, 0, '目标友军+12/+12并获得【神佑】'],
      [0, 0, '目标友军+13/+14并获得【神佑】'],
      [0, 0, '目标友军+15/+15并获得【神佑】'],
      [0, 0, '目标友军+16/+17并获得【神佑】'],
      [0, 0, '目标友军+18/+18并获得【神佑】'],
      [0, 0, '目标友军+20/+20并获得【神佑】'],
      [0, 0, '目标友军+22/+22并获得【神佑】'],
      [0, 0, '目标友军+25/+25并获得【神佑】'],
      [0, 0, '目标友军+28/+28并获得【神佑】']
    ]
  },
  {
    name: '摇钱尊者',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/yaoqianzunzhe.jpg', import.meta.url),
    data: [
      [7, 55, '【洞察1】、【磐龙】、回合结束:若本回合受到过伤害，抽一张牌'],
      [8, 60, '【洞察1】、【磐龙】、回合结束:若本回合受到过伤害，抽一张牌'],
      [9, 66, '【洞察1】、【磐龙】、回合结束:若本回合受到过伤害，抽一张牌'],
      [10, 72, '【洞察1】、【磐龙】、回合结束:若本回合受到过伤害，抽一张牌'],
      [12, 80, '【洞察1】、【磐龙】、回合结束:若本回合受到过伤害，抽一张牌'],
      [14, 88, '【洞察1】、【磐龙】、回合结束:若本回合受到过伤害，抽一张牌'],
      [15, 99, '【洞察1】、【磐龙】、回合结束:若本回合受到过伤害，抽一张牌'],
      [17, 110, '【洞察1】、【磐龙】、回合结束:若本回合受到过伤害，抽一张牌'],
      [20, 125, '【洞察1】、【磐龙】、回合结束:若本回合受到过伤害，抽一张牌']
    ]
  },
  {
    name: '云游武僧',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/yunyouwuseng.jpg', import.meta.url),
    data: [
      [23, 26, '【先攻】、登场:相邻一个友军+2/+2，获得【连击】1回合'],
      [26, 28, '【先攻】、登场:相邻一个友军+2/+2，获得【连击】1回合'],
      [29, 29, '【先攻】、登场:相邻一个友军+2/+2，获得【连击】1回合'],
      [32, 32, '【先攻】、登场:相邻一个友军+3/+2，获得【连击】1回合'],
      [35, 35, '【先攻】、登场:相邻一个友军+3/+3，获得【连击】1回合'],
      [38, 38, '【先攻】、登场:相邻一个友军+3/+3，获得【连击】1回合'],
      [42, 42, '【先攻】、登场:相邻一个友军+4/+4，获得【连击】1回合'],
      [46, 46, '【先攻】、登场:相邻一个友军+4/+4，获得【连击】1回合'],
      [50, 50, '【先攻】、登场:相邻一个友军+5/+5，获得【连击】1回合']
    ]
  },
  {
    name: '披甲罗汉',
    quality: '紫',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/pijialuohan.jpg', import.meta.url),
    data: [
      [29, 29, '【护甲10】、受到传承:自身获得【魔免】、【回命】'],
      [32, 32, '【护甲12】、受到传承:自身获得【魔免】、【回命】'],
      [36, 36, '【护甲13】、受到传承:自身获得【魔免】、【回命】'],
      [40, 40, '【护甲15】、受到传承:自身获得【魔免】、【回命】'],
      [45, 45, '【护甲16】、受到传承:自身获得【魔免】、【回命】'],
      [50, 50, '【护甲17】、受到传承:自身获得【魔免】、【回命】'],
      [55, 55, '【护甲18】、受到传承:自身获得【魔免】、【回命】'],
      [60, 60, '【护甲19】、受到传承:自身获得【魔免】、【回命】'],
      [65, 65, '【护甲20】、受到传承:自身获得【魔免】、【回命】']
    ]
  },
  {
    name: '拔地而起',
    quality: '紫',
    cost: 6,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/badierqi.jpg', import.meta.url),
    data: [
      [0, 0, '在目标区域和随机区域共召唤3个1/30柏松隐者-lv12'],
      [0, 0, '在目标区域和随机区域共召唤3个1/33柏松隐者-lv13'],
      [0, 0, '在目标区域和随机区域共召唤3个1/36柏松隐者-lv14'],
      [0, 0, '在目标区域和随机区域共召唤3个1/40柏松隐者-lv15'],
      [0, 0, '在目标区域和随机区域共召唤3个2/45柏松隐者-lv16'],
      [0, 0, '在目标区域和随机区域共召唤3个2/50柏松隐者-lv17'],
      [0, 0, '在目标区域和随机区域共召唤3个2/55柏松隐者-lv18'],
      [0, 0, '在目标区域和随机区域共召唤3个2/60柏松隐者-lv19'],
      [0, 0, '在目标区域和随机区域共召唤3个3/63柏松隐者-lv20']
    ]
  },
  {
    name: '猛虎寨大王',
    quality: '紫',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/menghuzhaidawang.jpg', import.meta.url),
    data: [
      [26, 26, '攻击前，若本方有5个友军:则自身+15/+15获得【践踏】、【磐龙】(每局对战仅触发一次)'],
      [29, 29, '攻击前，若本方有5个友军:则自身+16/+16获得【践踏】、【磐龙】(每局对战仅触发一次)'],
      [32, 32, '攻击前，若本方有5个友军:则自身+18/+18获得【践踏】、【磐龙】(每局对战仅触发一次)'],
      [35, 35, '攻击前，若本方有5个友军:则自身+20/+20获得【践踏】、【磐龙】(每局对战仅触发一次)'],
      [36, 40, '攻击前，若本方有5个友军:则自身+22/+22获得【践踏】、【磐龙】(每局对战仅触发一次)'],
      [38, 45, '攻击前，若本方有5个友军:则自身+25/+25获得【践踏】、【磐龙】(每局对战仅触发一次)'],
      [40, 50, '攻击前，若本方有5个友军:则自身+28/+28获得【践踏】、【磐龙】(每局对战仅触发一次)'],
      [42, 55, '攻击前，若本方有5个友军:则自身+30/+30获得【践踏】、【磐龙】(每局对战仅触发一次)'],
      [45, 60, '攻击前，若本方有5个友军:则自身+33/+33获得【践踏】、【磐龙】(每局对战仅触发一次)']
    ]
  },
  {
    name: '寒霜寺护院僧',
    quality: '紫',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/hanshuangsihuyuanseng.jpg', import.meta.url),
    data: [
      [25, 60, '【迟缓】、【磐龙】、【魔防7】、攻击前：若脚已冰封，自身+7/+7，获得【践踏】、受到传承：魔防+7、获得【回命】'],
      [30, 65, '【迟缓】、【磐龙】、【魔防8】、攻击前：若脚已冰封，自身+8/+8，获得【践踏】、受到传承：魔防+8、获得【回命】'],
      [35, 70, '【迟缓】、【磐龙】、【魔防9】、攻击前：若脚已冰封，自身+9/+9，获得【践踏】、受到传承：魔防+9、获得【回命】'],
      [40, 80, '【迟缓】、【磐龙】、【魔防10】、攻击前：若脚已冰封，自身+10/+10，获得【践踏】、受到传承：魔防+10、获得【回命】'],
      [45, 90, '【迟缓】、【磐龙】、【魔防10】、攻击前：若脚已冰封，自身+10/+10，获得【践踏】、受到传承：魔防+10、获得【回命】'],
      [50, 100, '【迟缓】、【磐龙】、【魔防11】、攻击前：若脚已冰封，自身+11/+11，获得【践踏】、受到传承：魔防+11、获得【回命】'],
      [55, 110, '【迟缓】、【磐龙】、【魔防12】、攻击前：若脚已冰封，自身+12/+12，获得【践踏】、受到传承：魔防+12、获得【回命】'],
      [60, 120, '【迟缓】、【磐龙】、【魔防13】、攻击前：若脚已冰封，自身+13/+13，获得【践踏】、受到传承：魔防+13、获得【回命】'],
      [66, 130, '【迟缓】、【磐龙】、【魔防15】、攻击前：若脚已冰封，自身+15/+15，获得【践踏】、受到传承：魔防+15、获得【回命】']
    ]
  },
  {
    name: '酒豪',
    quality: '紫',
    cost: 7,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/jiuhao.jpg', import.meta.url),
    data: [
      [14, 39, '【二连击】、登场:横排每有一个敌军，自身+5/+5、【磐龙】1回合'],
      [16, 42, '【二连击】、登场:横排每有一个敌军，自身+6/+6、【磐龙】1回合'],
      [18, 48, '【二连击】、登场:横排每有一个敌军，自身+6/+6、【磐龙】1回合'],
      [20, 50, '【二连击】、登场:横排每有一个敌军，自身+7/+7、【磐龙】1回合'],
      [22, 55, '【二连击】、登场:横排每有一个敌军，自身+8/+8、【磐龙】1回合'],
      [26, 60, '【二连击】、登场:横排每有一个敌军，自身+8/+8、【磐龙】1回合'],
      [30, 65, '【二连击】、登场:横排每有一个敌军，自身+9/+9、【磐龙】1回合'],
      [33, 70, '【二连击】、登场:横排每有一个敌军，自身+9/+9、【磐龙】1回合'],
      [35, 75, '【二连击】、登场:横排每有一个敌军，自身+10/+10、【磐龙】1回合']
    ]
  },
  {
    name: '味仙居掌厨',
    quality: '紫',
    cost: 7,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/weixianjuzhangchu.jpg', import.meta.url),
    data: [
      [7, 39, '回合开始:英雄生命+30、登场回合结束:英雄生命加倍'],
      [8, 40, '回合开始:英雄生命+35、登场回合结束:英雄生命加倍'],
      [9, 42, '回合开始:英雄生命+40、登场回合结束:英雄生命加倍'],
      [10, 45, '回合开始:英雄生命+50、登场回合结束:英雄生命加倍'],
      [11, 49, '回合开始:英雄生命+55、登场回合结束:英雄生命加倍'],
      [13, 54, '回合开始:英雄生命+60、登场回合结束:英雄生命加倍'],
      [15, 60, '回合开始:英雄生命+65、登场回合结束:英雄生命加倍'],
      [18, 70, '回合开始:英雄生命+70、登场回合结束:英雄生命加倍'],
      [21, 80, '回合开始:英雄生命+75、登场回合结束:英雄生命加倍']
    ]
  },
  {
    name: '传记·月落',
    quality: '紫',
    cost: 2,
    type: 3,
    img: new URL('@/assets/zhongzu/chanyigu/zhuanji_yueluo.jpg', import.meta.url),
    data: [
      [0, 0, '目标区域敌军受到19点伤害，获得【传记·日升】'],
      [0, 0, '目标区域敌军受到21点伤害，获得【传记·日升】'],
      [0, 0, '目标区域敌军受到24点伤害，获得【传记·日升】'],
      [0, 0, '目标区域敌军受到27点伤害，获得【传记·日升】'],
      [0, 0, '目标区域敌军受到30点伤害，获得【传记·日升】'],
      [0, 0, '目标区域敌军受到33点伤害，获得【传记·日升】'],
      [0, 0, '目标区域敌军受到36点伤害，获得【传记·日升】'],
      [0, 0, '目标区域敌军受到39点伤害，获得【传记·日升】'],
      [0, 0, '目标区域敌军受到42点伤害，获得【传记·日升】']
    ]
  },
  {
    name: '传记·日升',
    quality: '紫',
    cost: 3,
    type: 3,
    img: new URL('@/assets/zhongzu/chanyigu/zhuanji_risheng.jpg', import.meta.url),
    data: [
      [0, 0, '目标友军+11/+12，获得【神佑】1回合'],
      [0, 0, '目标友军+13/+13，获得【神佑】1回合'],
      [0, 0, '目标友军+14/+15，获得【神佑】1回合'],
      [0, 0, '目标友军+16/+16，获得【神佑】1回合'],
      [0, 0, '目标友军+18/+18，获得【神佑】1回合'],
      [0, 0, '目标友军+20/+20，获得【神佑】1回合'],
      [0, 0, '目标友军+22/+22，获得【神佑】1回合'],
      [0, 0, '目标友军+24/+24，获得【神佑】1回合'],
      [0, 0, '目标友军+26/+26，获得【神佑】1回合']
    ]
  },
  {
    name: '流岚刃·琳',
    quality: '橙',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/liulanren_lin.jpg', import.meta.url),
    data: [
      [12, 17, '【神佑】、受到传承:隐形3回合，攻击次数永久加1'],
      [13, 19, '【神佑】、对英雄伤害+2、受到传承:隐形3回合，攻击次数永久加1'],
      [14, 21, '【神佑】、对英雄伤害+3、受到传承:隐形3回合，攻击次数永久加1'],
      [15, 23, '【神佑】、对英雄伤害+4、受到传承:隐形3回合，攻击次数永久加1'],
      [17, 25, '【神佑】、对英雄伤害+5、受到传承:隐形3回合，攻击次数永久加1'],
      [19, 27, '【神佑】、对英雄伤害+6、受到传承:隐形3回合，攻击次数永久加1'],
      [22, 28, '【神佑】、对英雄伤害+7、受到传承:隐形3回合，攻击次数永久加1'],
      [26, 29, '【神佑】、对英雄伤害+8、受到传承:隐形3回合，攻击次数永久加1'],
      [30, 30, '【神佑】、对英雄伤害+9、受到传承:隐形3回合，攻击次数永久加1']
    ]
  },
  {
    name: '神机玄女·轩',
    quality: '橙',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/shenjixuannv_xuan.jpg', import.meta.url),
    data: [
      [5, 11, '【洞察2】、命中:【洞察1】、洞察时:全体友军+1/+4，全体敌军-1/-1'],
      [7, 13, '【洞察2】、命中:【洞察1】、洞察时:全体友军+1/+4，全体敌军-1/-1'],
      [7, 14, '【洞察2】、命中:【洞察1】、洞察时:全体友军+1/+5，全体敌军-1/-1'],
      [7, 15, '【洞察2】、命中:【洞察2】、洞察时:全体友军+1/+5，全体敌军-2/-1'],
      [9, 18, '【洞察2】、命中:【洞察2】、洞察时:全体友军+1/+5，全体敌军-2/-1'],
      [12, 21, '【洞察2】、命中:【洞察2】、洞察时:全体友军+1/+5，全体敌军-2/-1'],
      [13, 21, '【洞察2】、命中:【洞察2】、洞察时:全体友军+1/+5，全体敌军-2/-2'],
      [15, 25, '【洞察2】、命中:【洞察2】、洞察时:全体友军+1/+5，全体敌军-2/-2'],
      [16, 26, '【洞察2】、命中:【洞察2】、洞察时:全体友军+2/+5，全体敌军-2/-2']
    ]
  },
  {
    name: '悟能禅杖',
    quality: '橙',
    cost: 4,
    type: 2,
    img: new URL('@/assets/zhongzu/chanyigu/wunengchanzhang.jpg', import.meta.url),
    data: [
      [0, 0, '目标友军+10/+10、获得【回命】、【践踏】、【传承10】'],
      [0, 0, '目标友军+11/+11、获得【回命】、【践踏】、【传承11】'],
      [0, 0, '目标友军+13/+13、获得【回命】、【践踏】、【传承13】'],
      [0, 0, '目标友军+15/+15、获得【回命】、【践踏】、【传承15】'],
      [0, 0, '目标友军+17/+17、获得【回命】、【践踏】、【传承17】'],
      [0, 0, '目标友军+19/+19、获得【回命】、【践踏】、【传承19】'],
      [0, 0, '目标友军+21/+21、获得【回命】、【践踏】、【传承21】'],
      [0, 0, '目标友军+23/+23、获得【回命】、【践踏】、【传承23】'],
      [0, 0, '目标友军+25/+25、获得【回命】、【践踏】、【传承25】']
    ]
  },
  {
    name: '雪域春光·凛',
    quality: '橙',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/xueyuchunguang_lin.jpg', import.meta.url),
    data: [
      [10, 17, '【魔防12】、【传承6】、受到传承：获得【神佑】2回合、回合开始：友方若有冰封，随机友军+x/+x，失去【守军】或【迟缓】（x为自身传承）'],
      [11, 18, '【魔防13】、【传承7】、受到传承：获得【神佑】2回合、回合开始：友方若有冰封，随机友军+x/+x，失去【守军】或【迟缓】（x为自身传承）'],
      [13, 19, '【魔防14】、【传承8】、受到传承：获得【神佑】2回合、回合开始：友方若有冰封，随机友军+x/+x，失去【守军】或【迟缓】（x为自身传承）'],
      [15, 21, '【魔防15】、【传承9】、受到传承：获得【神佑】2回合、回合开始：友方若有冰封，随机友军+x/+x，失去【守军】或【迟缓】（x为自身传承）'],
      [16, 24, '【魔防16】、【传承10】、受到传承：获得【神佑】2回合、回合开始：友方若有冰封，随机友军+x/+x，失去【守军】或【迟缓】（x为自身传承）'],
      [18, 26, '【魔防18】、【传承12】、受到传承：获得【神佑】2回合、回合开始：友方若有冰封，随机友军+x/+x，失去【守军】或【迟缓】（x为自身传承）'],
      [21, 29, '【魔防21】、【传承13】、受到传承：获得【神佑】2回合、回合开始：友方若有冰封，随机友军+x/+x，失去【守军】或【迟缓】（x为自身传承）'],
      [24, 32, '【魔防24】、【传承14】、受到传承：获得【神佑】2回合、回合开始：友方若有冰封，随机友军+x/+x，失去【守军】或【迟缓】（x为自身传承）'],
      [27, 35, '【魔防27】、【传承15】、受到传承：获得【神佑】2回合、回合开始：友方若有冰封，随机友军+x/+x，失去【守军】或【迟缓】（x为自身传承）']
    ]
  },
  {
    name: '三熊阵',
    quality: '橙',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/sanxiongzhen.jpg', import.meta.url),
    data: [
      [17, 3, '【魂音】、死亡:召唤熊大宝-lv12、召唤熊二宝-lv12、召唤熊小宝-lv12'],
      [19, 3, '【魂音】、死亡:召唤熊大宝-lv13、召唤熊二宝-lv13、召唤熊小宝-lv13'],
      [21, 3, '【魂音】、死亡:召唤熊大宝-lv14、召唤熊二宝-lv14、召唤熊小宝-lv14'],
      [25, 3, '【魂音】、死亡:召唤熊大宝-lv15、召唤熊二宝-lv15、召唤熊小宝-lv15'],
      [29, 3, '【魂音】、死亡:召唤熊大宝-lv16、召唤熊二宝-lv16、召唤熊小宝-lv16'],
      [33, 3, '【魂音】、死亡:召唤熊大宝-lv17、召唤熊二宝-lv17、召唤熊小宝-lv17'],
      [36, 3, '【魂音】、死亡:召唤熊大宝-lv18、召唤熊二宝-lv18、召唤熊小宝-lv18'],
      [40, 3, '【魂音】、死亡:召唤熊大宝-lv19、召唤熊二宝-lv19、召唤熊小宝-lv19'],
      [45, 3, '【魂音】、死亡:召唤熊大宝-lv20、召唤熊二宝-lv20、召唤熊小宝-lv20']
    ]
  },
  {
    name: '逍遥居士·铭',
    quality: '橙',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/xiaoyaojushi_ming.jpg', import.meta.url),
    data: [
      [23, 23, '受到传承:变身为23/23神龙传人-lv12'],
      [26, 26, '受到传承:变身为26/26神龙传人-lv13'],
      [29, 29, '受到传承:变身为29/29神龙传人-lv14'],
      [33, 33, '受到传承:变身为33/33神龙传人-lv15'],
      [36, 36, '受到传承:变身为36/36神龙传人-lv16'],
      [40, 40, '受到传承:变身为40/40神龙传人-lv17'],
      [45, 45, '受到传承:变身为45/45神龙传人-lv18'],
      [50, 50, '受到传承:变身为50/50神龙传人-lv19'],
      [55, 55, '受到传承:变身为55/55神龙传人-lv20']
    ]
  },
  {
    name: '长生不老树',
    quality: '橙',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/changshengbulaoshu.jpg', import.meta.url),
    data: [
      [0, 120, '【磐龙】、回合结束:获得手牌:人参果-lv12'],
      [0, 130, '【磐龙】、【魔防10】、回合结束:获得手牌:人参果-lv13'],
      [0, 150, '【磐龙】、【魔防10】、回合结束:获得手牌:人参果-lv14'],
      [0, 160, '【磐龙】、【魔防20】、回合结束:获得手牌:人参果-lv15'],
      [0, 175, '【磐龙】、【魔防20】、回合结束:获得手牌:人参果-lv16'],
      [0, 185, '【磐龙】、【魔防30】、回合结束:获得手牌:人参果-lv17'],
      [0, 200, '【磐龙】、【魔防30】、回合结束:获得手牌:人参果-lv18'],
      [0, 220, '【磐龙】、【魔防40】、回合结束:获得手牌:人参果-lv19'],
      [0, 240, '【磐龙】、【魔防50】、回合结束:获得手牌:人参果-lv20']
    ]
  },
  {
    name: '神龙传人',
    quality: '橙',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/shenlongchuanren.jpg', import.meta.url),
    data: [
      [23, 23, '【二连击】、【先攻】、【回命】、【神佑】、【传承13】'],
      [26, 26, '【二连击】、【先攻】、【回命】、【神佑】、【传承14】'],
      [29, 29, '【二连击】、【先攻】、【回命】、【神佑】、【传承15】'],
      [33, 33, '【二连击】、【先攻】、【回命】、【神佑】、【传承18】'],
      [36, 36, '【二连击】、【先攻】、【回命】、【神佑】、【传承22】'],
      [40, 40, '【二连击】、【先攻】、【回命】、【神佑】、【传承24】'],
      [45, 45, '【二连击】、【先攻】、【回命】、【神佑】、【传承25】'],
      [50, 50, '【二连击】、【先攻】、【回命】、【神佑】、【传承27】'],
      [55, 55, '【二连击】、【先攻】、【回命】、【神佑】、【传承30】']
    ]
  },
  {
    name: '豪情禅师·悟能',
    quality: '橙',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/haoqingchanshi_wuneng.jpg', import.meta.url),
    data: [
      [30, 30, '【践踏】、【回命】、【传承12】'],
      [35, 35, '【践踏】、【回命】、【传承12】'],
      [38, 38, '【践踏】、【回命】、【传承14】'],
      [42, 42, '【践踏】、【回命】、【传承15】'],
      [48, 48, '【践踏】、【回命】、【传承16】'],
      [54, 54, '【践踏】、【回命】、【传承20】'],
      [60, 60, '【践踏】、【回命】、【传承24】'],
      [67, 67, '【践踏】、【回命】、【传承25】'],
      [75, 75, '【践踏】、【回命】、【传承25】']
    ]
  },
  {
    name: '逸云剑·任大师',
    quality: '橙',
    cost: 7,
    type: 1,
    img: new URL('@/assets/zhongzu/chanyigu/yiyunjian_rendashi.jpg', import.meta.url),
    data: [
      [40, 13, '前排登场:对面敌军受到150点伤害；后排登场:7个敌军受到10点伤害'],
      [45, 15, '前排登场:对面敌军受到200点伤害；后排登场:7个敌军受到11点伤害'],
      [50, 18, '前排登场:对面敌军受到300点伤害；后排登场:7个敌军受到12点伤害'],
      [55, 22, '前排登场:对面敌军受到400点伤害；后排登场:7个敌军受到13点伤害'],
      [60, 26, '前排登场:对面敌军受到500点伤害；后排登场:7个敌军受到14点伤害'],
      [70, 28, '前排登场:对面敌军受到600点伤害；后排登场:7个敌军受到15点伤害'],
      [80, 30, '前排登场:对面敌军受到700点伤害；后排登场:7个敌军受到16点伤害'],
      [90, 32, '前排登场:对面敌军受到800点伤害；后排登场:7个敌军受到18点伤害'],
      [100, 35, '前排登场:对面敌军受到900点伤害；后排登场:7个敌军受到20点伤害']
    ]
  }
];
