export default [
  {
    name: '骸骨战士',
    quality: '白',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/haiguzhanshi.jpg', import.meta.url),
    data: [
      [12, 1, '/'],
      [14, 1, '/'],
      [16, 1, '/'],
      [18, 1, '/'],
      [20, 1, '/'],
      [22, 1, '/'],
      [24, 1, '/'],
      [26, 1, '/'],
      [28, 1, '/']
    ]
  },
  {
    name: '冻尸',
    quality: '白',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/dongshi.jpg', import.meta.url),
    data: [
      [10, 10, '死亡:冰封自身位置'],
      [11, 12, '死亡:冰封自身位置'],
      [13, 13, '死亡:冰封自身位置'],
      [14, 15, '死亡:冰封自身位置'],
      [16, 16, '死亡:冰封自身位置'],
      [17, 18, '死亡:冰封自身位置'],
      [19, 19, '死亡:冰封自身位置'],
      [21, 21, '死亡:冰封自身位置'],
      [23, 23, '死亡:冰封自身位置']
    ]
  },
  {
    name: '荒芜藤蔓',
    quality: '白',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/huangwutengwan.jpg', import.meta.url),
    data: [
      [0, 1, '【守军】、【魔免】、【隐形】'],
      [0, 1, '【守军】、【魔免】、【隐形】'],
      [0, 1, '【守军】、【魔免】、【隐形】'],
      [0, 1, '【守军】、【魔免】、【隐形】'],
      [0, 1, '【守军】、【魔免】、【隐形】'],
      [0, 1, '【守军】、【魔免】、【隐形】'],
      [0, 1, '【守军】、【魔免】、【隐形】'],
      [0, 1, '【守军】、【魔免】、【隐形】'],
      [0, 1, '【守军】、【魔免】、【隐形】']
    ]
  },
  {
    name: '骷髅射手',
    quality: '白',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/kulousheshou.jpg', import.meta.url),
    data: [
      [14, 1, '死亡:对随机敌军造成6点伤害'],
      [16, 1, '死亡:对随机敌军造成6点伤害'],
      [17, 1, '死亡:对随机敌军造成7点伤害'],
      [19, 1, '死亡:对随机敌军造成7点伤害'],
      [21, 1, '死亡:对随机敌军造成8点伤害'],
      [24, 1, '死亡:对随机敌军造成9点伤害'],
      [27, 1, '死亡:对随机敌军造成10点伤害'],
      [30, 1, '死亡:对随机敌军造成11点伤害'],
      [33, 1, '死亡:对随机敌军造成12点伤害']
    ]
  },
  {
    name: '尸嵌',
    quality: '白',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/shiqian.jpg', import.meta.url),
    data: [
      [17, 18, '死亡:冰封自身位置，英雄生命+17'],
      [19, 19, '死亡:冰封自身位置，英雄生命+19'],
      [20, 21, '死亡:冰封自身位置，英雄生命+20'],
      [22, 22, '死亡:冰封自身位置，英雄生命+22'],
      [24, 24, '死亡:冰封自身位置，英雄生命+24'],
      [26, 26, '死亡:冰封自身位置，英雄生命+26'],
      [28, 28, '死亡:冰封自身位置，英雄生命+28'],
      [30, 30, '死亡:冰封自身位置，英雄生命+30'],
      [32, 32, '死亡:冰封自身位置，英雄生命+32']
    ]
  },
  {
    name: '复生邪骨',
    quality: '白',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/fushengxiegu.jpg', import.meta.url),
    data: [
      [18, 3, '死亡:召唤一个12/1骸骨战士-lv12'],
      [20, 3, '死亡:召唤一个14/1骸骨战士-lv13'],
      [22, 3, '死亡:召唤一个16/1骸骨战士-lv14'],
      [24, 4, '死亡:召唤一个18/1骸骨战士-lv15'],
      [26, 5, '死亡:召唤一个20/1骸骨战士-lv16'],
      [29, 6, '死亡:召唤一个22/1骸骨战士-lv17'],
      [32, 7, '死亡:召唤一个24/1骸骨战士-lv18'],
      [35, 8, '死亡:召唤一个26/1骸骨战士-lv19'],
      [39, 9, '死亡:召唤一个28/1骸骨战士-lv20']
    ]
  },
  {
    name: '骷髅犬',
    quality: '蓝',
    cost: 1,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/kulouquan.jpg', import.meta.url),
    data: [
      [10, 1, '死亡:随机友军攻击+7'],
      [11, 1, '死亡:随机友军攻击+8'],
      [12, 1, '死亡:随机友军攻击+9'],
      [13, 1, '死亡:随机友军攻击+10'],
      [15, 1, '死亡:随机友军攻击+10'],
      [17, 1, '死亡:随机友军攻击+11'],
      [19, 1, '死亡:随机友军攻击+12'],
      [21, 1, '死亡:随机友军攻击+13'],
      [23, 1, '死亡:随机友军攻击+14']
    ]
  },
  {
    name: '冰原匍尸',
    quality: '蓝',
    cost: 1,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/bingyuanpushi.jpg', import.meta.url),
    data: [
      [9, 3, '【迟缓】、脚下冰封则失去迟缓、死亡:75%移回玩家手上'],
      [10, 3, '【迟缓】、脚下冰封则失去迟缓、死亡:80%移回玩家手上'],
      [11, 3, '【迟缓】、脚下冰封则失去迟缓、死亡:85%移回玩家手上'],
      [11, 3, '【迟缓】、脚下冰封则失去迟缓、死亡:移回玩家手上'],
      [12, 4, '【迟缓】、脚下冰封则失去迟缓、死亡:移回玩家手上'],
      [13, 4, '【迟缓】、脚下冰封则失去迟缓、死亡:移回玩家手上'],
      [14, 4, '【迟缓】、脚下冰封则失去迟缓、死亡:移回玩家手上'],
      [15, 5, '【迟缓】、脚下冰封则失去迟缓、死亡:移回玩家手上'],
      [16, 6, '【迟缓】、脚下冰封则失去迟缓、死亡:移回玩家手上']
    ]
  },
  {
    name: '战场遗迹',
    quality: '蓝',
    cost: 1,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/zhanchangyiji.jpg', import.meta.url),
    data: [
      [0, 1, '死亡:抽一张牌、随机友军+8/+8'],
      [0, 1, '死亡:抽一张牌、随机友军+9/+9'],
      [0, 1, '死亡:抽一张牌、随机友军+10/+10'],
      [0, 1, '死亡:抽一张牌、随机友军+11/+11'],
      [0, 1, '死亡:抽一张牌、随机友军+12/+13'],
      [0, 1, '死亡:抽一张牌、随机友军+14/+14'],
      [0, 1, '死亡:抽一张牌、随机友军+15/+16'],
      [0, 1, '死亡:抽一张牌、随机友军+17/+17'],
      [0, 1, '死亡:抽一张牌、随机友军+19/+19']
    ]
  },
  {
    name: '转化仪式',
    quality: '蓝',
    cost: 1,
    type: 2,
    img: new URL('@/assets/zhongzu/dongshenshitu/zhuanhuayishi.jpg', import.meta.url),
    data: [
      [0, 0, '牺牲目标友军，抽一张牌、召唤17/18尸嵌lv12'],
      [0, 0, '牺牲目标友军，抽一张牌、召唤19/19尸嵌lv13'],
      [0, 0, '牺牲目标友军，抽一张牌、召唤20/21尸嵌lv14'],
      [0, 0, '牺牲目标友军，抽一张牌、召唤22/22尸嵌lv15'],
      [0, 0, '牺牲目标友军，抽一张牌、召唤24/24尸嵌lv16'],
      [0, 0, '牺牲目标友军，抽一张牌、召唤26/26尸嵌lv17'],
      [0, 0, '牺牲目标友军，抽一张牌、召唤28/28尸嵌lv18'],
      [0, 0, '牺牲目标友军，抽一张牌、召唤30/30尸嵌lv19'],
      [0, 0, '牺牲目标友军，抽一张牌、召唤32/32尸嵌lv20']
    ]
  },
  {
    name: '复生尸骸',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/fushengshihai.jpg', import.meta.url),
    data: [
      [8, 8, '死亡:召唤一个12/1骸骨战士-lv12'],
      [9, 9, '死亡:召唤一个13/1骸骨战士-lv13'],
      [10, 10, '死亡:召唤一个14/1骸骨战士-lv14'],
      [11, 11, '死亡:召唤一个15/1骸骨战士-lv15'],
      [12, 12, '死亡:召唤一个16/1骸骨战士-lv16'],
      [13, 14, '死亡:召唤一个22/1骸骨战士-lv17'],
      [15, 15, '死亡:召唤一个24/1骸骨战士-lv18'],
      [17, 17, '死亡:召唤一个26/1骸骨战士-lv19'],
      [19, 19, '死亡:召唤一个28/1骸骨战士-lv20']
    ]
  },
  {
    name: '冬神狂信者',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/dongshenkuangxinzhe.jpg', import.meta.url),
    data: [
      [13, 10, '每当一个生物死亡:自身攻击+1'],
      [14, 12, '每当一个生物死亡:自身攻击+1'],
      [16, 13, '每当一个生物死亡:自身攻击+1'],
      [18, 14, '每当一个生物死亡:自身攻击+1'],
      [20, 15, '每当一个生物死亡:自身攻击+1'],
      [21, 16, '每当一个生物死亡:自身攻击+2'],
      [24, 17, '每当一个生物死亡:自身攻击+2'],
      [27, 19, '每当一个生物死亡:自身攻击+2'],
      [30, 21, '每当一个生物死亡:自身攻击+2']
    ]
  },
  {
    name: '噬魂骨妖',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/shihunguyao.jpg', import.meta.url),
    data: [
      [12, 16, '每当一个敌军死亡:自身+2/+3'],
      [13, 19, '每当一个敌军死亡:自身+2/+3'],
      [14, 21, '每当一个敌军死亡:自身+3/+3'],
      [16, 22, '每当一个敌军死亡:自身+3/+3'],
      [17, 24, '每当一个敌军死亡:自身+4/+3'],
      [19, 27, '每当一个敌军死亡:自身+4/+3'],
      [22, 28, '每当一个敌军死亡:自身+4/+4'],
      [24, 32, '每当一个敌军死亡:自身+4/+4'],
      [26, 35, '每当一个敌军死亡:自身+4/+5']
    ]
  },
  {
    name: '寒铁军士',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/hantiejunshi.jpg', import.meta.url),
    data: [
      [16, 4, '登场:冰封相邻随机位置'],
      [17, 5, '【洞察1】、登场:冰封相邻随机位置'],
      [19, 5, '【洞察1】、登场:冰封相邻随机位置'],
      [21, 6, '【洞察1】、登场:冰封相邻随机位置'],
      [23, 7, '【洞察1】、登场:冰封相邻随机位置'],
      [25, 8, '【洞察1】、登场:冰封相邻随机位置'],
      [28, 8, '【洞察1】、登场:冰封相邻随机位置'],
      [31, 8, '【洞察1】、登场:冰封相邻随机位置'],
      [34, 9, '【洞察1】、登场:冰封相邻随机位置']
    ]
  },
  {
    name: '瘟疫冰虫',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/wenyibingchong.jpg', import.meta.url),
    data: [
      [7, 14, '对玩家伤害+13、登场:冰封随机友方位置，英雄生命-5'],
      [8, 16, '对玩家伤害+14、登场:冰封随机友方位置，英雄生命-6'],
      [9, 18, '对玩家伤害+15、登场:冰封随机友方位置，英雄生命-6'],
      [10, 20, '对玩家伤害+16、登场:冰封随机友方位置，英雄生命-6'],
      [12, 20, '对玩家伤害+18、登场:冰封随机友方位置，英雄生命-7'],
      [13, 23, '对玩家伤害+19、登场:冰封随机友方位置，英雄生命-7'],
      [15, 25, '对玩家伤害+20、登场:冰封随机友方位置，英雄生命-8'],
      [17, 29, '对玩家伤害+22、登场:冰封随机友方位置，英雄生命-8'],
      [19, 30, '对玩家伤害+24、登场:冰封随机友方位置，英雄生命-9']
    ]
  },
  {
    name: '寒冰魔墙',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/hanbingmoqiang.jpg', import.meta.url),
    data: [
      [0, 33, '登场:冰封对面横排随机位置、死亡:冰封自身位置，若已冰封则抓一张牌'],
      [0, 38, '登场:冰封对面横排随机位置、死亡:冰封自身位置，若已冰封则抓一张牌'],
      [0, 45, '登场:冰封对面横排随机位置、死亡:冰封自身位置，若已冰封则抓一张牌'],
      [0, 50, '登场:冰封对面横排随机位置、死亡:冰封自身位置，若已冰封则抓一张牌'],
      [0, 55, '登场:冰封对面横排随机位置、死亡:冰封自身位置，若已冰封则抓一张牌'],
      [0, 60, '登场:冰封对面横排随机位置、死亡:冰封自身位置，若已冰封则抓一张牌'],
      [0, 66, '登场:冰封对面横排随机位置、死亡:冰封自身位置，若已冰封则抓一张牌'],
      [0, 73, '登场:冰封对面横排随机位置、死亡:冰封自身位置，若已冰封则抓一张牌'],
      [0, 80, '登场:冰封对面横排随机位置、死亡:冰封自身位置，若已冰封则抓一张牌']
    ]
  },
  {
    name: '寒冬将至',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: new URL('@/assets/zhongzu/dongshenshitu/handongjiangzhi.jpg', import.meta.url),
    data: [
      [0, 0, '冰封目标区域、抓一张牌、英雄生命+18、65%获得《真理碎片》'],
      [0, 0, '冰封目标区域、抓一张牌、英雄生命+21、70%获得《真理碎片》'],
      [0, 0, '冰封目标区域、抓一张牌、英雄生命+25、75%获得《真理碎片》'],
      [0, 0, '冰封目标区域、抓一张牌、英雄生命+30、80%获得《真理碎片》'],
      [0, 0, '冰封目标区域、抓一张牌、英雄生命+35、获得《真理碎片》'],
      [0, 0, '冰封目标区域、抓一张牌、英雄生命+40、获得《真理碎片》'],
      [0, 0, '冰封目标区域、抓一张牌、英雄生命+45、获得《真理碎片》'],
      [0, 0, '冰封目标区域、抓一张牌、英雄生命+50、获得《真理碎片》'],
      [0, 0, '冰封目标区域、抓一张牌、英雄生命+55、获得《真理碎片》']
    ]
  },
  {
    name: '骨墙',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/guqiang.jpg', import.meta.url),
    data: [
      [3, 26, '【守军】、【荆棘】、每当一个友军死亡:自身+2/+10'],
      [4, 27, '【守军】、【荆棘】、每当一个友军死亡:自身+2/+11'],
      [4, 29, '【守军】、【荆棘】、每当一个友军死亡:自身+3/+11'],
      [5, 30, '【守军】、【荆棘】、每当一个友军死亡:自身+3/+13'],
      [6, 33, '【守军】、【荆棘】、每当一个友军死亡:自身+3/+13'],
      [7, 35, '【守军】、【荆棘】、每当一个友军死亡:自身+3/+14'],
      [8, 38, '【守军】、【荆棘】、每当一个友军死亡:自身+3/+15'],
      [9, 43, '【守军】、【荆棘】、每当一个友军死亡:自身+3/+16'],
      [10, 49, '【守军】、【荆棘】、每当一个友军死亡:自身+3/+17']
    ]
  },
  {
    name: '阴冷墓穴',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/yinlengmuxue.jpg', import.meta.url),
    data: [
      [0, 25, '死亡:召唤17/18尸嵌-lv12'],
      [0, 28, '死亡:召唤19/19尸嵌-lv13'],
      [0, 32, '死亡:召唤20/21尸嵌-lv14'],
      [0, 36, '死亡:召唤22/22尸嵌-lv15'],
      [0, 40, '死亡:召唤24/24尸嵌-lv16'],
      [0, 45, '死亡:召唤26/26尸嵌-lv17'],
      [0, 50, '死亡:召唤28/28尸嵌-lv18'],
      [0, 58, '死亡:召唤30/30尸嵌-lv19'],
      [0, 65, '死亡:召唤32/32尸嵌-lv20']
    ]
  },
  {
    name: '寒风草人',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/hanfengcaoren.jpg', import.meta.url),
    data: [
      [0, 14, '【洞察1】、【传承4】、登场：冰封相邻随机位置，横排敌军-4/-4'],
      [0, 16, '【洞察1】、【传承5】、登场：冰封相邻随机位置，横排敌军-4/-4'],
      [0, 17, '【洞察1】、【传承5】、登场：冰封相邻随机位置，横排敌军-5/-5'],
      [0, 18, '【洞察1】、【传承6】、登场：冰封相邻随机位置，横排敌军-6/-6'],
      [0, 20, '【洞察1】、【传承6】、登场：冰封相邻随机位置，横排敌军-7/-7'],
      [0, 22, '【洞察1】、【传承7】、登场：冰封相邻随机位置，横排敌军-7/-7'],
      [0, 25, '【洞察1】、【传承7】、登场：冰封相邻随机位置，横排敌军-8/-8'],
      [0, 27, '【洞察1】、【传承7】、登场：冰封相邻随机位置，横排敌军-9/-9'],
      [0, 30, '【洞察1】、【传承7】、登场：冰封相邻随机位置，横排敌军-10/-10']
    ]
  },
  {
    name: '召唤阵·骷髅犬',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: new URL('@/assets/zhongzu/dongshenshitu/zhaohuanzhen_kulouquan.jpg', import.meta.url),
    data: [
      [0, 0, '目标位置召唤10/1骷髅犬lv12，并获得一只到手上'],
      [0, 0, '目标位置召唤11/1骷髅犬lv13，并获得一只到手上'],
      [0, 0, '目标位置召唤12/1骷髅犬lv14，并获得一只到手上'],
      [0, 0, '目标位置召唤13/1骷髅犬lv15，并获得一只到手上'],
      [0, 0, '目标位置召唤15/1骷髅犬lv16，并获得一只到手上'],
      [0, 0, '目标位置召唤17/1骷髅犬lv17，并获得一只到手上'],
      [0, 0, '目标位置召唤19/1骷髅犬lv18，并获得一只到手上'],
      [0, 0, '目标位置召唤21/1骷髅犬lv19，并获得一只到手上'],
      [0, 0, '目标位置召唤23/1骷髅犬lv20，并获得一只到手上']
    ]
  },
  {
    name: '严冬苦行僧',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/yandongkuxingseng.jpg', import.meta.url),
    data: [
      [9, 18, '【洞察1】、登场:随机敌军攻击-2x/-2x(x为敌方冰封数量)、敌方法力上限-1'],
      [10, 20, '【洞察1】、登场:随机敌军攻击-2x/-2x(x为敌方冰封数量)、敌方法力上限-1'],
      [11, 22, '【洞察1】、登场:随机敌军攻击-2x/-2x(x为敌方冰封数量)、敌方法力上限-1'],
      [12, 25, '【洞察1】、登场:随机敌军攻击-2x/-2x(x为敌方冰封数量)、敌方法力上限-1'],
      [13, 28, '【洞察1】、登场:随机敌军攻击-2x/-2x(x为敌方冰封数量)、敌方法力上限-1'],
      [15, 30, '【洞察1】、登场:随机敌军攻击-2x/-2x(x为敌方冰封数量)、敌方法力上限-1'],
      [17, 33, '【洞察1】、登场:随机敌军攻击-2x/-2x(x为敌方冰封数量)、敌方法力上限-1'],
      [19, 35, '【洞察1】、登场:随机敌军攻击-3x/-3x(x为敌方冰封数量)、敌方法力上限-1'],
      [21, 39, '【洞察1】、登场:随机敌军攻击-3x/-3x(x为敌方冰封数量)、敌方法力上限-1']
    ]
  },
  {
    name: '寒冰祭师',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/hanbingjishi.jpg', import.meta.url),
    data: [
      [8, 14, '攻击前:随机敌军-3/-2，冰封其位置'],
      [9, 15, '攻击前:随机敌军-3/-2，冰封其位置'],
      [10, 18, '攻击前:随机敌军-3/-3，冰封其位置'],
      [12, 21, '攻击前:随机敌军-3/-3，冰封其位置'],
      [13, 23, '攻击前:随机敌军-3/-3，冰封其位置'],
      [15, 26, '攻击前:随机敌军-4/-4，冰封其位置'],
      [17, 28, '攻击前:随机敌军-4/-4，冰封其位置'],
      [19, 32, '攻击前:随机敌军-5/-5，冰封其位置'],
      [21, 35, '攻击前:随机敌军-6/-6，冰封其位置']
    ]
  },
  {
    name: '极地狂信者',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/jidikuangxinzhe.jpg', import.meta.url),
    data: [
      [15, 12, '登场:牺牲一个相邻友军，随机敌军-60/-60'],
      [16, 14, '登场:牺牲一个相邻友军，随机敌军-70/-70'],
      [18, 15, '登场:牺牲一个相邻友军，随机敌军-80/-80'],
      [20, 16, '登场:牺牲一个相邻友军，随机敌军-90/-90'],
      [23, 18, '登场:牺牲一个相邻友军，随机敌军-100/-100'],
      [26, 20, '登场:牺牲一个相邻友军，随机敌军-110/-110'],
      [29, 22, '登场:牺牲一个相邻友军，随机敌军-120/-120'],
      [32, 24, '登场:牺牲一个相邻友军，随机敌军-130/-130'],
      [35, 26, '登场:牺牲一个相邻友军，随机敌军-140/-140']
    ]
  },
  {
    name: '神庙祭师',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/shenmiaojishi.jpg', import.meta.url),
    data: [
      [8, 14, '【洞察1】、攻击前:吸取生命，等同自身攻击'],
      [9, 16, '【洞察1】、攻击前:吸取生命，等同自身攻击'],
      [10, 18, '【洞察1】、攻击前:吸取生命，等同自身攻击'],
      [11, 20, '【洞察1】、攻击前:吸取生命，等同自身攻击'],
      [13, 21, '【洞察1】、攻击前:吸取生命，等同自身攻击'],
      [15, 22, '【洞察1】、攻击前:吸取生命，等同自身攻击'],
      [17, 23, '【洞察1】、攻击前:吸取生命，等同自身攻击'],
      [19, 26, '【洞察1】、攻击前:吸取生命，等同自身攻击'],
      [20, 30, '【洞察1】、攻击前:吸取生命，等同自身攻击']
    ]
  },
  {
    name: '使徒征召',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/dongshenshitu/shituzhengzhao.jpg', import.meta.url),
    data: [
      [0, 0, '冰封友方目标区域，召唤两个10/10冻尸-lv12'],
      [0, 0, '冰封友方目标区域，召唤两个11/12冻尸-lv13'],
      [0, 0, '冰封友方目标区域，召唤两个13/13冻尸-lv14'],
      [0, 0, '冰封友方目标区域，召唤两个14/15冻尸-lv15'],
      [0, 0, '冰封友方目标区域，召唤两个16/16冻尸-lv16'],
      [0, 0, '冰封友方目标区域，召唤两个17/18冻尸-lv17'],
      [0, 0, '冰封友方目标区域，召唤两个19/19冻尸-lv18'],
      [0, 0, '冰封友方目标区域，召唤两个21/21冻尸-lv19'],
      [0, 0, '冰封友方目标区域，召唤两个23/23冻尸-lv20']
    ]
  },
  {
    name: '灵魂抽取',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/dongshenshitu/linghunchouqu.jpg', import.meta.url),
    data: [
      [0, 0, '目标敌军-35/-35，全场每有一处冰封，你的生命便+3'],
      [0, 0, '目标敌军-40/-40，全场每有一处冰封，你的生命便+3'],
      [0, 0, '目标敌军-45/-45，全场每有一处冰封，你的生命便+4'],
      [0, 0, '目标敌军-50/-50，全场每有一处冰封，你的生命便+5'],
      [0, 0, '目标敌军-60/-60，全场每有一处冰封，你的生命便+5'],
      [0, 0, '目标敌军-65/-65，全场每有一处冰封，你的生命便+6'],
      [0, 0, '目标敌军-73/-73，全场每有一处冰封，你的生命便+6'],
      [0, 0, '目标敌军-80/-80，全场每有一处冰封，你的生命便+7'],
      [0, 0, '目标敌军-90/-90，全场每有一处冰封，你的生命便+7']
    ]
  },
  {
    name: '神庙魔像',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/shenmiaomoxiang.jpg', import.meta.url),
    data: [
      [25, 40, '【守军】、登场：冰封友方随机位置、受到传承：失去【守军】'],
      [27, 45, '【守军】、登场：冰封友方随机位置、受到传承：失去【守军】'],
      [29, 50, '【守军】、登场：冰封友方随机位置、受到传承：失去【守军】'],
      [33, 55, '【守军】、登场：冰封友方随机位置、受到传承：失去【守军】'],
      [36, 60, '【守军】、登场：冰封友方随机位置、受到传承：失去【守军】'],
      [39, 65, '【守军】、登场：冰封友方随机位置、受到传承：失去【守军】'],
      [42, 70, '【守军】、登场：冰封友方随机位置、受到传承：失去【守军】'],
      [46, 77, '【守军】、登场：冰封友方随机位置、受到传承：失去【守军】'],
      [50, 85, '【守军】、登场：冰封友方随机位置、受到传承：失去【守军】']
    ]
  },
  {
    name: '盾甲骷髅妖',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/dunjiakulouyao.jpg', import.meta.url),
    data: [
      [10, 10, '【护甲3】、死亡:随机友军+10/+10，并且护甲+3'],
      [11, 11, '【护甲3】、死亡:随机友军+11/+11，并且护甲+3'],
      [12, 12, '【护甲3】、死亡:随机友军+12/+12，并且护甲+3'],
      [13, 13, '【护甲3】、死亡:随机友军+13/+13，并且护甲+3'],
      [14, 14, '【护甲4】、死亡:随机友军+14/+14，并且护甲+4'],
      [15, 15, '【护甲4】、死亡:随机友军+15/+15，并且护甲+4'],
      [16, 16, '【护甲4】、死亡:随机友军+16/+16，并且护甲+4'],
      [17, 17, '【护甲5】、死亡:随机友军+17/+17，并且护甲+5'],
      [19, 19, '【护甲5】、死亡:随机友军+19/+19，并且护甲+5']
    ]
  },
  {
    name: '绝望之地',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/dongshenshitu/juewangzhidi.jpg', import.meta.url),
    data: [
      [0, 0, '荒芜一个敌方区域，随机敌军攻击-17并获得沉默'],
      [0, 0, '荒芜一个敌方区域，随机敌军攻击-19并获得沉默'],
      [0, 0, '荒芜一个敌方区域，随机敌军攻击-22并获得沉默'],
      [0, 0, '荒芜一个敌方区域，随机敌军攻击-25并获得沉默'],
      [0, 0, '荒芜一个敌方区域，随机敌军攻击-28并获得沉默'],
      [0, 0, '荒芜一个敌方区域，随机敌军攻击-31并获得沉默'],
      [0, 0, '荒芜一个敌方区域，随机敌军攻击-35并获得沉默'],
      [0, 0, '荒芜一个敌方区域，随机敌军攻击-40并获得沉默'],
      [0, 0, '荒芜一个敌方区域，随机敌军攻击-45并获得沉默']
    ]
  },
  {
    name: '无声变异',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/dongshenshitu/wushengbianyi.jpg', import.meta.url),
    data: [
      [0, 0, '目标友军+14/+15并受到沉默、抽一张牌'],
      [0, 0, '目标友军+16/+16并受到沉默、抽一张牌'],
      [0, 0, '目标友军+18/+18并受到沉默、抽一张牌'],
      [0, 0, '目标友军+20/+20并受到沉默、抽一张牌'],
      [0, 0, '目标友军+23/+23并受到沉默、抽一张牌'],
      [0, 0, '目标友军+26/+26并受到沉默、抽一张牌'],
      [0, 0, '目标友军+29/+29并受到沉默、抽一张牌'],
      [0, 0, '目标友军+32/+32并受到沉默、抽一张牌'],
      [0, 0, '目标友军+36/+36并受到沉默、抽一张牌']
    ]
  },
  {
    name: '死寒猎手',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/sihanlieshou.jpg', import.meta.url),
    data: [
      [6, 29, '登场:冰封随机敌军位置，该敌军攻击-5，本回合不能攻击'],
      [7, 32, '登场:冰封随机敌军位置，该敌军攻击-6，本回合不能攻击'],
      [8, 35, '登场:冰封随机敌军位置，该敌军攻击-7，本回合不能攻击'],
      [9, 39, '登场:冰封随机敌军位置，该敌军攻击-8，本回合不能攻击'],
      [10, 44, '登场:冰封随机敌军位置，该敌军攻击-9，本回合不能攻击'],
      [11, 49, '登场:冰封随机敌军位置，该敌军攻击-10，本回合不能攻击'],
      [12, 54, '登场:冰封随机敌军位置，该敌军攻击-11，本回合不能攻击'],
      [13, 60, '登场:冰封随机敌军位置，该敌军攻击-12，本回合不能攻击'],
      [15, 65, '登场:冰封随机敌军位置，该敌军攻击-13，本回合不能攻击']
    ]
  },
  {
    name: '骸骨前线',
    quality: '蓝',
    cost: 4,
    type: 2,
    img: new URL('@/assets/zhongzu/dongshenshitu/haiguqianxian.jpg', import.meta.url),
    data: [
      [0, 0, '召唤两个12/1骸骨战士-lv12、随机友军攻击+3、获得《真理碎片'],
      [0, 0, '召唤两个13/1骸骨战士-lv13、随机友军攻击+3、获得《真理碎片'],
      [0, 0, '召唤两个14/1骸骨战士-lv14、随机友军攻击+4、获得《真理碎片'],
      [0, 0, '召唤两个15/1骸骨战士-lv15、随机友军攻击+5、获得《真理碎片'],
      [0, 0, '召唤两个16/1骸骨战士-lv16、随机友军攻击+6、获得《真理碎片'],
      [0, 0, '召唤两个22/1骸骨战士-lv17、随机友军攻击+7、获得《真理碎片'],
      [0, 0, '召唤两个24/1骸骨战士-lv18、随机友军攻击+8、获得《真理碎片'],
      [0, 0, '召唤两个26/1骸骨战士-lv19、随机友军攻击+9、获得《真理碎片'],
      [0, 0, '召唤两个28/1骸骨战士-lv20、随机友军攻击+10、获得《真理碎片']
    ]
  },
  {
    name: '蛮骨法师',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/mangufashi.jpg', import.meta.url),
    data: [
      [12, 16, '登场、英雄获得生命时：随机敌军-4/-4'],
      [14, 18, '登场、英雄获得生命时：随机敌军-4/-4'],
      [15, 18, '登场、英雄获得生命时：随机敌军-5/-5'],
      [16, 21, '登场、英雄获得生命时：随机敌军-5/-5'],
      [18, 21, '登场、英雄获得生命时：随机敌军-6/-6'],
      [19, 23, '登场、英雄获得生命时：随机敌军-7/-7'],
      [20, 25, '登场、英雄获得生命时：随机敌军-8/-8'],
      [22, 27, '登场、英雄获得生命时：随机敌军-9/-9'],
      [24, 30, '登场、英雄获得生命时：随机敌军-10/-10']
    ]
  },
  {
    name: '冰原咆哮者',
    quality: '蓝',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/bingyuanpaoxiaozhe.jpg', import.meta.url),
    data: [
      [17, 17, '登场:友方每有一处冰封，自身+3/+3'],
      [20, 20, '登场:友方每有一处冰封，自身+3/+3'],
      [21, 21, '登场:友方每有一处冰封，自身+4/+4'],
      [25, 25, '登场:友方每有一处冰封，自身+4/+4'],
      [29, 29, '登场:友方每有一处冰封，自身+4/+4'],
      [32, 32, '登场:友方每有一处冰封，自身+5/+5'],
      [36, 36, '登场:友方每有一处冰封，自身+5/+5'],
      [39, 39, '登场:友方每有一处冰封，自身+6/+6'],
      [45, 45, '登场:友方每有一处冰封，自身+6/+6']
    ]
  },
  {
    name: '不眠雪鸦',
    quality: '蓝',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/bumianxueya.jpg', import.meta.url),
    data: [
      [12, 8, '登场:敌方每有一处冰封，自身攻击+5，若自身位置已冰封，则获得【穿透】'],
      [15, 9, '登场:敌方每有一处冰封，自身攻击+5，若自身位置已冰封，则获得【穿透】'],
      [16, 9, '登场:敌方每有一处冰封，自身攻击+6，若自身位置已冰封，则获得【穿透】'],
      [20, 10, '登场:敌方每有一处冰封，自身攻击+6，若自身位置已冰封，则获得【穿透】'],
      [24, 11, '登场:敌方每有一处冰封，自身攻击+6，若自身位置已冰封，则获得【穿透】'],
      [26, 13, '登场:敌方每有一处冰封，自身攻击+7，若自身位置已冰封，则获得【穿透】'],
      [30, 15, '登场:敌方每有一处冰封，自身攻击+7，若自身位置已冰封，则获得【穿透】'],
      [33, 16, '登场:敌方每有一处冰封，自身攻击+7，若自身位置已冰封，则获得【穿透】'],
      [39, 17, '登场:敌方每有一处冰封，自身攻击+8，若自身位置已冰封，则获得【穿透】']
    ]
  },
  {
    name: '传记·雪域猎踪',
    quality: '蓝',
    cost: 2,
    type: 3,
    img: new URL('@/assets/zhongzu/dongshenshitu/zhuanji_xueyuliesong.jpg', import.meta.url),
    data: [
      [0, 0, '冰封随机区域，随机敌军-8/-8，获得【传记·猛兽哮谷】'],
      [0, 0, '冰封随机区域，随机敌军-9/-9，获得【传记·猛兽哮谷】'],
      [0, 0, '冰封随机区域，随机敌军-10/-10，获得【传记·猛兽哮谷】'],
      [0, 0, '冰封随机区域，随机敌军-11/-11，获得【传记·猛兽哮谷】'],
      [0, 0, '冰封随机区域，随机敌军-12/-12，获得【传记·猛兽哮谷】'],
      [0, 0, '冰封随机区域，随机敌军-13/-13，获得【传记·猛兽哮谷】'],
      [0, 0, '冰封随机区域，随机敌军-14/-14，获得【传记·猛兽哮谷】'],
      [0, 0, '冰封随机区域，随机敌军-16/-16，获得【传记·猛兽哮谷】'],
      [0, 0, '冰封随机区域，随机敌军-18/-18，获得【传记·猛兽哮谷】']
    ]
  },
  {
    name: '传记·猛兽哮谷',
    quality: '蓝',
    cost: 5,
    type: 3,
    img: new URL('@/assets/zhongzu/dongshenshitu/zhuanji_mengshouxiaogu.jpg', import.meta.url),
    data: [
      [0, 0, '召唤冰原咆哮者-lv12'],
      [0, 0, '召唤冰原咆哮者-lv13'],
      [0, 0, '召唤冰原咆哮者-lv14'],
      [0, 0, '召唤冰原咆哮者-lv15'],
      [0, 0, '召唤冰原咆哮者-lv16'],
      [0, 0, '召唤冰原咆哮者-lv17'],
      [0, 0, '召唤冰原咆哮者-lv18'],
      [0, 0, '召唤冰原咆哮者-lv19'],
      [0, 0, '召唤冰原咆哮者-lv20']
    ]
  },
  {
    name: '凛冬邪咒师',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/lindongxiezhoushi.jpg', import.meta.url),
    data: [
      [8, 15, '登场:随机敌军攻击-5、回合开始:随机位置冰封'],
      [9, 17, '登场:随机敌军攻击-6、回合开始:随机位置冰封'],
      [10, 20, '登场:随机敌军攻击-7、回合开始:随机位置冰封'],
      [12, 21, '登场:随机敌军攻击-8、回合开始:随机位置冰封'],
      [14, 23, '登场:随机敌军攻击-9、回合开始:随机位置冰封'],
      [16, 25, '登场:随机敌军攻击-10、回合开始:随机位置冰封'],
      [18, 28, '登场:随机敌军攻击-11、回合开始:随机位置冰封'],
      [20, 31, '登场:随机敌军攻击-13、回合开始:随机位置冰封'],
      [22, 34, '登场:随机敌军攻击-15、回合开始:随机位置冰封']
    ]
  },
  {
    name: '冬夜使者',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/dongyeshizhe.jpg', import.meta.url),
    data: [
      [13, 14, '【洞察2】、双方英雄法力上限-1'],
      [15, 15, '【洞察2】、双方英雄法力上限-1'],
      [17, 17, '【洞察2】、双方英雄法力上限-1'],
      [19, 19, '【洞察2】、双方英雄法力上限-1'],
      [21, 21, '【洞察2】、双方英雄法力上限-1'],
      [23, 24, '【洞察2】、双方英雄法力上限-1'],
      [26, 26, '【洞察2】、双方英雄法力上限-1'],
      [29, 29, '【洞察2】、双方英雄法力上限-1'],
      [33, 33, '【洞察2】、双方英雄法力上限-1']
    ]
  },
  {
    name: '墓园缝合师',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/muyuanfengheshi.jpg', import.meta.url),
    data: [
      [4, 14, '回合开始：随机敌军-2/-1、回合结束：若本回合有2个单位死亡，召唤17/18尸嵌-lv12'],
      [5, 15, '回合开始：随机敌军-2/-1、回合结束：若本回合有2个单位死亡，召唤19/19尸嵌-lv13'],
      [5, 17, '回合开始：随机敌军-2/-2、回合结束：若本回合有2个单位死亡，召唤20/21尸嵌-lv14'],
      [6, 19, '回合开始：随机敌军-2/-2、回合结束：若本回合有2个单位死亡，召唤22/22尸嵌-lv15'],
      [7, 21, '回合开始：随机敌军-2/-2、回合结束：若本回合有2个单位死亡，召唤24/24尸嵌-lv16'],
      [8, 23, '回合开始：随机敌军-3/-2、回合结束：若本回合有2个单位死亡，召唤26/26尸嵌-lv17'],
      [9, 26, '回合开始：随机敌军-3/-2、回合结束：若本回合有2个单位死亡，召唤28/28尸嵌-lv18'],
      [11, 29, '回合开始：随机敌军-3/-3、回合结束：若本回合有2个单位死亡，召唤30/30尸嵌-lv19'],
      [13, 33, '回合开始：随机敌军-3/-3、回合结束：若本回合有2个单位死亡，召唤32/32尸嵌-lv20']
    ]
  },
  {
    name: '残破神庙',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/canposhenmiao.jpg', import.meta.url),
    data: [
      [0, 40, '【守军】、回合结束:若本回合有2个单位死亡，升级为0/40极地神庙-lv12'],
      [0, 45, '【守军】、回合结束:若本回合有2个单位死亡，升级为0/45极地神庙-lv13'],
      [0, 50, '【守军】、回合结束:若本回合有2个单位死亡，升级为0/50极地神庙-lv14'],
      [0, 55, '【守军】、回合结束:若本回合有2个单位死亡，升级为0/55极地神庙-lv15'],
      [0, 60, '【守军】、回合结束:若本回合有2个单位死亡，升级为0/60极地神庙-lv16'],
      [0, 65, '【守军】、回合结束:若本回合有2个单位死亡，升级为0/65极地神庙-lv17'],
      [0, 70, '【守军】、回合结束:若本回合有2个单位死亡，升级为0/70极地神庙-lv18'],
      [0, 80, '【守军】、回合结束:若本回合有2个单位死亡，升级为0/80极地神庙-lv19'],
      [0, 90, '【守军】、回合结束:若本回合有2个单位死亡，升级为0/90极地神庙-lv20']
    ]
  },
  {
    name: '极地神庙',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/jidishenmiao.jpg', import.meta.url),
    data: [
      [0, 40, '【守军】、回合开始时:召唤10/10冻尸-lv12、回合结束:若本回合有2个单位死亡，升级为0/40王座神庙-lv12'],
      [0, 45, '【守军】、回合开始时:召唤11/12冻尸-lv13、回合结束:若本回合有2个单位死亡，升级为0/45王座神庙-lv13'],
      [0, 50, '【守军】、回合开始时:召唤13/13冻尸-lv14、回合结束:若本回合有2个单位死亡，升级为0/50王座神庙-lv14'],
      [0, 55, '【守军】、回合开始时:召唤14/15冻尸-lv15、回合结束:若本回合有2个单位死亡，升级为0/55王座神庙-lv15'],
      [0, 60, '【守军】、回合开始时:召唤16/16冻尸-lv16、回合结束:若本回合有2个单位死亡，升级为0/60王座神庙-lv16'],
      [0, 65, '【守军】、回合开始时:召唤17/18冻尸-lv17、回合结束:若本回合有2个单位死亡，升级为0/65王座神庙-lv17'],
      [0, 70, '【守军】、回合开始时:召唤19/19冻尸-lv18、回合结束:若本回合有2个单位死亡，升级为0/70王座神庙-lv18'],
      [0, 80, '【守军】、回合开始时:召唤21/21冻尸-lv19、回合结束:若本回合有2个单位死亡，升级为0/80王座神庙-lv19'],
      [0, 90, '【守军】、回合开始时:召唤23/23冻尸-lv20、回合结束:若本回合有2个单位死亡，升级为0/90王座神庙-lv20']
    ]
  },
  {
    name: '王座神庙',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/wangzuoshenmiao.jpg', import.meta.url),
    data: [
      [0, 40, '【守军】、回合开始:召唤8/14神庙祭师-lv12、友军死亡时:自身生命+6'],
      [0, 45, '【守军】、回合开始:召唤9/16神庙祭师-lv13、友军死亡时:自身生命+7'],
      [0, 50, '【守军】、回合开始:召唤10/18神庙祭师-lv14、友军死亡时:自身生命+7'],
      [0, 55, '【守军】、回合开始:召唤11/20神庙祭师-lv15、友军死亡时:自身生命+7'],
      [0, 60, '【守军】、回合开始:召唤13/21神庙祭师-lv16、友军死亡时:自身生命+8'],
      [0, 65, '【守军】、回合开始:召唤15/22神庙祭师-lv17、友军死亡时:自身生命+9'],
      [0, 70, '【守军】、回合开始:召唤17/23神庙祭师-lv18、友军死亡时:自身生命+9'],
      [0, 80, '【守军】、回合开始:召唤19/26神庙祭师-lv19、友军死亡时:自身生命+10'],
      [0, 90, '【守军】、回合开始:召唤20/30神庙祭师-lv20、友军死亡时:自身生命+10']
    ]
  },
  {
    name: '可怖刺髓者',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/kebucisuizhe.jpg', import.meta.url),
    data: [
      [21, 6, '登场:魔防+30持续1回合，若自己位置已冰封，则自身攻击+8，并获得【践踏】'],
      [23, 7, '登场:魔防+35持续1回合，若自己位置已冰封，则自身攻击+9，并获得【践踏】'],
      [25, 8, '登场:魔防+40持续1回合，若自己位置已冰封，则自身攻击+10，并获得【践踏】'],
      [27, 9, '登场:魔防+45持续1回合，若自己位置已冰封，则自身攻击+12，并获得【践踏】'],
      [30, 10, '登场:魔防+50持续1回合，若自己位置已冰封，则自身攻击+13，并获得【践踏】'],
      [34, 11, '登场:魔防+55持续1回合，若自己位置已冰封，则自身攻击+14，并获得【践踏】'],
      [38, 12, '登场:魔防+60持续1回合，若自己位置已冰封，则自身攻击+15，并获得【践踏】'],
      [42, 13, '登场:魔防+70持续1回合，若自己位置已冰封，则自身攻击+17，并获得【践踏】'],
      [45, 15, '登场:魔防+80持续1回合，若自己位置已冰封，则自身攻击+20，并获得【践踏】']
    ]
  },
  {
    name: '寒盲刀客',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/hanmangdaoke.jpg', import.meta.url),
    data: [
      [11, 19, '【二连击】、登场:冰封随机相邻区域、攻击前:英雄受到伤害，等同于场上冰封数'],
      [12, 20, '【二连击】、登场:冰封随机相邻区域、攻击前:英雄受到伤害，等同于场上冰封数'],
      [13, 23, '【二连击】、登场:冰封随机相邻区域、攻击前:英雄受到伤害，等同于场上冰封数'],
      [14, 24, '【二连击】、登场:冰封随机相邻区域、攻击前:英雄受到伤害，等同于场上冰封数'],
      [16, 25, '【二连击】、登场:冰封随机相邻区域、攻击前:英雄受到伤害，等同于场上冰封数'],
      [18, 26, '【二连击】、登场:冰封随机相邻区域、攻击前:英雄受到伤害，等同于场上冰封数'],
      [20, 28, '【二连击】、登场:冰封随机相邻区域、攻击前:英雄受到伤害，等同于场上冰封数'],
      [22, 30, '【二连击】、登场:冰封随机相邻区域、攻击前:英雄受到伤害，等同于场上冰封数'],
      [24, 32, '【二连击】、登场:冰封随机相邻区域、攻击前:英雄受到伤害，等同于场上冰封数']
    ]
  },
  {
    name: '极夜阴魂',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/jiyeyinhun.jpg', import.meta.url),
    data: [
      [22, 5, '【洞察1】、【隐形】、【穿透】'],
      [24, 6, '【洞察1】、【隐形】、【穿透】、【魔防1】'],
      [27, 6, '【洞察1】、【隐形】、【穿透】、【魔防2】'],
      [30, 7, '【洞察1】、【隐形】、【穿透】、【魔防3】'],
      [33, 9, '【洞察1】、【隐形】、【穿透】、【魔防3】'],
      [36, 11, '【洞察1】、【隐形】、【穿透】、【魔防5】'],
      [39, 13, '【洞察1】、【隐形】、【穿透】、【魔防6】'],
      [44, 13, '【洞察1】、【隐形】、【穿透】、【魔防7】'],
      [50, 15, '【洞察1】、【隐形】、【穿透】、【魔防8】']
    ]
  },
  {
    name: '寒冰骨墙',
    quality: '紫',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/dongshenshitu/hanbingguqiang.jpg', import.meta.url),
    data: [
      [0, 0, '目标区域召唤3/26骨墙lv12，它额外+5/+5冰封脚下，获得【磐龙】'],
      [0, 0, '目标区域召唤4/27骨墙lv13，它额外+5/+5冰封脚下，获得【磐龙】'],
      [0, 0, '目标区域召唤4/29骨墙lv14，它额外+6/+6冰封脚下，获得【磐龙】'],
      [0, 0, '目标区域召唤5/30骨墙lv15，它额外+7/+7冰封脚下，获得【磐龙】'],
      [0, 0, '目标区域召唤6/33骨墙lv16，它额外+8/+8冰封脚下，获得【磐龙】'],
      [0, 0, '目标区域召唤7/35骨墙lv17，它额外+9/+9冰封脚下，获得【磐龙】'],
      [0, 0, '目标区域召唤8/38骨墙lv18，它额外+10/+10冰封脚下，获得【磐龙】'],
      [0, 0, '目标区域召唤9/43骨墙lv19，它额外+11/+11冰封脚下，获得【磐龙】'],
      [0, 0, '目标区域召唤10/49骨墙lv20，它额外+12/+12冰封脚下，获得【磐龙】']
    ]
  },
  {
    name: '冬夜特使',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/dongyeteshi.jpg', import.meta.url),
    data: [
      [15, 11, '【法力封锁2】、登场:冰封脚下、每当一个地狱或冬神友军死亡时:敌方一张手牌法力+1'],
      [17, 12, '【法力封锁2】、登场:冰封脚下、每当一个地狱或冬神友军死亡时:敌方一张手牌法力+1'],
      [19, 13, '【法力封锁2】、登场:冰封脚下、每当一个地狱或冬神友军死亡时:敌方一张手牌法力+1'],
      [21, 15, '【法力封锁2】、登场:冰封脚下、每当一个地狱或冬神友军死亡时:敌方一张手牌法力+1'],
      [24, 16, '【法力封锁2】、登场:冰封脚下、每当一个地狱或冬神友军死亡时:敌方一张手牌法力+1'],
      [26, 18, '【法力封锁2】、登场:冰封脚下、每当一个地狱或冬神友军死亡时:敌方一张手牌法力+1'],
      [29, 19, '【法力封锁2】、登场:冰封脚下、每当一个地狱或冬神友军死亡时:敌方一张手牌法力+1'],
      [32, 21, '【法力封锁2】、登场:冰封脚下、每当一个地狱或冬神友军死亡时:敌方一张手牌法力+1'],
      [35, 23, '【法力封锁2】、登场:冰封脚下、每当一个地狱或冬神友军死亡时:敌方一张手牌法力+1']
    ]
  },
  {
    name: '冬幕骑士',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/dongmuqishi.jpg', import.meta.url),
    data: [
      [18, 18, '【护甲4】、登场:横排所有敌军-5/-5'],
      [20, 20, '【护甲5】、登场:横排所有敌军-6/-6'],
      [23, 22, '【护甲5】、登场:横排所有敌军-7/-7'],
      [25, 25, '【护甲6】、登场:横排所有敌军-8/-8'],
      [28, 27, '【护甲6】、登场:横排所有敌军-9/-9'],
      [30, 30, '【护甲7】、登场:横排所有敌军-10/-10'],
      [33, 33, '【护甲8】、登场:横排所有敌军-11/-11'],
      [36, 36, '【护甲9】、登场:横排所有敌军-12/-12'],
      [39, 39, '【护甲10】、登场:横排所有敌军-13/-13']
    ]
  },
  {
    name: '冷酷冲车',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/lengkuchongche.jpg', import.meta.url),
    data: [
      [13, 43, '【迟缓】、【践踏】、每有一个敌军死亡，自身+4/+4，攻击大于15，获得【磐龙】'],
      [15, 45, '【迟缓】、【磐龙】、【践踏】、每有一个敌军死亡，自身+4/+5'],
      [15, 50, '【迟缓】、【磐龙】、【践踏】、每有一个敌军死亡，自身+5/+5'],
      [20, 50, '【迟缓】、【磐龙】、【践踏】、每有一个敌军死亡，自身+5/+5'],
      [22, 54, '【迟缓】、【磐龙】、【践踏】、每有一个敌军死亡，自身+6/+6'],
      [25, 60, '【迟缓】、【磐龙】、【践踏】、每有一个敌军死亡，自身+6/+6'],
      [28, 64, '【迟缓】、【磐龙】、【践踏】、每有一个敌军死亡，自身+7/+7'],
      [33, 72, '【迟缓】、【磐龙】、【践踏】、每有一个敌军死亡，自身+7/+7'],
      [36, 80, '【迟缓】、【磐龙】、【践踏】、每有一个敌军死亡，自身+8/+8']
    ]
  },
  {
    name: '冷血召唤师',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/lengxuezhaohuanshi.jpg', import.meta.url),
    data: [
      [9, 14, '每当一个敌军死亡:召唤10/10冻尸-lv12'],
      [11, 14, '每当一个敌军死亡:召唤11/12冻尸-lv13'],
      [13, 14, '每当一个敌军死亡:召唤13/13冻尸-lv14'],
      [15, 15, '每当一个敌军死亡:召唤14/15冻尸-lv15'],
      [16, 16, '每当一个敌军死亡:召唤16/16冻尸-lv16'],
      [18, 18, '每当一个敌军死亡:召唤17/18冻尸-lv17'],
      [19, 19, '每当一个敌军死亡:召唤19/19冻尸-lv18'],
      [21, 21, '每当一个敌军死亡:召唤21/21冻尸-lv19'],
      [23, 23, '每当一个敌军死亡:召唤23/23冻尸-lv20']
    ]
  },
  {
    name: '极地冰封者',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/jidibingfengzhe.jpg', import.meta.url),
    data: [
      [14, 44, '【守军】、回合开始时:随机敌方区域投掷冰弹，并且冰封该地区'],
      [15, 50, '【守军】、回合开始时:随机敌方区域投掷冰弹，并且冰封该地区'],
      [16, 56, '【守军】、回合开始时:随机敌方区域投掷冰弹，并且冰封该地区'],
      [18, 60, '【守军】、回合开始时:随机敌方区域投掷冰弹，并且冰封该地区'],
      [20, 64, '【守军】、回合开始时:随机敌方区域投掷冰弹，并且冰封该地区'],
      [23, 68, '【守军】、回合开始时:随机敌方区域投掷冰弹，并且冰封该地区'],
      [25, 77, '【守军】、回合开始时:随机敌方区域投掷冰弹，并且冰封该地区'],
      [28, 85, '【守军】、回合开始时:随机敌方区域投掷冰弹，并且冰封该地区'],
      [32, 90, '【守军】、回合开始时:随机敌方区域投掷冰弹，并且冰封该地区']
    ]
  },
  {
    name: '不朽霜剑士',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/buxiushuangjianshi.jpg', import.meta.url),
    data: [
      [12, 6, '登场:每有一个友方冰封，自身攻击+4、死亡:若自身区域已冰封，自身回手牌'],
      [14, 6, '登场:每有一个友方冰封，自身攻击+4、死亡:若自身区域已冰封，自身回手牌'],
      [15, 7, '登场:每有一个友方冰封，自身攻击+5、死亡:若自身区域已冰封，自身回手牌'],
      [16, 9, '登场:每有一个友方冰封，自身攻击+5、死亡:若自身区域已冰封，自身回手牌'],
      [16, 10, '登场:每有一个友方冰封，自身攻击+6、死亡:若自身区域已冰封，自身回手牌'],
      [19, 11, '登场:每有一个友方冰封，自身攻击+6、死亡:若自身区域已冰封，自身回手牌'],
      [19, 12, '登场:每有一个友方冰封，自身攻击+7、死亡:若自身区域已冰封，自身回手牌'],
      [21, 13, '登场:每有一个友方冰封，自身攻击+7、死亡:若自身区域已冰封，自身回手牌'],
      [22, 15, '登场:每有一个友方冰封，自身攻击+8、死亡:若自身区域已冰封，自身回手牌']
    ]
  },
  {
    name: '转化使徒',
    quality: '紫',
    cost: 4,
    type: 2,
    img: new URL('@/assets/zhongzu/dongshenshitu/zhuanhuashitu.jpg', import.meta.url),
    data: [
      [0, 0, '随机敌军-15/-15，冰封其位置，召唤13/13尸嵌-lv9'],
      [0, 0, '随机敌军-16/-16，冰封其位置，召唤14/15尸嵌-lv10'],
      [0, 0, '随机敌军-18/-18，冰封其位置，召唤16/16尸嵌-lv11'],
      [0, 0, '随机敌军-20/-20，冰封其位置，召唤17/18尸嵌-lv12'],
      [0, 0, '随机敌军-22/-22，冰封其位置，召唤19/19尸嵌-lv13'],
      [0, 0, '随机敌军-25/-25，冰封其位置，召唤20/21尸嵌-lv14'],
      [0, 0, '随机敌军-28/-28，冰封其位置，召唤22/22尸嵌-lv15'],
      [0, 0, '随机敌军-32/-32，冰封其位置，召唤24/24尸嵌-lv16'],
      [0, 0, '随机敌军-36/-36，冰封其位置，召唤26/26尸嵌-lv17']
    ]
  },
  {
    name: '雪隐长老灵',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/xueyinzhanglaoling.jpg', import.meta.url),
    data: [
      [17, 19, '登场：冰封相邻随机位置、受到传承：随机敌军-12/-12（无视神佑、魔免）'],
      [19, 20, '登场：冰封相邻随机位置、受到传承：随机敌军-13/-13（无视神佑、魔免）'],
      [21, 21, '登场：冰封相邻随机位置、受到传承：随机敌军-14/-14（无视神佑、魔免）'],
      [23, 23, '登场：冰封相邻随机位置、受到传承：随机敌军-16/-16（无视神佑、魔免）'],
      [25, 25, '登场：冰封相邻随机位置、受到传承：随机敌军-18/-18（无视神佑、魔免）'],
      [27, 27, '登场：冰封相邻随机位置、受到传承：随机敌军-20/-20（无视神佑、魔免）'],
      [29, 29, '登场：冰封相邻随机位置、受到传承：随机敌军-23/-23（无视神佑、魔免）'],
      [32, 32, '登场：冰封相邻随机位置、受到传承：随机敌军-26/-26（无视神佑、魔免）'],
      [36, 36, '登场：冰封相邻随机位置、受到传承：随机敌军-30/-30（无视神佑、魔免）']
    ]
  },
  {
    name: '冰峰甲虫',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/bingfengjiachong.jpg', import.meta.url),
    data: [
      [14, 24, '【护甲3】、【魔防5】、受到传承：额外+4/+4，获得【磐龙】、攻击前：脚下有冰封，向前方喷吐冰毒'],
      [15, 25, '【护甲4】、【魔防5】、受到传承：额外+4/+4，获得【磐龙】、攻击前：脚下有冰封，向前方喷吐冰毒'],
      [16, 28, '【护甲4】、【魔防5】、受到传承：额外+5/+5，获得【磐龙】、攻击前：脚下有冰封，向前方喷吐冰毒'],
      [18, 30, '【护甲4】、【魔防6】、受到传承：额外+5/+5，获得【磐龙】、攻击前：脚下有冰封，向前方喷吐冰毒'],
      [20, 33, '【护甲5】、【魔防6】、受到传承：额外+5/+5，获得【磐龙】、攻击前：脚下有冰封，向前方喷吐冰毒'],
      [22, 36, '【护甲5】、【魔防7】、受到传承：额外+6/+6，获得【磐龙】、攻击前：脚下有冰封，向前方喷吐冰毒'],
      [24, 40, '【护甲6】、【魔防8】、受到传承：额外+6/+6，获得【磐龙】、攻击前：脚下有冰封，向前方喷吐冰毒'],
      [27, 45, '【护甲7】、【魔防9】、受到传承：额外+7/+7，获得【磐龙】、攻击前：脚下有冰封，向前方喷吐冰毒'],
      [30, 50, '【护甲8】、【魔防10】、受到传承：额外+8/+8，获得【磐龙】、攻击前：脚下有冰封，向前方喷吐冰毒']
    ]
  },
  {
    name: '邪恶化身',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/xieehuashen.jpg', import.meta.url),
    data: [
      [13, 13, '每当一个炼狱或冬神友军死亡时：长刀投掷英（12点伤害）'],
      [14, 15, '每当一个炼狱或冬神友军死亡时：长刀投掷英（14点伤害）'],
      [15, 17, '每当一个炼狱或冬神友军死亡时：长刀投掷英（15点伤害）'],
      [17, 17, '每当一个炼狱或冬神友军死亡时：长刀投掷英（17点伤害）'],
      [19, 17, '每当一个炼狱或冬神友军死亡时：长刀投掷英（19点伤害）'],
      [21, 18, '每当一个炼狱或冬神友军死亡时：长刀投掷英（21点伤害）'],
      [23, 19, '每当一个炼狱或冬神友军死亡时：长刀投掷英（23点伤害）'],
      [26, 20, '每当一个炼狱或冬神友军死亡时：长刀投掷英（26点伤害）'],
      [29, 21, '每当一个炼狱或冬神友军死亡时：长刀投掷英（29点伤害）']
    ]
  },
  {
    name: '永夜巫妖',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/yongyewuyao.jpg', import.meta.url),
    data: [
      [13, 13, '登场:荒芜随机区域，消灭随机敌军（敌军等级<=13）'],
      [15, 14, '登场:荒芜随机区域，消灭随机敌军（敌军等级<=14）'],
      [16, 16, '登场:荒芜随机区域，消灭随机敌军（敌军等级<=15）'],
      [18, 18, '登场:荒芜随机区域，消灭随机敌军（敌军等级<=16）'],
      [20, 20, '登场:荒芜随机区域，消灭随机敌军（敌军等级<=17）'],
      [22, 22, '登场:荒芜随机区域，消灭随机敌军（敌军等级<=18）'],
      [24, 24, '登场:荒芜随机区域，消灭随机敌军（敌军等级<=19）'],
      [27, 27, '登场:荒芜随机区域，消灭随机敌军（敌军等级<=20）'],
      [30, 30, '登场:荒芜随机区域，消灭随机敌军（敌军等级<=21）']
    ]
  },
  {
    name: '冬幕斗士',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/dongmudoushi.jpg', import.meta.url),
    data: [
      [11, 21, '【护甲5】、【二连击】、登场回合开始:友方每有一处冰封，自身+1/+2，护甲+2'],
      [13, 23, '【护甲6】、【二连击】、登场回合开始:友方每有一处冰封，自身+1/+2，护甲+2'],
      [13, 25, '【护甲6】、【二连击】、登场回合开始:友方每有一处冰封，自身+2/+2，护甲+2'],
      [15, 26, '【护甲7】、【二连击】、登场回合开始:友方每有一处冰封，自身+2/+2，护甲+2'],
      [18, 28, '【护甲7】、【二连击】、登场回合开始:友方每有一处冰封，自身+2/+3，护甲+2'],
      [20, 30, '【护甲8】、【二连击】、登场回合开始:友方每有一处冰封，自身+2/+3，护甲+2'],
      [22, 32, '【护甲8】、【二连击】、登场回合开始:友方每有一处冰封，自身+3/+3，护甲+2'],
      [25, 35, '【护甲9】、【二连击】、登场回合开始:友方每有一处冰封，自身+3/+3，护甲+3'],
      [27, 39, '【护甲10】、【二连击】、登场回合开始:友方每有一处冰封，自身+3/+3，护甲+3']
    ]
  },
  {
    name: '骸骨督军',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/haigudujun.jpg', import.meta.url),
    data: [
      [18, 16, '【护甲3】、每当一个敌军死亡:随机友军攻击+7、护甲+2'],
      [19, 17, '【护甲3】、每当一个敌军死亡:随机友军攻击+8、护甲+2'],
      [20, 18, '【护甲3】、每当一个敌军死亡:随机友军攻击+8、护甲+3'],
      [22, 19, '【护甲3】、每当一个敌军死亡:随机友军攻击+9、护甲+3'],
      [25, 21, '【护甲4】、每当一个敌军死亡:随机友军攻击+9、护甲+3'],
      [28, 24, '【护甲4】、每当一个敌军死亡:随机友军攻击+10、护甲+3'],
      [32, 26, '【护甲5】、每当一个敌军死亡:随机友军攻击+10、护甲+3'],
      [36, 29, '【护甲5】、每当一个敌军死亡:随机友军攻击+11、护甲+3'],
      [40, 33, '【护甲5】、每当一个敌军死亡:随机友军攻击+12、护甲+3']
    ]
  },
  {
    name: '冬神呼啸',
    quality: '紫',
    cost: 5,
    type: 2,
    img: new URL('@/assets/zhongzu/dongshenshitu/dongshenhuxiao.jpg', import.meta.url),
    data: [
      [0, 0, '抓两张牌，冰封2个随机区域，随机冬神友军+7/+7、全场每有一处冰封，英雄生命+4'],
      [0, 0, '抓两张牌，冰封2个随机区域，随机冬神友军+7/+7、全场每有一处冰封，英雄生命+5'],
      [0, 0, '抓两张牌，冰封2个随机区域，随机冬神友军+8/+8、全场每有一处冰封，英雄生命+6'],
      [0, 0, '抓两张牌，冰封2个随机区域，随机冬神友军+10/+10、全场每有一处冰封，英雄生命+7'],
      [0, 0, '抓两张牌，冰封2个随机区域，随机冬神友军+13/+13、全场每有一处冰封，英雄生命+7'],
      [0, 0, '抓两张牌，冰封2个随机区域，随机冬神友军+15/+15、全场每有一处冰封，英雄生命+8'],
      [0, 0, '抓两张牌，冰封2个随机区域，随机冬神友军+19/+19、全场每有一处冰封，英雄生命+8'],
      [0, 0, '抓两张牌，冰封2个随机区域，随机冬神友军+24/+24、全场每有一处冰封，英雄生命+9'],
      [0, 0, '抓两张牌，冰封2个随机区域，随机冬神友军+30/+30、全场每有一处冰封，英雄生命+10']
    ]
  },
  {
    name: '咒杀酷吏',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/zhoushakuli.jpg', import.meta.url),
    data: [
      [8, 39, '任意生物死亡:攻击+5，攻击前:吞噬一个相邻友军，连击次数+1'],
      [10, 43, '任意生物死亡:攻击+5，攻击前:吞噬一个相邻友军，连击次数+1'],
      [12, 45, '任意生物死亡:攻击+6，攻击前:吞噬一个相邻友军，连击次数+1'],
      [12, 55, '任意生物死亡:攻击+6，攻击前:吞噬一个相邻友军，连击次数+1'],
      [13, 60, '任意生物死亡:攻击+7，攻击前:吞噬一个相邻友军，连击次数+1'],
      [16, 65, '任意生物死亡:攻击+7，攻击前:吞噬一个相邻友军，连击次数+1'],
      [17, 70, '任意生物死亡:攻击+8，攻击前:吞噬一个相邻友军，连击次数+1'],
      [19, 75, '任意生物死亡:攻击+8，攻击前:吞噬一个相邻友军，连击次数+1'],
      [20, 80, '任意生物死亡:攻击+9，攻击前:吞噬一个相邻友军，连击次数+1']
    ]
  },
  {
    name: '深山雪怪',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/shenshanxueguai.jpg', import.meta.url),
    data: [
      [23, 33, '【魔免】、攻击前:随机一个蛮石、一个冬神友军+5/+5、登场回合结束:冰封脚下'],
      [26, 35, '【魔免】、攻击前:随机一个蛮石、一个冬神友军+5/+5、登场回合结束:冰封脚下'],
      [29, 39, '【魔免】、攻击前:随机一个蛮石、一个冬神友军+6/+6、登场回合结束:冰封脚下'],
      [32, 42, '【魔免】、攻击前:随机一个蛮石、一个冬神友军+6/+6、登场回合结束:冰封脚下'],
      [35, 48, '【魔免】、攻击前:随机一个蛮石、一个冬神友军+7/+7、登场回合结束:冰封脚下'],
      [40, 50, '【魔免】、攻击前:随机一个蛮石、一个冬神友军+7/+7、登场回合结束:冰封脚下'],
      [45, 55, '【魔免】、攻击前:随机一个蛮石、一个冬神友军+8/+8、登场回合结束:冰封脚下'],
      [50, 60, '【魔免】、攻击前:随机一个蛮石、一个冬神友军+8/+8、登场回合结束:冰封脚下'],
      [55, 65, '【魔免】、攻击前:随机一个蛮石、一个冬神友军+9/+9、登场回合结束:冰封脚下']
    ]
  },
  {
    name: '使徒君王',
    quality: '紫',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/shitujunwang.jpg', import.meta.url),
    data: [
      [12, 23, '回合开始:随机敌军-7/-7，冰封其位置、回合结束:复活一个本回合死亡的敌军，到己方场上'],
      [13, 25, '回合开始:随机敌军-8/-8，冰封其位置、回合结束:复活一个本回合死亡的敌军，到己方场上'],
      [15, 27, '回合开始:随机敌军-9/-9，冰封其位置、回合结束:复活一个本回合死亡的敌军，到己方场上'],
      [17, 29, '回合开始:随机敌军-10/-10，冰封其位置、回合结束:复活一个本回合死亡的敌军，到己方场上'],
      [20, 35, '回合开始:随机敌军-10/-10，冰封其位置、回合结束:复活一个本回合死亡的敌军，到己方场上'],
      [23, 38, '回合开始:随机敌军-11/-11，冰封其位置、回合结束:复活一个本回合死亡的敌军，到己方场上'],
      [28, 40, '回合开始:随机敌军-11/-11，冰封其位置、回合结束:复活一个本回合死亡的敌军，到己方场上'],
      [32, 45, '回合开始:随机敌军-12/-12，冰封其位置、回合结束:复活一个本回合死亡的敌军，到己方场上'],
      [35, 50, '回合开始:随机敌军-13/-13，冰封其位置、回合结束:复活一个本回合死亡的敌军，到己方场上']
    ]
  },
  {
    name: '冰吼兽',
    quality: '紫',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/binghoushou.jpg', import.meta.url),
    data: [
      [20, 29, '【磐龙】、攻击前:敌方每有一处冰封，自身+1/+3'],
      [22, 30, '【磐龙】、攻击前:敌方每有一处冰封，自身+1/+3'],
      [23, 33, '【磐龙】、攻击前:敌方每有一处冰封，自身+1/+4'],
      [25, 36, '【磐龙】、攻击前:敌方每有一处冰封，自身+1/+4'],
      [26, 40, '【磐龙】、攻击前:敌方每有一处冰封，自身+1/+5'],
      [29, 45, '【磐龙】、攻击前:敌方每有一处冰封，自身+1/+5'],
      [30, 45, '【磐龙】、攻击前:敌方每有一处冰封，自身+2/+5'],
      [35, 50, '【磐龙】、攻击前:敌方每有一处冰封，自身+2/+6'],
      [40, 55, '【磐龙】、攻击前:敌方每有一处冰封，自身+2/+7']
    ]
  },
  {
    name: '冰河世纪',
    quality: '紫',
    cost: 6,
    type: 2,
    img: new URL('@/assets/zhongzu/dongshenshitu/bingheshiji.jpg', import.meta.url),
    data: [
      [0, 0, '所有单位-16/-16、全场每有一处冰封，再-1/-1（无视神佑和魔免）'],
      [0, 0, '【洞察1】、所有单位-18/-18、全场每有一处冰封，再-1/-1（无视神佑和魔免）'],
      [0, 0, '【洞察1】、所有单位-21/-21、全场每有一处冰封，再-1/-1（无视神佑和魔免）'],
      [0, 0, '【洞察1】、所有单位-21/-21、全场每有一处冰封，再-2/-2（无视神佑和魔免）'],
      [0, 0, '【洞察1】、所有单位-24/-24、全场每有一处冰封，再-2/-2（无视神佑和魔免）'],
      [0, 0, '【洞察1】、所有单位-27/-27、全场每有一处冰封，再-2/-2（无视神佑和魔免）'],
      [0, 0, '【洞察1】、所有单位-30/-30、全场每有一处冰封，再-2/-2（无视神佑和魔免）'],
      [0, 0, '【洞察1】、所有单位-34/-34、全场每有一处冰封，再-2/-2（无视神佑和魔免）'],
      [0, 0, '【洞察1】、所有单位-38/-38、全场每有一处冰封，再-2/-2（无视神佑和魔免）']
    ]
  },
  {
    name: '冰疫兽',
    quality: '紫',
    cost: 7,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/bingyishou.jpg', import.meta.url),
    data: [
      [24, 65, '【磐龙】、登场:全场每有一处冰封，英雄生命+7'],
      [25, 70, '【磐龙】、登场:全场每有一处冰封，英雄生命+8'],
      [28, 75, '【磐龙】、登场:全场每有一处冰封，英雄生命+9'],
      [30, 80, '【磐龙】、登场:全场每有一处冰封，英雄生命+10'],
      [33, 85, '【磐龙】、登场:全场每有一处冰封，英雄生命+11'],
      [36, 90, '【磐龙】、登场:全场每有一处冰封，英雄生命+12'],
      [40, 95, '【磐龙】、登场:全场每有一处冰封，英雄生命+13'],
      [45, 100, '【磐龙】、登场:全场每有一处冰封，英雄生命+14'],
      [50, 110, '【磐龙】、登场:全场每有一处冰封，英雄生命+15']
    ]
  },
  {
    name: '冬神邪使',
    quality: '紫',
    cost: 7,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/dongshenxieshi.jpg', import.meta.url),
    data: [
      [20, 20, '登场:召唤两个12/1骸骨战士-lv12、每当一个单位死亡:自身攻击+2'],
      [23, 23, '登场:召唤两个14/1骸骨战士-lv13、每当一个单位死亡:自身攻击+2'],
      [27, 27, '登场:召唤两个16/1骸骨战士-lv14、每当一个单位死亡:自身攻击+2'],
      [30, 30, '登场:召唤两个18/1骸骨战士-lv15、每当一个单位死亡:自身攻击+3'],
      [33, 33, '登场:召唤两个10/1骸骨战士-lv16、每当一个单位死亡:自身攻击+3'],
      [36, 36, '登场:召唤两个22/1骸骨战士-lv17、每当一个单位死亡:自身攻击+3'],
      [39, 39, '登场:召唤两个24/1骸骨战士-lv18、每当一个单位死亡:自身攻击+4'],
      [43, 43, '登场:召唤两个26/1骸骨战士-lv19、每当一个单位死亡:自身攻击+4'],
      [48, 48, '登场:召唤两个28/1骸骨战士-lv20、每当一个单位死亡:自身攻击+4']
    ]
  },
  {
    name: '冰龙',
    quality: '紫',
    cost: 8,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/binglong.jpg', import.meta.url),
    data: [
      [27, 17, '【践踏】、登场:获得【魔免】1回合，全场每有一处冰封，自身+3/+2、攻击前:所有敌军-3/-3'],
      [33, 18, '【践踏】、登场:获得【魔免】1回合，全场每有一处冰封，自身+3/+3、攻击前:所有敌军-3/-3'],
      [35, 20, '【践踏】、登场:获得【魔免】1回合，全场每有一处冰封，自身+3/+3、攻击前:所有敌军-4/-4'],
      [40, 22, '【践踏】、登场:获得【魔免】1回合，全场每有一处冰封，自身+4/+3、攻击前:所有敌军-4/-4'],
      [45, 23, '【践踏】、登场:获得【魔免】1回合，全场每有一处冰封，自身+4/+3、攻击前:所有敌军-5/-5'],
      [50, 25, '【践踏】、登场:获得【魔免】1回合，全场每有一处冰封，自身+5/+3、攻击前:所有敌军-5/-5'],
      [55, 27, '【践踏】、登场:获得【魔免】1回合，全场每有一处冰封，自身+5/+3、攻击前:所有敌军-6/-6'],
      [60, 30, '【践踏】、登场:获得【魔免】1回合，全场每有一处冰封，自身+6/+4、攻击前:所有敌军-7/-7'],
      [65, 35, '【践踏】、登场:获得【魔免】1回合，全场每有一处冰封，自身+6/+6、攻击前:所有敌军-8/-8']
    ]
  },
  {
    name: '冰原攻城兽',
    quality: '紫',
    cost: 8,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/bingyuangongchengshou.jpg', import.meta.url),
    data: [
      [25, 25, '【磐龙】、【践踏】、登场:友方每有一处冰封，自身+3/+11'],
      [30, 30, '【磐龙】、【践踏】、登场:友方每有一处冰封，自身+3/+12'],
      [33, 33, '【磐龙】、【践踏】、登场:友方每有一处冰封，自身+4/+12'],
      [35, 35, '【磐龙】、【践踏】、登场:友方每有一处冰封，自身+4/+14'],
      [38, 38, '【磐龙】、【践踏】、登场:友方每有一处冰封，自身+5/+15'],
      [42, 42, '【磐龙】、【践踏】、登场:友方每有一处冰封，自身+5/+17'],
      [46, 46, '【磐龙】、【践踏】、登场:友方每有一处冰封，自身+6/+18'],
      [50, 50, '【磐龙】、【践踏】、登场:友方每有一处冰封，自身+7/+19'],
      [55, 55, '【磐龙】、【践踏】、登场:友方每有一处冰封，自身+8/+20']
    ]
  },
  {
    name: '传记·荒芜之地',
    quality: '紫',
    cost: 2,
    type: 3,
    img: new URL('@/assets/zhongzu/dongshenshitu/zhuanji_huangwuzhidi.jpg', import.meta.url),
    data: [
      [0, 0, '荒芜一个敌方区域，召唤尸嵌-lv12，获得【传记·荒芜之师】'],
      [0, 0, '荒芜一个敌方区域，召唤尸嵌-lv13，获得【传记·荒芜之师】'],
      [0, 0, '荒芜一个敌方区域，召唤尸嵌-lv14，获得【传记·荒芜之师】'],
      [0, 0, '荒芜一个敌方区域，召唤尸嵌-lv15，获得【传记·荒芜之师】'],
      [0, 0, '荒芜一个敌方区域，召唤尸嵌-lv16，获得【传记·荒芜之师】'],
      [0, 0, '荒芜一个敌方区域，召唤尸嵌-lv17，获得【传记·荒芜之师】'],
      [0, 0, '荒芜一个敌方区域，召唤尸嵌-lv18，获得【传记·荒芜之师】'],
      [0, 0, '荒芜一个敌方区域，召唤尸嵌-lv19，获得【传记·荒芜之师】'],
      [0, 0, '荒芜一个敌方区域，召唤尸嵌-lv20，获得【传记·荒芜之师】']
    ]
  },
  {
    name: '传记·荒芜之师',
    quality: '紫',
    cost: 5,
    type: 3,
    img: new URL('@/assets/zhongzu/dongshenshitu/zhuanji_huangwuzhishi.jpg', import.meta.url),
    data: [
      [0, 0, '全场每有一个魔免单位，则召唤一个骸骨战士-lv12'],
      [0, 0, '全场每有一个魔免单位，则召唤一个骸骨战士-lv13'],
      [0, 0, '全场每有一个魔免单位，则召唤一个骸骨战士-lv14'],
      [0, 0, '全场每有一个魔免单位，则召唤一个骸骨战士-lv15'],
      [0, 0, '全场每有一个魔免单位，则召唤一个骸骨战士-lv16'],
      [0, 0, '全场每有一个魔免单位，则召唤一个骸骨战士-lv17'],
      [0, 0, '全场每有一个魔免单位，则召唤一个骸骨战士-lv18'],
      [0, 0, '全场每有一个魔免单位，则召唤一个骸骨战士-lv19'],
      [0, 0, '全场每有一个魔免单位，则召唤一个骸骨战士-lv20']
    ]
  },
  {
    name: '寒风血刃',
    quality: '橙',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/dongshenshitu/hanfengxueren.jpg', import.meta.url),
    data: [
      [0, 0, '目标友军+15/+10、获得【先攻】、【践踏】、冰封自身位置'],
      [0, 0, '目标友军+16/+12、获得【先攻】、【践踏】、冰封自身位置'],
      [0, 0, '目标友军+18/+13、获得【先攻】、【践踏】、冰封自身位置'],
      [0, 0, '目标友军+20/+15、获得【先攻】、【践踏】、冰封自身位置'],
      [0, 0, '目标友军+23/+16、获得【先攻】、【践踏】、冰封自身位置'],
      [0, 0, '目标友军+25/+18、获得【先攻】、【践踏】、冰封自身位置'],
      [0, 0, '目标友军+28/+20、获得【先攻】、【践踏】、冰封自身位置'],
      [0, 0, '目标友军+32/+22、获得【先攻】、【践踏】、冰封自身位置'],
      [0, 0, '目标友军+36/+24、获得【先攻】、【践踏】、冰封自身位置']
    ]
  },
  {
    name: '荒芜冰巫·野',
    quality: '橙',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/huangwubingwu_ye.jpg', import.meta.url),
    data: [
      [16, 16, '登场:荒芜随机区域，回手随机敌军（敌军等级<=16）、攻击前:场上每有一个守军，自身攻击+2'],
      [18, 18, '登场:荒芜随机区域，回手随机敌军（敌军等级<=17）、攻击前:场上每有一个守军，自身攻击+2'],
      [20, 20, '登场:荒芜随机区域，回手随机敌军（敌军等级<=18）、攻击前:场上每有一个守军，自身攻击+3'],
      [23, 23, '登场:荒芜随机区域，回手随机敌军（敌军等级<=19）、攻击前:场上每有一个守军，自身攻击+3'],
      [26, 26, '登场:荒芜随机区域，回手随机敌军（敌军等级<=20）、攻击前:场上每有一个守军，自身攻击+3'],
      [29, 29, '登场:荒芜随机区域，回手随机敌军（敌军等级<=20）、攻击前:场上每有一个守军，自身攻击+3'],
      [32, 32, '登场:荒芜随机区域，回手随机敌军（敌军等级<=20）、攻击前:场上每有一个守军，自身攻击+4'],
      [35, 35, '登场:荒芜随机区域，回手随机敌军（敌军等级<=21）、攻击前:场上每有一个守军，自身攻击+4'],
      [39, 39, '登场:荒芜随机区域，回手随机敌军（敌军等级<=22）、攻击前:场上每有一个守军，自身攻击+4']
    ]
  },
  {
    name: '不息之灵',
    quality: '橙',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/buxizhiling.jpg', import.meta.url),
    data: [
      [17, 1, '死亡:随机位置重生自己，等级-1'],
      [19, 1, '死亡:随机位置重生自己，等级-1'],
      [21, 1, '死亡:随机位置重生自己，等级-1'],
      [24, 1, '死亡:随机位置重生自己，等级-1'],
      [27, 1, '死亡:随机位置重生自己，等级-1'],
      [32, 1, '死亡:随机位置重生自己，等级-1'],
      [38, 1, '死亡:随机位置重生自己，等级-1'],
      [44, 1, '死亡:随机位置重生自己，等级-1'],
      [50, 1, '死亡:随机位置重生自己，等级-1']
    ]
  },
  {
    name: '寒风魔将·赛古斯',
    quality: '橙',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/hanfengmojiang_saigusi.jpg', import.meta.url),
    data: [
      [21, 15, '【先攻】、【践踏】、【护甲7】'],
      [24, 16, '【先攻】、【践踏】、【护甲8】'],
      [26, 20, '【先攻】、【践踏】、【护甲8】'],
      [30, 20, '【先攻】、【践踏】、【护甲9】'],
      [33, 22, '【先攻】、【践踏】、【护甲10】'],
      [37, 25, '【先攻】、【践踏】、【护甲11】'],
      [42, 28, '【先攻】、【践踏】、【护甲12】'],
      [48, 30, '【先攻】、【践踏】、【护甲13】'],
      [55, 30, '【先攻】、【践踏】、【护甲15】']
    ]
  },
  {
    name: '永夜女王',
    quality: '橙',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/yongyenvwang.jpg', import.meta.url),
    data: [
      [12, 8, '【魔免】、【传承4】、敌方法力-1、登场和受到传承时：女王隐形2回合、回合开始：随机敌军-x/-x，冰封脚下，眩晕1回合（x为自身的传承）'],
      [15, 10, '【魔免】、【传承4】、敌方法力-1、登场和受到传承时：女王隐形2回合、回合开始：随机敌军-x/-x，冰封脚下，眩晕1回合（x为自身的传承）'],
      [16, 13, '【魔免】、【传承5】、敌方法力-1、登场和受到传承时：女王隐形2回合、回合开始：随机敌军-x/-x，冰封脚下，眩晕1回合（x为自身的传承）'],
      [19, 16, '【魔免】、【传承5】、敌方法力-1、登场和受到传承时：女王隐形2回合、回合开始：随机敌军-x/-x，冰封脚下，眩晕1回合（x为自身的传承）'],
      [21, 18, '【魔免】、【传承6】、敌方法力-1、登场和受到传承时：女王隐形2回合、回合开始：随机敌军-x/-x，冰封脚下，眩晕1回合（x为自身的传承）'],
      [25, 19, '【魔免】、【传承7】、敌方法力-1、登场和受到传承时：女王隐形2回合、回合开始：随机敌军-x/-x，冰封脚下，眩晕1回合（x为自身的传承）'],
      [29, 21, '【魔免】、【传承8】、敌方法力-1、登场和受到传承时：女王隐形2回合、回合开始：随机敌军-x/-x，冰封脚下，眩晕1回合（x为自身的传承）'],
      [34, 24, '【魔免】、【传承9】、敌方法力-1、登场和受到传承时：女王隐形2回合、回合开始：随机敌军-x/-x，冰封脚下，眩晕1回合（x为自身的传承）'],
      [39, 27, '【魔免】、【传承10】、敌方法力-1、登场和受到传承时：女王隐形2回合、回合开始：随机敌军-x/-x，冰封脚下，眩晕1回合（x为自身的传承）']
    ]
  },
  {
    name: '王座巫妖',
    quality: '橙',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/wangzuowuyao.jpg', import.meta.url),
    data: [
      [13, 39, '登场:随机敌军-8/-8、友军死亡时:随机敌军-3/-3、敌军死亡时:随机友军+3/+3'],
      [15, 42, '登场:随机敌军-9/-9、友军死亡时:随机敌军-3/-3、敌军死亡时:随机友军+3/+3'],
      [17, 43, '登场:随机敌军-11/-11、友军死亡时:随机敌军-3/-3、敌军死亡时:随机友军+3/+3'],
      [19, 45, '登场:随机敌军-13/-13、友军死亡时:随机敌军-3/-3、敌军死亡时:随机友军+3/+3'],
      [20, 50, '登场:随机敌军-13/-13、友军死亡时:随机敌军-4/-4、敌军死亡时:随机友军+4/+4'],
      [22, 55, '登场:随机敌军-16/-16、友军死亡时:随机敌军-4/-4、敌军死亡时:随机友军+4/+4'],
      [25, 60, '登场:随机敌军-20/-20、友军死亡时:随机敌军-4/-4、敌军死亡时:随机友军+4/+4'],
      [27, 65, '登场:随机敌军-25/-25、友军死亡时:随机敌军-5/-5、敌军死亡时:随机友军+5/+5'],
      [30, 75, '登场:随机敌军-30/-30、友军死亡时:随机敌军-5/-5、敌军死亡时:随机友军+5/+5']
    ]
  },
  {
    name: '冬神化身',
    quality: '橙',
    cost: 7,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/dongshenhuashen.jpg', import.meta.url),
    data: [
      [9, 32, '登场:友方每有一处冰封，自身+3/+11、回合结束:敌方每有一处冰封，你便吸取对手5点生命'],
      [10, 36, '登场:友方每有一处冰封，自身+4/+11、回合结束:敌方每有一处冰封，你便吸取对手5点生命'],
      [12, 42, '登场:友方每有一处冰封，自身+4/+11、回合结束:敌方每有一处冰封，你便吸取对手6点生命'],
      [14, 48, '登场:友方每有一处冰封，自身+4/+13、回合结束:敌方每有一处冰封，你便吸取对手6点生命'],
      [16, 54, '登场:友方每有一处冰封，自身+5/+15、回合结束:敌方每有一处冰封，你便吸取对手7点生命'],
      [18, 60, '登场:友方每有一处冰封，自身+5/+15、回合结束:敌方每有一处冰封，你便吸取对手7点生命'],
      [20, 68, '登场:友方每有一处冰封，自身+6/+16、回合结束:敌方每有一处冰封，你便吸取对手8点生命'],
      [22, 77, '登场:友方每有一处冰封，自身+7/+17、回合结束:敌方每有一处冰封，你便吸取对手9点生命'],
      [24, 86, '登场:友方每有一处冰封，自身+8/+18、回合结束:敌方每有一处冰封，你便吸取对手10点生命']
    ]
  },
  {
    name: '冰山·亚特拉斯',
    quality: '橙',
    cost: 8,
    type: 1,
    img: new URL('@/assets/zhongzu/dongshenshitu/bingshan_yatelasi.jpg', import.meta.url),
    data: [
      [25, 100, '【磐龙】、登场:冰封7个区域，所有单位本回合不能攻击'],
      [30, 110, '【磐龙】、登场:冰封7个区域，所有单位本回合不能攻击'],
      [35, 125, '【磐龙】、登场:冰封7个区域，所有单位本回合不能攻击'],
      [40, 140, '【磐龙】、登场:冰封7个区域，所有单位本回合不能攻击'],
      [50, 150, '【磐龙】、登场:冰封7个区域，所有单位本回合不能攻击'],
      [60, 165, '【磐龙】、登场:冰封7个区域，所有单位本回合不能攻击'],
      [70, 180, '【磐龙】、登场:冰封7个区域，所有单位本回合不能攻击'],
      [80, 200, '【磐龙】、登场:冰封7个区域，所有单位本回合不能攻击'],
      [90, 220, '【磐龙】、登场:冰封7个区域，所有单位本回合不能攻击']
    ]
  }
];
