export default [
  {
    name: '红海使魔',
    quality: '白',
    cost: 0,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/honghaishimo.jpg', import.meta.url),
    data: [
      [9, 6, '/'],
      [10, 7, '/'],
      [11, 8, '/'],
      [12, 9, '/'],
      [13, 10, '/'],
      [14, 11, '/'],
      [15, 12, '/'],
      [16, 13, '/'],
      [17, 14, '/']
    ]
  },
  {
    name: '燃烧鬼怪',
    quality: '白',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/ranshaoguiguai.jpg', import.meta.url),
    data: [
      [6, 6, '登场:对面首位敌军受到6点伤害'],
      [7, 7, '登场:对面首位敌军受到7点伤害'],
      [8, 8, '登场:对面首位敌军受到8点伤害'],
      [9, 9, '登场:对面首位敌军受到9点伤害'],
      [10, 10, '登场:对面首位敌军受到10点伤害'],
      [11, 11, '登场:对面首位敌军受到11点伤害'],
      [12, 12, '登场:对面首位敌军受到12点伤害'],
      [13, 13, '登场:对面首位敌军受到13点伤害'],
      [14, 14, '登场:对面首位敌军受到14点伤害']
    ]
  },
  {
    name: '嗜血卒',
    quality: '白',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/shixuezu.jpg', import.meta.url),
    data: [
      [6, 8, '命中英雄:自身攻击+6'],
      [7, 9, '命中英雄:自身攻击+6'],
      [8, 10, '命中英雄:自身攻击+7'],
      [10, 10, '命中英雄:自身攻击+7'],
      [11, 11, '命中英雄:自身攻击+8'],
      [12, 12, '命中英雄:自身攻击+9'],
      [13, 13, '命中英雄:自身攻击+10'],
      [14, 14, '命中英雄:自身攻击+11'],
      [15, 15, '命中英雄:自身攻击+12']
    ]
  },
  {
    name: '猩红仆从',
    quality: '白',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/xionghongpucong.jpg', import.meta.url),
    data: [
      [8, 8, '死亡:敌方英雄受到伤害，等同自身攻击'],
      [9, 9, '死亡:敌方英雄受到伤害，等同自身攻击'],
      [10, 10, '死亡:敌方英雄受到伤害，等同自身攻击'],
      [11, 11, '死亡:敌方英雄受到伤害，等同自身攻击'],
      [12, 12, '死亡:敌方英雄受到伤害，等同自身攻击'],
      [13, 14, '死亡:敌方英雄受到伤害，等同自身攻击'],
      [15, 15, '死亡:敌方英雄受到伤害，等同自身攻击'],
      [16, 17, '死亡:敌方英雄受到伤害，等同自身攻击'],
      [18, 18, '死亡:敌方英雄受到伤害，等同自身攻击']
    ]
  },
  {
    name: '混乱恶鬼',
    quality: '白',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/hunluanegui.jpg', import.meta.url),
    data: [
      [13, 7, '登场:双方英雄生命-13'],
      [14, 8, '登场:双方英雄生命-14'],
      [15, 10, '登场:双方英雄生命-15'],
      [16, 12, '登场:双方英雄生命-16'],
      [18, 12, '登场:双方英雄生命-18'],
      [20, 13, '登场:双方英雄生命-20'],
      [22, 14, '登场:双方英雄生命-22'],
      [24, 15, '登场:双方英雄生命-24'],
      [26, 16, '登场:双方英雄生命-26']
    ]
  },
  {
    name: '烈火术',
    quality: '白',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/lianyushenyuan/liehuoshu.jpg', import.meta.url),
    data: [
      [0, 0, '对横排所有敌军造成8点伤害，敌方英雄生命-12'],
      [0, 0, '对横排所有敌军造成8点伤害，敌方英雄生命-13'],
      [0, 0, '对横排所有敌军造成8点伤害，敌方英雄生命-14'],
      [0, 0, '对横排所有敌军造成8点伤害，敌方英雄生命-15'],
      [0, 0, '对横排所有敌军造成9点伤害，敌方英雄生命-16'],
      [0, 0, '对横排所有敌军造成10点伤害，敌方英雄生命-17'],
      [0, 0, '对横排所有敌军造成11点伤害，敌方英雄生命-18'],
      [0, 0, '对横排所有敌军造成12点伤害，敌方英雄生命-19'],
      [0, 0, '对横排所有敌军造成13点伤害，敌方英雄生命-20']
    ]
  },
  {
    name: '焦毒尸嵌',
    quality: '白',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/jiaodushiqian.jpg', import.meta.url),
    data: [
      [12, 12, '命中英雄:敌方英雄生命-12'],
      [13, 13, '命中英雄:敌方英雄生命-13'],
      [14, 14, '命中英雄:敌方英雄生命-14'],
      [15, 15, '命中英雄:敌方英雄生命-15'],
      [16, 16, '命中英雄:敌方英雄生命-16'],
      [17, 18, '命中英雄:敌方英雄生命-17'],
      [19, 19, '命中英雄:敌方英雄生命-19'],
      [21, 21, '命中英雄:敌方英雄生命-21'],
      [23, 23, '命中英雄:敌方英雄生命-23']
    ]
  },
  {
    name: '冥河守卫',
    quality: '蓝',
    cost: 1,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/mingheshouwei.jpg', import.meta.url),
    data: [
      [12, 8, '玩家充能时，该玩家生命-6'],
      [13, 9, '玩家充能时，该玩家生命-7'],
      [15, 10, '玩家充能时，该玩家生命-7'],
      [16, 12, '玩家充能时，该玩家生命-8'],
      [17, 13, '玩家充能时，该玩家生命-8'],
      [19, 14, '玩家充能时，该玩家生命-8'],
      [20, 16, '玩家充能时，该玩家生命-9'],
      [22, 17, '玩家充能时，该玩家生命-9'],
      [23, 19, '玩家充能时，该玩家生命-10']
    ]
  },
  {
    name: '落雷击',
    quality: '蓝',
    cost: 1,
    type: 2,
    img: new URL('@/assets/zhongzu/lianyushenyuan/luoleiji.jpg', import.meta.url),
    data: [
      [0, 0, '目标区域坠落21点伤害'],
      [0, 0, '目标区域坠落23点伤害'],
      [0, 0, '目标区域坠落25点伤害'],
      [0, 0, '目标区域坠落27点伤害'],
      [0, 0, '目标区域坠落29点伤害'],
      [0, 0, '目标区域坠落31点伤害'],
      [0, 0, '目标区域坠落33点伤害'],
      [0, 0, '目标区域坠落35点伤害'],
      [0, 0, '目标区域坠落37点伤害']
    ]
  },
  {
    name: '沸腾血刃',
    quality: '蓝',
    cost: 1,
    type: 2,
    img: new URL('@/assets/zhongzu/lianyushenyuan/feitengxueren.jpg', import.meta.url),
    data: [
      [0, 0, '目标单位攻击+18，生命-9'],
      [0, 0, '目标单位攻击+20，生命-10'],
      [0, 0, '目标单位攻击+22，生命-11'],
      [0, 0, '目标单位攻击+25，生命-12'],
      [0, 0, '目标单位攻击+28，生命-13'],
      [0, 0, '目标单位攻击+32，生命-14'],
      [0, 0, '目标单位攻击+36，生命-15'],
      [0, 0, '目标单位攻击+39，生命-16'],
      [0, 0, '目标单位攻击+42，生命-18']
    ]
  },
  {
    name: '地狱刀吏',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/diyudaoli.jpg', import.meta.url),
    data: [
      [16, 4, '【洞察1】、回合开始时:若你无手牌，自身攻击+6'],
      [18, 4, '【洞察1】、回合开始时:若你无手牌，自身攻击+6'],
      [19, 5, '【洞察1】、回合开始时:若你无手牌，自身攻击+7'],
      [21, 5, '【洞察1】、回合开始时:若你无手牌，自身攻击+7'],
      [22, 6, '【洞察1】、回合开始时:若你无手牌，自身攻击+8'],
      [25, 6, '【洞察1】、回合开始时:若你无手牌，自身攻击+8'],
      [27, 7, '【洞察1】、回合开始时:若你无手牌，自身攻击+9'],
      [29, 8, '【洞察1】、回合开始时:若你无手牌，自身攻击+9'],
      [31, 8, '【洞察1】、回合开始时:若你无手牌，自身攻击+10']
    ]
  },
  {
    name: '邪眼魔',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/xieyanmo.jpg', import.meta.url),
    data: [
      [9, 3, '登场:敌方英雄生命-6、死亡:对手弃掉一张牌'],
      [10, 4, '登场:敌方英雄生命-7、死亡:对手弃掉一张牌'],
      [11, 5, '登场:敌方英雄生命-8、死亡:对手弃掉一张牌'],
      [13, 6, '登场:敌方英雄生命-9、死亡:对手弃掉一张牌'],
      [14, 8, '登场:敌方英雄生命-10、死亡:对手弃掉一张牌'],
      [16, 9, '登场:敌方英雄生命-11、死亡:对手弃掉一张牌'],
      [17, 11, '登场:敌方英雄生命-12、死亡:对手弃掉一张牌'],
      [19, 12, '登场:敌方英雄生命-13、死亡:对手弃掉一张牌'],
      [20, 15, '登场:敌方英雄生命-15、死亡:对手弃掉一张牌']
    ]
  },
  {
    name: '残暴爪钩',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/canbaozhuagou.jpg', import.meta.url),
    data: [
      [14, 8, '命中英雄:双方英雄生命-5'],
      [15, 9, '命中英雄:双方英雄生命-6'],
      [16, 11, '命中英雄:双方英雄生命-6'],
      [17, 13, '命中英雄:双方英雄生命-7'],
      [19, 14, '命中英雄:双方英雄生命-7'],
      [21, 15, '命中英雄:双方英雄生命-8'],
      [24, 16, '命中英雄:双方英雄生命-8'],
      [26, 17, '命中英雄:双方英雄生命-9'],
      [29, 18, '命中英雄:双方英雄生命-9']
    ]
  },
  {
    name: '炎球',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: new URL('@/assets/zhongzu/lianyushenyuan/yanqiu.jpg', import.meta.url),
    data: [
      [0, 0, '向敌方横排，投射25点伤害'],
      [0, 0, '向敌方横排，投射28点伤害'],
      [0, 0, '向敌方横排，投射32点伤害'],
      [0, 0, '向敌方横排，投射36点伤害'],
      [0, 0, '向敌方横排，投射40点伤害'],
      [0, 0, '向敌方横排，投射45点伤害'],
      [0, 0, '向敌方横排，投射50点伤害'],
      [0, 0, '向敌方横排，投射54点伤害'],
      [0, 0, '向敌方横排，投射58点伤害']
    ]
  },
  {
    name: '毒液甲虫',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/duyejiachong.jpg', import.meta.url),
    data: [
      [14, 14, '【护甲3】、死亡:向敌方随机区域喷吐毒液(坠落伤害)'],
      [16, 15, '【护甲3】、死亡:向敌方随机区域喷吐毒液(坠落伤害)'],
      [17, 17, '【护甲3】、死亡:向敌方随机区域喷吐毒液(坠落伤害)'],
      [18, 19, '【护甲4】、死亡:向敌方随机区域喷吐毒液(坠落伤害)'],
      [20, 20, '【护甲4】、死亡:向敌方随机区域喷吐毒液(坠落伤害)'],
      [22, 22, '【护甲4】、死亡:向敌方随机区域喷吐毒液(坠落伤害)'],
      [24, 24, '【护甲4】、死亡:向敌方随机区域喷吐毒液(坠落伤害)'],
      [26, 26, '【护甲5】、死亡:向敌方随机区域喷吐毒液(坠落伤害)'],
      [28, 28, '【护甲5】、死亡:向敌方随机区域喷吐毒液(坠落伤害)']
    ]
  },
  {
    name: '热火冲锋',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: new URL('@/assets/zhongzu/lianyushenyuan/rehuochongfeng.jpg', import.meta.url),
    data: [
      [0, 0, '目标区域坠落13点伤害，随机友军攻击+13'],
      [0, 0, '目标区域坠落14点伤害，随机友军攻击+14'],
      [0, 0, '目标区域坠落15点伤害，随机友军攻击+15'],
      [0, 0, '目标区域坠落16点伤害，随机友军攻击+16'],
      [0, 0, '目标区域坠落18点伤害，随机友军攻击+18'],
      [0, 0, '目标区域坠落20点伤害，随机友军攻击+20'],
      [0, 0, '目标区域坠落22点伤害，随机友军攻击+22'],
      [0, 0, '目标区域坠落25点伤害，随机友军攻击+25'],
      [0, 0, '目标区域坠落28点伤害，随机友军攻击+28']
    ]
  },
  {
    name: '爆燃邪鬼',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/baoranxiegui.jpg', import.meta.url),
    data: [
      [13, 11, '【践踏】、登场:手上一张践踏生物卡法力-1'],
      [15, 12, '【践踏】、登场:手上一张践踏生物卡法力-1'],
      [16, 14, '【践踏】、登场:手上一张践踏生物卡法力-1'],
      [18, 15, '【践踏】、登场:手上一张践踏生物卡法力-1'],
      [20, 16, '【践踏】、登场:手上一张践踏生物卡法力-1'],
      [22, 17, '【践踏】、登场:手上一张践踏生物卡法力-1'],
      [25, 18, '【践踏】、登场:手上一张践踏生物卡法力-1'],
      [28, 20, '【践踏】、登场:手上一张践踏生物卡法力-1'],
      [30, 24, '【践踏】、登场:手上一张践踏生物卡法力-1']
    ]
  },
  {
    name: '嗜血妖蛾',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/shixueyaoe.jpg', import.meta.url),
    data: [
      [11, 9, '【洞察1】、敌方玩家受到伤害时:自身攻击+1'],
      [12, 11, '【洞察1】、敌方玩家受到伤害时:自身攻击+1'],
      [13, 13, '【洞察1】、敌方玩家受到伤害时:自身攻击+1'],
      [14, 15, '【洞察1】、敌方玩家受到伤害时:自身攻击+2'],
      [16, 16, '【洞察1】、敌方玩家受到伤害时:自身攻击+2'],
      [18, 18, '【洞察1】、敌方玩家受到伤害时:自身攻击+2'],
      [20, 20, '【洞察1】、敌方玩家受到伤害时:自身攻击+2'],
      [22, 23, '【洞察1】、敌方玩家受到伤害时:自身攻击+2'],
      [25, 25, '【洞察1】、敌方玩家受到伤害时:自身攻击+2']
    ]
  },
  {
    name: '猩红勇士',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/xionghongyongshi.jpg', import.meta.url),
    data: [
      [16, 6, '【洞察1】、死亡:投掷长枪攻击英雄'],
      [18, 6, '【洞察1】、死亡:投掷长枪攻击英雄'],
      [20, 7, '【洞察1】、死亡:投掷长枪攻击英雄'],
      [22, 9, '【洞察1】、死亡:投掷长枪攻击英雄'],
      [25, 9, '【洞察1】、死亡:投掷长枪攻击英雄'],
      [28, 10, '【洞察1】、死亡:投掷长枪攻击英雄'],
      [31, 11, '【洞察1】、死亡:投掷长枪攻击英雄'],
      [35, 11, '【洞察1】、死亡:投掷长枪攻击英雄'],
      [38, 12, '【洞察1】、死亡:投掷长枪攻击英雄']
    ]
  },
  {
    name: '尖叫邪鬼',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/jianjiaoxiegui.jpg', import.meta.url),
    data: [
      [12, 9, '命中玩家:对手弃一张牌，若敌方无手牌，自身攻击+5'],
      [13, 11, '命中玩家:对手弃一张牌，若敌方无手牌，自身攻击+5'],
      [15, 12, '命中玩家:对手弃一张牌，若敌方无手牌，自身攻击+6'],
      [16, 14, '命中玩家:对手弃一张牌，若敌方无手牌，自身攻击+7'],
      [18, 16, '命中玩家:对手弃一张牌，若敌方无手牌，自身攻击+8'],
      [20, 18, '命中玩家:对手弃一张牌，若敌方无手牌，自身攻击+9'],
      [22, 20, '命中玩家:对手弃一张牌，若敌方无手牌，自身攻击+10'],
      [25, 21, '命中玩家:对手弃一张牌，若敌方无手牌，自身攻击+11'],
      [28, 22, '命中玩家:对手弃一张牌，若敌方无手牌，自身攻击+12']
    ]
  },
  {
    name: '凝血之池',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/ningxuezhichi.jpg', import.meta.url),
    data: [
      [0, 29, '【守军】、回合结束:英雄生命-5，抓一张牌'],
      [0, 32, '【守军】、回合结束:英雄生命-6，抓一张牌'],
      [0, 36, '【守军】、回合结束:英雄生命-6，抓一张牌'],
      [0, 40, '【守军】、回合结束:英雄生命-6，抓一张牌'],
      [0, 45, '【守军】、回合结束:英雄生命-7，抓一张牌'],
      [0, 49, '【守军】、回合结束:英雄生命-7，抓一张牌'],
      [0, 58, '【守军】、回合结束:英雄生命-8，抓一张牌'],
      [0, 63, '【守军】、回合结束:英雄生命-8，抓一张牌'],
      [0, 70, '【守军】、回合结束:英雄生命-9，抓一张牌']
    ]
  },
  {
    name: '血焰焦木',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/xueyanjiaomu.jpg', import.meta.url),
    data: [
      [9, 20, '敌方英雄受到伤害:自身+1/+1'],
      [10, 23, '敌方英雄受到伤害:自身+1/+1'],
      [11, 26, '敌方英雄受到伤害:自身+1/+1'],
      [12, 30, '敌方英雄受到伤害:自身+1/+1'],
      [13, 35, '敌方英雄受到伤害:自身+1/+1'],
      [15, 37, '敌方英雄受到伤害:自身+1/+1'],
      [17, 40, '敌方英雄受到伤害:自身+1/+1'],
      [19, 43, '敌方英雄受到伤害:自身+1/+1'],
      [20, 49, '敌方英雄受到伤害:自身+1/+1']
    ]
  },
  {
    name: '疯狂战意',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/lianyushenyuan/fengkuangzhanyi.jpg', import.meta.url),
    data: [
      [0, 0, '目标单位+8/+8，场上每有一个敌军，再+2/+3'],
      [0, 0, '目标单位+10/+10，场上每有一个敌军，再+2/+3'],
      [0, 0, '目标单位+10/+10，场上每有一个敌军，再+3/+3'],
      [0, 0, '目标单位+12/+12，场上每有一个敌军，再+3/+3'],
      [0, 0, '目标单位+14/+14，场上每有一个敌军，再+3/+3'],
      [0, 0, '目标单位+17/+17，场上每有一个敌军，再+3/+3'],
      [0, 0, '目标单位+19/+19，场上每有一个敌军，再+4/+4'],
      [0, 0, '目标单位+22/+22，场上每有一个敌军，再+4/+4'],
      [0, 0, '目标单位+25/+25，场上每有一个敌军，再+4/+4']
    ]
  },
  {
    name: '狂暴炎球',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/lianyushenyuan/kuangbaoyanqiu.jpg', import.meta.url),
    data: [
      [0, 0, '目标敌军受到125点伤害，60%几率获得《真理碎片》'],
      [0, 0, '目标敌军受到150点伤害，65%几率获得《真理碎片》'],
      [0, 0, '目标敌军受到175点伤害，70%几率获得《真理碎片》'],
      [0, 0, '目标敌军受到200点伤害，75%几率获得《真理碎片》'],
      [0, 0, '目标敌军受到240点伤害，75%几率获得《真理碎片》'],
      [0, 0, '目标敌军受到265点伤害，77%几率获得《真理碎片》'],
      [0, 0, '目标敌军受到300点伤害，80%几率获得《真理碎片》'],
      [0, 0, '目标敌军受到325点伤害，82%几率获得《真理碎片》'],
      [0, 0, '目标敌军受到350点伤害，85%几率获得《真理碎片》']
    ]
  },
  {
    name: '双头毒虫',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/shuangtouduchong.jpg', import.meta.url),
    data: [
      [6, 20, '死亡、攻击前:敌方随机位置，坠落6点伤害'],
      [7, 22, '死亡、攻击前:敌方随机位置，坠落7点伤害'],
      [8, 24, '死亡、攻击前:敌方随机位置，坠落8点伤害'],
      [9, 26, '死亡、攻击前:敌方随机位置，坠落9点伤害'],
      [10, 28, '死亡、攻击前:敌方随机位置，坠落10点伤害'],
      [11, 31, '死亡、攻击前:敌方随机位置，坠落11点伤害'],
      [12, 34, '死亡、攻击前:敌方随机位置，坠落12点伤害'],
      [13, 39, '死亡、攻击前:敌方随机位置，坠落13点伤害'],
      [15, 40, '死亡、攻击前:敌方随机位置，坠落15点伤害']
    ]
  },
  {
    name: '无面狂奔者',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/wumiankuangbenzhe.jpg', import.meta.url),
    data: [
      [16, 6, '【践踏】、登场：毒液攻击前排敌军（5点伤害）'],
      [18, 6, '【践踏】、登场：毒液攻击前排敌军（5点伤害）'],
      [19, 7, '【践踏】、登场：毒液攻击前排敌军（6点伤害）'],
      [21, 7, '【践踏】、登场：毒液攻击前排敌军（6点伤害）'],
      [23, 8, '【践踏】、登场：毒液攻击前排敌军（7点伤害）'],
      [26, 9, '【践踏】、登场：毒液攻击前排敌军（8点伤害）'],
      [29, 10, '【践踏】、登场：毒液攻击前排敌军（9点伤害）'],
      [32, 11, '【践踏】、登场：毒液攻击前排敌军（10点伤害）'],
      [35, 12, '【践踏】、登场：毒液攻击前排敌军（11点伤害）']
    ]
  },
  {
    name: '恶毒魔眼',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/edumoyan.jpg', import.meta.url),
    data: [
      [18, 3, '【魔防4】、每当一个炼狱或冬神友军死亡时：攻击+5'],
      [20, 3, '【魔防5】、每当一个炼狱或冬神友军死亡时：攻击+5'],
      [22, 3, '【魔防5】、每当一个炼狱或冬神友军死亡时：攻击+6'],
      [24, 4, '【魔防6】、每当一个炼狱或冬神友军死亡时：攻击+6'],
      [26, 4, '【魔防6】、每当一个炼狱或冬神友军死亡时：攻击+7'],
      [29, 5, '【魔防7】、每当一个炼狱或冬神友军死亡时：攻击+7'],
      [32, 6, '【魔防7】、每当一个炼狱或冬神友军死亡时：攻击+8'],
      [35, 6, '【魔防8】、每当一个炼狱或冬神友军死亡时：攻击+8'],
      [39, 7, '【魔防8】、每当一个炼狱或冬神友军死亡时：攻击+9']
    ]
  },
  {
    name: '熔炉尸嵌',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/ronglushiqian.jpg', import.meta.url),
    data: [
      [10, 26, '【法力封锁2】、攻击前:若敌方或自己没有手牌，自身+2/+3'],
      [11, 30, '【法力封锁2】、攻击前:若敌方或自己没有手牌，自身+2/+3'],
      [12, 32, '【法力封锁2】、攻击前:若敌方或自己没有手牌，自身+2/+3'],
      [13, 36, '【法力封锁2】、攻击前:若敌方或自己没有手牌，自身+3/+3'],
      [14, 39, '【法力封锁2】、攻击前:若敌方或自己没有手牌，自身+3/+3'],
      [16, 42, '【法力封锁2】、攻击前:若敌方或自己没有手牌，自身+4/+3'],
      [18, 45, '【法力封锁2】、攻击前:若敌方或自己没有手牌，自身+4/+3'],
      [20, 49, '【法力封锁2】、攻击前:若敌方或自己没有手牌，自身+4/+4'],
      [22, 54, '【法力封锁2】、攻击前:若敌方或自己没有手牌，自身+4/+4']
    ]
  },
  {
    name: '地狱双头犬',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/diyushuangtouquan.jpg', import.meta.url),
    data: [
      [9, 22, '【洞察1】、【二连击】'],
      [10, 25, '【洞察1】、【二连击】'],
      [12, 26, '【洞察1】、【二连击】'],
      [14, 28, '【洞察1】、【二连击】'],
      [15, 33, '【洞察1】、【二连击】'],
      [16, 38, '【洞察1】、【二连击】'],
      [18, 40, '【洞察1】、【二连击】'],
      [20, 42, '【洞察1】、【二连击】'],
      [22, 45, '【洞察1】、【二连击】']
    ]
  },
  {
    name: '焦炎异魔',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/jiaoyanyimo.jpg', import.meta.url),
    data: [
      [16, 12, '攻击前:随机敌军受到7点伤害'],
      [18, 13, '攻击前:随机敌军受到8点伤害'],
      [20, 15, '攻击前:随机敌军受到8点伤害'],
      [22, 16, '攻击前:随机敌军受到9点伤害'],
      [24, 18, '攻击前:随机敌军受到10点伤害'],
      [27, 20, '攻击前:随机敌军受到11点伤害'],
      [30, 22, '攻击前:随机敌军受到12点伤害'],
      [33, 24, '攻击前:随机敌军受到13点伤害'],
      [36, 26, '攻击前:随机敌军受到14点伤害']
    ]
  },
  {
    name: '贪食之翼',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/tanshizhiyi.jpg', import.meta.url),
    data: [
      [5, 30, '【穿透】、敌方英雄受到伤害:50%几率，自身+3/+3'],
      [6, 31, '【穿透】、敌方英雄受到伤害:50%几率，自身+3/+4'],
      [7, 33, '【穿透】、敌方英雄受到伤害:50%几率，自身+3/+5'],
      [8, 38, '【穿透】、敌方英雄受到伤害:50%几率，自身+3/+5'],
      [9, 42, '【穿透】、敌方英雄受到伤害:50%几率，自身+3/+6'],
      [10, 48, '【穿透】、敌方英雄受到伤害:50%几率，自身+3/+6'],
      [11, 50, '【穿透】、敌方英雄受到伤害:50%几率，自身+4/+6'],
      [12, 53, '【穿透】、敌方英雄受到伤害:50%几率，自身+4/+7'],
      [13, 56, '【穿透】、敌方英雄受到伤害:50%几率，自身+4/+8']
    ]
  },
  {
    name: '烈焰风暴',
    quality: '蓝',
    cost: 4,
    type: 2,
    img: new URL('@/assets/zhongzu/lianyushenyuan/lieyanfengbao.jpg', import.meta.url),
    data: [
      [0, 0, '对横排所有敌军造成16点伤害，对英雄造成16点伤害'],
      [0, 0, '对横排所有敌军造成19点伤害，对英雄造成19点伤害'],
      [0, 0, '对横排所有敌军造成22点伤害，对英雄造成22点伤害'],
      [0, 0, '对横排所有敌军造成25点伤害，对英雄造成25点伤害'],
      [0, 0, '对横排所有敌军造成28点伤害，对英雄造成28点伤害'],
      [0, 0, '对横排所有敌军造成32点伤害，对英雄造成32点伤害'],
      [0, 0, '对横排所有敌军造成36点伤害，对英雄造成36点伤害'],
      [0, 0, '对横排所有敌军造成39点伤害，对英雄造成39点伤害'],
      [0, 0, '对横排所有敌军造成42点伤害，对英雄造成42点伤害']
    ]
  },
  {
    name: '恶臭公害',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/echougonghai.jpg', import.meta.url),
    data: [
      [16, 22, '【护甲7】、回合开始:英雄受到3点伤害'],
      [18, 24, '【护甲7】、回合开始:英雄受到3点伤害'],
      [19, 27, '【护甲8】、回合开始:英雄受到3点伤害'],
      [20, 32, '【护甲8】、回合开始:英雄受到3点伤害'],
      [22, 33, '【护甲9】、回合开始:英雄受到3点伤害'],
      [25, 36, '【护甲9】、回合开始:英雄受到4点伤害'],
      [28, 38, '【护甲10】、回合开始:英雄受到4点伤害'],
      [31, 41, '【护甲10】、回合开始:英雄受到4点伤害'],
      [33, 43, '【护甲11】、回合开始:英雄受到4点伤害']
    ]
  },
  {
    name: '肥胖督军',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/feipangdujun.jpg', import.meta.url),
    data: [
      [15, 25, '【践踏】、登场：全体践踏友军获得【磐龙】1回合'],
      [16, 30, '【践踏】、登场：全体践踏友军获得【磐龙】1回合'],
      [18, 32, '【践踏】、登场：全体践踏友军获得【磐龙】1回合'],
      [20, 34, '【践踏】、登场：全体践踏友军获得【磐龙】1回合'],
      [22, 36, '【践踏】、登场：全体践踏友军获得【磐龙】1回合'],
      [25, 38, '【践踏】、登场：全体践踏友军获得【磐龙】1回合'],
      [28, 40, '【践踏】、登场：全体践踏友军获得【磐龙】1回合'],
      [32, 42, '【践踏】、登场：全体践踏友军获得【磐龙】1回合'],
      [35, 45, '【践踏】、登场：全体践踏友军获得【磐龙】1回合']
    ]
  },
  {
    name: '邪鬼草人',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/xieguicaoren.jpg', import.meta.url),
    data: [
      [0, 22, '登场：敌方玩家弃掉一张牌、回合结束：若敌方没有手牌，自身攻击+7'],
      [0, 25, '登场：敌方玩家弃掉一张牌、回合结束：若敌方没有手牌，自身攻击+8'],
      [0, 30, '登场：敌方玩家弃掉一张牌、回合结束：若敌方没有手牌，自身攻击+9'],
      [0, 36, '登场：敌方玩家弃掉一张牌、回合结束：若敌方没有手牌，自身攻击+10'],
      [0, 40, '登场：敌方玩家弃掉一张牌、回合结束：若敌方没有手牌，自身攻击+12'],
      [0, 45, '登场：敌方玩家弃掉一张牌、回合结束：若敌方没有手牌，自身攻击+13'],
      [0, 50, '登场：敌方玩家弃掉一张牌、回合结束：若敌方没有手牌，自身攻击+15'],
      [0, 55, '登场：敌方玩家弃掉一张牌、回合结束：若敌方没有手牌，自身攻击+17'],
      [0, 60, '登场：敌方玩家弃掉一张牌、回合结束：若敌方没有手牌，自身攻击+20']
    ]
  },
  {
    name: '无面屠夫',
    quality: '蓝',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/wumiantufu.jpg', import.meta.url),
    data: [
      [9, 25, '登场:横排所有敌军受到9点伤害'],
      [9, 30, '登场:横排所有敌军受到9点伤害'],
      [10, 33, '登场:横排所有敌军受到10点伤害'],
      [10, 40, '登场:横排所有敌军受到10点伤害'],
      [11, 45, '登场:横排所有敌军受到11点伤害'],
      [12, 52, '登场:横排所有敌军受到12点伤害'],
      [13, 59, '登场:横排所有敌军受到13点伤害'],
      [15, 64, '登场:横排所有敌军受到15点伤害'],
      [17, 70, '登场:横排所有敌军受到17点伤害']
    ]
  },
  {
    name: '传记·火弹',
    quality: '蓝',
    cost: 1,
    type: 3,
    img: new URL('@/assets/zhongzu/lianyushenyuan/zhuanji_huodan.jpg', import.meta.url),
    data: [
      [0, 0, '向敌方横排投射12点伤害，获得【传记·炎弹】'],
      [0, 0, '向敌方横排投射13点伤害，获得【传记·炎弹】'],
      [0, 0, '向敌方横排投射14点伤害，获得【传记·炎弹】'],
      [0, 0, '向敌方横排投射15点伤害，获得【传记·炎弹】'],
      [0, 0, '向敌方横排投射16点伤害，获得【传记·炎弹】'],
      [0, 0, '向敌方横排投射18点伤害，获得【传记·炎弹】'],
      [0, 0, '向敌方横排投射20点伤害，获得【传记·炎弹】'],
      [0, 0, '向敌方横排投射22点伤害，获得【传记·炎弹】'],
      [0, 0, '向敌方横排投射24点伤害，获得【传记·炎弹】']
    ]
  },
  {
    name: '传记·炎弹',
    quality: '蓝',
    cost: 1,
    type: 3,
    img: new URL('@/assets/zhongzu/lianyushenyuan/zhuanji_yandan.jpg', import.meta.url),
    data: [
      [0, 0, '向敌方横排投射12点伤害'],
      [0, 0, '向敌方横排投射13点伤害'],
      [0, 0, '向敌方横排投射14点伤害'],
      [0, 0, '向敌方横排投射15点伤害'],
      [0, 0, '向敌方横排投射16点伤害'],
      [0, 0, '向敌方横排投射18点伤害'],
      [0, 0, '向敌方横排投射20点伤害'],
      [0, 0, '向敌方横排投射22点伤害'],
      [0, 0, '向敌方横排投射24点伤害']
    ]
  },
  {
    name: '碎颅魔',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/suilumo.jpg', import.meta.url),
    data: [
      [13, 18, '【践踏】、登场:英雄生命-12'],
      [15, 19, '【践踏】、登场:英雄生命-13'],
      [16, 22, '【践踏】、登场:英雄生命-14'],
      [18, 25, '【践踏】、登场:英雄生命-15'],
      [21, 28, '【践踏】、登场:英雄生命-16'],
      [23, 31, '【践踏】、登场:英雄生命-17'],
      [25, 34, '【践踏】、登场:英雄生命-18'],
      [27, 39, '【践踏】、登场:英雄生命-19'],
      [30, 42, '【践踏】、登场:英雄生命-20']
    ]
  },
  {
    name: '觅食大嘴兽',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/mishidazuishou.jpg', import.meta.url),
    data: [
      [8, 22, '【践踏】、敌方英雄受到伤害自身+1/+1'],
      [9, 25, '【践踏】、敌方英雄受到伤害自身+1/+1'],
      [10, 28, '【践踏】、敌方英雄受到伤害自身+1/+1'],
      [12, 30, '【践踏】、敌方英雄受到伤害自身+1/+1'],
      [13, 33, '【践踏】、敌方英雄受到伤害自身+1/+1'],
      [15, 35, '【践踏】、敌方英雄受到伤害自身+1/+1'],
      [17, 37, '【践踏】、敌方英雄受到伤害自身+1/+1'],
      [18, 42, '【践踏】、敌方英雄受到伤害自身+1/+1'],
      [20, 45, '【践踏】、敌方英雄受到伤害自身+1/+1']
    ]
  },
  {
    name: '苦痛守望者',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/kutongshouwangzhe.jpg', import.meta.url),
    data: [
      [7, 17, '回合结束:自身+5/+5，敌方每有一张手牌，再-1/-1'],
      [8, 19, '回合结束:自身+5/+5，敌方每有一张手牌，再-1/-1'],
      [8, 21, '回合结束:自身+6/+6，敌方每有一张手牌，再-1/-1'],
      [9, 24, '回合结束:自身+6/+6，敌方每有一张手牌，再-1/-1'],
      [10, 28, '回合结束:自身+6/+6，敌方每有一张手牌，再-1/-1'],
      [11, 30, '回合结束:自身+7/+7，敌方每有一张手牌，再-1/-1'],
      [13, 33, '回合结束:自身+7/+7，敌方每有一张手牌，再-1/-1'],
      [14, 36, '回合结束:自身+8/+8，敌方每有一张手牌，再-1/-1'],
      [16, 39, '回合结束:自身+8/+8，敌方每有一张手牌，再-1/-1']
    ]
  },
  {
    name: '渴血毒甲蝎',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/kexuedujiaxie.jpg', import.meta.url),
    data: [
      [9, 14, '【护甲4】、对英雄伤害+4、敌方英雄受到伤害时：自身生命+1'],
      [11, 14, '【护甲5】、对英雄伤害+4、敌方英雄受到伤害时：自身生命+1'],
      [13, 15, '【护甲5】、对英雄伤害+5、敌方英雄受到伤害时：自身生命+1'],
      [15, 16, '【护甲6】、对英雄伤害+5、敌方英雄受到伤害时：自身生命+1'],
      [16, 19, '【护甲6】、对英雄伤害+6、敌方英雄受到伤害时：自身生命+1'],
      [18, 21, '【护甲7】、对英雄伤害+6、敌方英雄受到伤害时：自身生命+1'],
      [20, 22, '【护甲7】、对英雄伤害+7、敌方英雄受到伤害时：自身生命+2'],
      [22, 24, '【护甲8】、对英雄伤害+7、敌方英雄受到伤害时：自身生命+2'],
      [24, 28, '【护甲8】、对英雄伤害+8、敌方英雄受到伤害时：自身生命+2']
    ]
  },
  {
    name: '狱铠战魂',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/yukaizhanhun.jpg', import.meta.url),
    data: [
      [10, 4, '【洞察1】、【护甲14】'],
      [11, 4, '【洞察1】、【护甲16】'],
      [12, 5, '【洞察1】、【护甲18】'],
      [13, 6, '【洞察1】、【护甲20】'],
      [15, 7, '【洞察1】、【护甲22】'],
      [17, 8, '【洞察1】、【护甲24】'],
      [20, 8, '【洞察1】、【护甲26】'],
      [22, 9, '【洞察1】、【护甲28】'],
      [24, 10, '【洞察1】、【护甲30】']
    ]
  },
  {
    name: '绝望镰魔',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/juewanglianmo.jpg', import.meta.url),
    data: [
      [16, 18, '双方玩家无法获得生命、攻击前:若你无手牌，自身+4/+4'],
      [18, 20, '双方玩家无法获得生命、攻击前:若你无手牌，自身+4/+4'],
      [20, 20, '双方玩家无法获得生命、攻击前:若你无手牌，自身+5/+5'],
      [23, 23, '双方玩家无法获得生命、攻击前:若你无手牌，自身+5/+5'],
      [25, 25, '双方玩家无法获得生命、攻击前:若你无手牌，自身+6/+6'],
      [28, 27, '双方玩家无法获得生命、攻击前:若你无手牌，自身+6/+6'],
      [30, 30, '双方玩家无法获得生命、攻击前:若你无手牌，自身+7/+7'],
      [33, 33, '双方玩家无法获得生命、攻击前:若你无手牌，自身+7/+7'],
      [35, 35, '双方玩家无法获得生命、攻击前:若你无手牌，自身+8/+8']
    ]
  },
  {
    name: '岩浆球',
    quality: '紫',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/lianyushenyuan/yanjiangqiu.jpg', import.meta.url),
    data: [
      [0, 0, '回合开始阶段，敌方禁疗1回合、向敌方横排，投射40点伤害'],
      [0, 0, '回合开始阶段，敌方禁疗1回合、向敌方横排，投射44点伤害'],
      [0, 0, '回合开始阶段，敌方禁疗1回合、向敌方横排，投射48点伤害'],
      [0, 0, '回合开始阶段，敌方禁疗1回合、向敌方横排，投射52点伤害'],
      [0, 0, '回合开始阶段，敌方禁疗1回合、向敌方横排，投射56点伤害'],
      [0, 0, '回合开始阶段，敌方禁疗1回合、向敌方横排，投射60点伤害'],
      [0, 0, '回合开始阶段，敌方禁疗1回合、向敌方横排，投射65点伤害'],
      [0, 0, '回合开始阶段，敌方禁疗1回合、向敌方横排，投射69点伤害'],
      [0, 0, '回合开始阶段，敌方禁疗1回合、向敌方横排，投射73点伤害']
    ]
  },
  {
    name: '铸甲熔岩魔',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/zhujiarongyanmo.jpg', import.meta.url),
    data: [
      [13, 19, '【护甲5】、回合开始：全体有践踏的友军+2/+4，获得【护甲1】'],
      [15, 22, '【护甲6】、回合开始：全体有践踏的友军+2/+4，获得【护甲1】'],
      [17, 23, '【护甲6】、回合开始：全体有践踏的友军+2/+4，获得【护甲2】'],
      [19, 25, '【护甲6】、回合开始：全体有践踏的友军+2/+5，获得【护甲2】'],
      [21, 29, '【护甲7】、回合开始：全体有践踏的友军+2/+5，获得【护甲2】'],
      [23, 32, '【护甲7】、回合开始：全体有践踏的友军+3/+5，获得【护甲2】'],
      [25, 35, '【护甲8】、回合开始：全体有践踏的友军+3/+5，获得【护甲2】'],
      [27, 37, '【护甲9】、回合开始：全体有践踏的友军+3/+6，获得【护甲2】'],
      [30, 40, '【护甲10】、回合开始：全体有践踏的友军+3/+6，获得【护甲2】']
    ]
  },
  {
    name: '爆燃突袭',
    quality: '紫',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/lianyushenyuan/baorantuxi.jpg', import.meta.url),
    data: [
      [0, 0, '全体敌军和玩家受到3点伤害，召唤爆燃邪鬼-lv12'],
      [0, 0, '全体敌军和玩家受到3点伤害，召唤爆燃邪鬼-lv13'],
      [0, 0, '全体敌军和玩家受到3点伤害，召唤爆燃邪鬼-lv14'],
      [0, 0, '全体敌军和玩家受到4点伤害，召唤爆燃邪鬼-lv15'],
      [0, 0, '全体敌军和玩家受到4点伤害，召唤爆燃邪鬼-lv16'],
      [0, 0, '全体敌军和玩家受到4点伤害，召唤爆燃邪鬼-lv17'],
      [0, 0, '全体敌军和玩家受到4点伤害，召唤爆燃邪鬼-lv18'],
      [0, 0, '全体敌军和玩家受到4点伤害，召唤爆燃邪鬼-lv19'],
      [0, 0, '全体敌军和玩家受到5点伤害，召唤爆燃邪鬼-lv20']
    ]
  },
  {
    name: '魔鬼盛宴',
    quality: '紫',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/lianyushenyuan/moguishengyan.jpg', import.meta.url),
    data: [
      [0, 0, '回合结束:召唤3个红海使魔-lv10，你的英雄生命-10'],
      [0, 0, '回合结束:召唤3个红海使魔-lv11，你的英雄生命-11'],
      [0, 0, '回合结束:召唤3个红海使魔-lv12，你的英雄生命-12'],
      [0, 0, '回合结束:召唤3个红海使魔-lv13，你的英雄生命-13'],
      [0, 0, '回合结束:召唤3个红海使魔-lv14，你的英雄生命-13'],
      [0, 0, '回合结束:召唤3个红海使魔-lv15，你的英雄生命-13'],
      [0, 0, '回合结束:召唤3个红海使魔-lv16，你的英雄生命-13'],
      [0, 0, '回合结束:召唤3个红海使魔-lv17，你的英雄生命-13'],
      [0, 0, '回合结束:召唤3个红海使魔-lv18，你的英雄生命-13']
    ]
  },
  {
    name: '血炎鬼魅',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/xueyanguimei.jpg', import.meta.url),
    data: [
      [15, 12, '回合结束:对手弃掉一张牌，若其无手牌，则敌军受到15点伤害'],
      [16, 14, '回合结束:对手弃掉一张牌，若其无手牌，则敌军受到16点伤害'],
      [18, 15, '回合结束:对手弃掉一张牌，若其无手牌，则敌军受到18点伤害'],
      [20, 16, '回合结束:对手弃掉一张牌，若其无手牌，则敌军受到20点伤害'],
      [22, 18, '回合结束:对手弃掉一张牌，若其无手牌，则敌军受到22点伤害'],
      [25, 19, '回合结束:对手弃掉一张牌，若其无手牌，则敌军受到25点伤害'],
      [28, 20, '回合结束:对手弃掉一张牌，若其无手牌，则敌军受到28点伤害'],
      [30, 22, '回合结束:对手弃掉一张牌，若其无手牌，则敌军受到30点伤害'],
      [33, 23, '回合结束:对手弃掉一张牌，若其无手牌，则敌军受到33点伤害']
    ]
  },
  {
    name: '嗜血破面',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/shixuepomian.jpg', import.meta.url),
    data: [
      [18, 18, '【践踏】、命中英雄:自身+3/+3'],
      [20, 20, '【践踏】、命中英雄:自身+3/+3'],
      [22, 22, '【践踏】、命中英雄:自身+4/+4'],
      [25, 25, '【践踏】、命中英雄:自身+4/+4'],
      [28, 28, '【践踏】、命中英雄:自身+4/+4'],
      [31, 31, '【践踏】、命中英雄:自身+4/+4'],
      [33, 33, '【践踏】、命中英雄:自身+5/+5'],
      [36, 36, '【践踏】、命中英雄:自身+5/+5'],
      [40, 40, '【践踏】、命中英雄:自身+5/+5']
    ]
  },
  {
    name: '夺魂诅咒',
    quality: '紫',
    cost: 4,
    type: 2,
    img: new URL('@/assets/zhongzu/lianyushenyuan/duohunzuzhou.jpg', import.meta.url),
    data: [
      [0, 0, '随机敌军受到21点伤害，对手弃掉1张牌，若无手牌，英雄也收到伤害'],
      [0, 0, '随机敌军受到24点伤害，对手弃掉1张牌，若无手牌，英雄也收到伤害'],
      [0, 0, '随机敌军受到27点伤害，对手弃掉1张牌，若无手牌，英雄也收到伤害'],
      [0, 0, '随机敌军受到30点伤害，对手弃掉1张牌，若无手牌，英雄也收到伤害'],
      [0, 0, '随机敌军受到33点伤害，对手弃掉1张牌，若无手牌，英雄也收到伤害'],
      [0, 0, '随机敌军受到36点伤害，对手弃掉1张牌，若无手牌，英雄也收到伤害'],
      [0, 0, '随机敌军受到40点伤害，对手弃掉1张牌，若无手牌，英雄也收到伤害'],
      [0, 0, '随机敌军受到44点伤害，对手弃掉1张牌，若无手牌，英雄也收到伤害'],
      [0, 0, '随机敌军受到48点伤害，对手弃掉1张牌，若无手牌，英雄也收到伤害']
    ]
  },
  {
    name: '鲜血督军',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/xianxuedujun.jpg', import.meta.url),
    data: [
      [20, 10, '登场:相邻随机一个友军，攻击加倍！(帝国、禅意友军无效)'],
      [22, 11, '登场:相邻随机一个友军，攻击加倍！(帝国、禅意友军无效)'],
      [25, 12, '登场:相邻随机一个友军，攻击加倍！(帝国、禅意友军无效)'],
      [28, 14, '登场:相邻随机一个友军，攻击加倍！(帝国、禅意友军无效)'],
      [30, 18, '登场:相邻随机一个友军，攻击加倍！(帝国、禅意友军无效)'],
      [33, 21, '登场:相邻随机一个友军，攻击加倍！(帝国、禅意友军无效)'],
      [36, 24, '登场:相邻随机一个友军，攻击加倍！(帝国、禅意友军无效)'],
      [40, 27, '登场:相邻随机一个友军，攻击加倍！(帝国、禅意友军无效)'],
      [45, 30, '登场:相邻随机一个友军，攻击加倍！(帝国、禅意友军无效)']
    ]
  },
  {
    name: '熔岩术士',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/rongyanshushi.jpg', import.meta.url),
    data: [
      [12, 16, '回合开始:向对面横排投射火球(12点伤害)'],
      [13, 19, '回合开始:向对面横排投射火球(13点伤害)'],
      [15, 20, '回合开始:向对面横排投射火球(15点伤害)'],
      [17, 21, '回合开始:向对面横排投射火球(17点伤害)'],
      [19, 22, '回合开始:向对面横排投射火球(19点伤害)'],
      [22, 22, '回合开始:向对面横排投射火球(22点伤害)'],
      [25, 23, '回合开始:向对面横排投射火球(25点伤害)'],
      [28, 24, '回合开始:向对面横排投射火球(28点伤害)'],
      [32, 25, '回合开始:向对面横排投射火球(32点伤害)']
    ]
  },
  {
    name: '灼神双炎',
    quality: '紫',
    cost: 4,
    type: 2,
    img: new URL('@/assets/zhongzu/lianyushenyuan/zhuoshenshuangyan.jpg', import.meta.url),
    data: [
      [0, 0, '向敌方横排投射16点伤害，两次（无视【神佑】和【魔免】）'],
      [0, 0, '向敌方横排投射19点伤害，两次（无视【神佑】和【魔免】）'],
      [0, 0, '向敌方横排投射22点伤害，两次（无视【神佑】和【魔免】）'],
      [0, 0, '向敌方横排投射25点伤害，两次（无视【神佑】和【魔免】）'],
      [0, 0, '向敌方横排投射28点伤害，两次（无视【神佑】和【魔免】）'],
      [0, 0, '向敌方横排投射31点伤害，两次（无视【神佑】和【魔免】）'],
      [0, 0, '向敌方横排投射35点伤害，两次（无视【神佑】和【魔免】）'],
      [0, 0, '向敌方横排投射38点伤害，两次（无视【神佑】和【魔免】）'],
      [0, 0, '向敌方横排投射42点伤害，两次（无视【神佑】和【魔免】）']
    ]
  },
  {
    name: '地狱屠夫',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/diyutufu.jpg', import.meta.url),
    data: [
      [15, 25, '登场:随机消灭一个敌军、死亡:对手抓一张牌'],
      [16, 30, '登场:随机消灭一个敌军、死亡:对手抓一张牌'],
      [18, 33, '登场:随机消灭一个敌军、死亡:对手抓一张牌'],
      [20, 36, '登场:随机消灭一个敌军、死亡:对手抓一张牌'],
      [22, 40, '登场:随机消灭一个敌军、死亡:对手抓一张牌'],
      [25, 45, '登场:随机消灭一个敌军、死亡:对手抓一张牌'],
      [28, 50, '登场:随机消灭一个敌军、死亡:对手抓一张牌'],
      [32, 55, '登场:随机消灭一个敌军、死亡:对手抓一张牌'],
      [36, 60, '登场:随机消灭一个敌军、死亡:对手抓一张牌']
    ]
  },
  {
    name: '地狱三头犬',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/diyusantouquan.jpg', import.meta.url),
    data: [
      [10, 32, '【洞察2】、【三连击】'],
      [11, 35, '【洞察2】、【三连击】'],
      [12, 38, '【洞察2】、【三连击】'],
      [13, 42, '【洞察2】、【三连击】'],
      [15, 45, '【洞察2】、【三连击】'],
      [17, 49, '【洞察2】、【三连击】'],
      [19, 55, '【洞察2】、【三连击】'],
      [21, 60, '【洞察2】、【三连击】'],
      [24, 64, '【洞察2】、【三连击】']
    ]
  },
  {
    name: '噬心魔虫',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/shixinmochong.jpg', import.meta.url),
    data: [
      [16, 36, '【践踏】、命中时:对手弃掉一张牌、攻击前:若其无手牌则自身+6/+6'],
      [18, 39, '【践踏】、命中时:对手弃掉一张牌、攻击前:若其无手牌则自身+6/+6'],
      [20, 42, '【践踏】、命中时:对手弃掉一张牌、攻击前:若其无手牌则自身+7/+7'],
      [23, 45, '【践踏】、命中时:对手弃掉一张牌、攻击前:若其无手牌则自身+7/+7'],
      [25, 49, '【践踏】、命中时:对手弃掉一张牌、攻击前:若其无手牌则自身+7/+7'],
      [28, 54, '【践踏】、命中时:对手弃掉一张牌、攻击前:若其无手牌则自身+8/+8'],
      [32, 58, '【践踏】、命中时:对手弃掉一张牌、攻击前:若其无手牌则自身+8/+8'],
      [36, 63, '【践踏】、命中时:对手弃掉一张牌、攻击前:若其无手牌则自身+9/+9'],
      [40, 68, '【践踏】、命中时:对手弃掉一张牌、攻击前:若其无手牌则自身+9/+9']
    ]
  },
  {
    name: '雷光炼狱',
    quality: '紫',
    cost: 5,
    type: 2,
    img: new URL('@/assets/zhongzu/lianyushenyuan/leiguanglianyu.jpg', import.meta.url),
    data: [
      [0, 0, '对横排所有敌军造成25点伤害，对敌方英雄造成25点伤害'],
      [0, 0, '对横排所有敌军造成25点伤害，对敌方英雄造成30点伤害'],
      [0, 0, '对横排所有敌军造成30点伤害，对敌方英雄造成30点伤害'],
      [0, 0, '对横排所有敌军造成33点伤害，对敌方英雄造成33点伤害'],
      [0, 0, '对横排所有敌军造成36点伤害，对敌方英雄造成36点伤害'],
      [0, 0, '对横排所有敌军造成40点伤害，对敌方英雄造成40点伤害'],
      [0, 0, '对横排所有敌军造成45点伤害，对敌方英雄造成45点伤害'],
      [0, 0, '对横排所有敌军造成50点伤害，对敌方英雄造成50点伤害'],
      [0, 0, '对横排所有敌军造成55点伤害，对敌方英雄造成55点伤害']
    ]
  },
  {
    name: '夺魂死镰',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/duohunsilian.jpg', import.meta.url),
    data: [
      [25, 9, '敌方英雄受到伤害:自身攻击+5、攻击大于50、100获得【连击】'],
      [29, 10, '敌方英雄受到伤害:自身攻击+5、攻击大于50、100获得【连击】'],
      [30, 11, '敌方英雄受到伤害:自身攻击+6、攻击大于50、100获得【连击】'],
      [36, 13, '敌方英雄受到伤害:自身攻击+6、攻击大于50、100获得【连击】'],
      [40, 16, '敌方英雄受到伤害:自身攻击+6、攻击大于50、100获得【连击】'],
      [42, 20, '敌方英雄受到伤害:自身攻击+7、攻击大于50、100获得【连击】'],
      [48, 22, '敌方英雄受到伤害:自身攻击+7、攻击大于50、100获得【连击】'],
      [52, 24, '敌方英雄受到伤害:自身攻击+8、攻击大于50、100获得【连击】'],
      [60, 25, '敌方英雄受到伤害:自身攻击+8、攻击大于50、100获得【连击】']
    ]
  },
  {
    name: '狂暴铁臂',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/kuangbaotiebi.jpg', import.meta.url),
    data: [
      [25, 24, '【护甲3】、攻击前:全体护甲友军+2/+2、登场回合具有【磐龙】和【魂歌】'],
      [27, 25, '【护甲3】、攻击前:全体护甲友军+3/+2、登场回合具有【磐龙】和【魂歌】'],
      [29, 29, '【护甲3】、攻击前:全体护甲友军+3/+2、登场回合具有【磐龙】和【魂歌】'],
      [31, 31, '【护甲3】、攻击前:全体护甲友军+3/+3、登场回合具有【磐龙】和【魂歌】'],
      [34, 34, '【护甲4】、攻击前:全体护甲友军+3/+3、登场回合具有【磐龙】和【魂歌】'],
      [36, 36, '【护甲4】、攻击前:全体护甲友军+4/+4、登场回合具有【磐龙】和【魂歌】'],
      [40, 40, '【护甲5】、攻击前:全体护甲友军+4/+4、登场回合具有【磐龙】和【魂歌】'],
      [43, 43, '【护甲5】、攻击前:全体护甲友军+5/+5、登场回合具有【磐龙】和【魂歌】'],
      [48, 48, '【护甲6】、攻击前:全体护甲友军+5/+5、登场回合具有【磐龙】和【魂歌】']
    ]
  },
  {
    name: '魔岩邪牛',
    quality: '紫',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/moyanxieniu.jpg', import.meta.url),
    data: [
      [23, 23, '登场:随机敌军生命-13、攻击前:若你无手牌，随机敌军生命-13'],
      [25, 25, '登场:随机敌军生命-15、攻击前:若你无手牌，随机敌军生命-15'],
      [28, 28, '登场:随机敌军生命-16、攻击前:若你无手牌，随机敌军生命-16'],
      [30, 30, '登场:随机敌军生命-18、攻击前:若你无手牌，随机敌军生命-18'],
      [33, 33, '登场:随机敌军生命-20、攻击前:若你无手牌，随机敌军生命-20'],
      [36, 36, '登场:随机敌军生命-23、攻击前:若你无手牌，随机敌军生命-23'],
      [40, 40, '登场:随机敌军生命-26、攻击前:若你无手牌，随机敌军生命-26'],
      [45, 45, '登场:随机敌军生命-29、攻击前:若你无手牌，随机敌军生命-29'],
      [50, 50, '登场:随机敌军生命-32、攻击前:若你无手牌，随机敌军生命-32']
    ]
  },
  {
    name: '黑岩裂缝',
    quality: '紫',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/heiyanliefeng.jpg', import.meta.url),
    data: [
      [0, 66, '登场、回合结束:召唤5/4猩红仆从-lv8、若你无手牌，改为召唤10/5猩红勇士-lv8'],
      [0, 73, '登场、回合结束:召唤5/6猩红仆从-lv9、若你无手牌，改为召唤11/5猩红勇士-lv9'],
      [0, 77, '登场、回合结束:召唤6/6猩红仆从-lv10、若你无手牌，改为召唤13/5猩红勇士-lv10'],
      [0, 85, '登场、回合结束:召唤7/7猩红仆从-lv11、若你无手牌，改为召唤14/6猩红勇士-lv11'],
      [0, 90, '登场、回合结束:召唤8/8猩红仆从-lv12、若你无手牌，改为召唤16/6猩红勇士-lv12'],
      [0, 96, '登场、回合结束:召唤9/9猩红仆从-lv13、若你无手牌，改为召唤18/6猩红勇士-lv13'],
      [0, 103, '登场、回合结束:召唤10/10猩红仆从-lv14、若你无手牌，改为召唤20/7猩红勇士-lv14'],
      [0, 113, '登场、回合结束:召唤11/11猩红仆从-lv15、若你无手牌，改为召唤22/9猩红勇士-lv15'],
      [0, 129, '登场、回合结束:召唤12/12猩红仆从-lv16、若你无手牌，改为召唤25/7猩红勇士-lv16']
    ]
  },
  {
    name: '恶灵魔焰',
    quality: '紫',
    cost: 6,
    type: 2,
    img: new URL('@/assets/zhongzu/lianyushenyuan/elingmoyan.jpg', import.meta.url),
    data: [
      [0, 0, '目标区域坠落50点伤害，若你无手牌，则坠落65点伤害'],
      [0, 0, '目标区域坠落55点伤害，若你无手牌，则坠落70点伤害'],
      [0, 0, '目标区域坠落60点伤害，若你无手牌，则坠落75点伤害'],
      [0, 0, '目标区域坠落65点伤害，若你无手牌，则坠落80点伤害'],
      [0, 0, '目标区域坠落70点伤害，若你无手牌，则坠落85点伤害'],
      [0, 0, '目标区域坠落75点伤害，若你无手牌，则坠落90点伤害'],
      [0, 0, '目标区域坠落80点伤害，若你无手牌，则坠落95点伤害'],
      [0, 0, '目标区域坠落84点伤害，若你无手牌，则坠落100点伤害'],
      [0, 0, '目标区域坠落88点伤害，若你无手牌，则坠落105点伤害']
    ]
  },
  {
    name: '蛮荒魔神',
    quality: '紫',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/manhuangmoshen.jpg', import.meta.url),
    data: [
      [27, 27, '【磐龙】、【践踏】、登场：其他有践踏的友军+8/+8，获得【磐龙】'],
      [31, 31, '【磐龙】、【践踏】、登场：其他有践踏的友军+8/+8，获得【磐龙】'],
      [34, 34, '【磐龙】、【践踏】、登场：其他有践踏的友军+9/+9，获得【磐龙】'],
      [37, 37, '【磐龙】、【践踏】、登场：其他有践踏的友军+10/+10，获得【磐龙】'],
      [42, 42, '【磐龙】、【践踏】、登场：其他有践踏的友军+10/+10，获得【磐龙】'],
      [48, 48, '【磐龙】、【践踏】、登场：其他有践踏的友军+11/+11，获得【磐龙】'],
      [55, 55, '【磐龙】、【践踏】、登场：其他有践踏的友军+12/+12，获得【磐龙】'],
      [63, 63, '【磐龙】、【践踏】、登场：其他有践踏的友军+13/+13，获得【磐龙】'],
      [70, 70, '【磐龙】、【践踏】、登场：其他有践踏的友军+15/+15，获得【磐龙】']
    ]
  },
  {
    name: '深渊剧毒兽',
    quality: '紫',
    cost: 7,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/shenyuanjudushou.jpg', import.meta.url),
    data: [
      [20, 54, '攻击前:对敌军喷射毒液6次(2点伤害)，若敌方无手牌，自身+5/+5'],
      [20, 55, '攻击前:对敌军喷射毒液6次(2点伤害)，若敌方无手牌，自身+6/+6'],
      [22, 60, '攻击前:对敌军喷射毒液6次(3点伤害)，若敌方无手牌，自身+6/+6'],
      [25, 65, '攻击前:对敌军喷射毒液6次(3点伤害)，若敌方无手牌，自身+7/+7'],
      [30, 70, '攻击前:对敌军喷射毒液6次(3点伤害)，若敌方无手牌，自身+7/+7'],
      [32, 75, '攻击前:对敌军喷射毒液6次(3点伤害)，若敌方无手牌，自身+8/+8'],
      [34, 80, '攻击前:对敌军喷射毒液6次(4点伤害)，若敌方无手牌，自身+8/+8'],
      [37, 85, '攻击前:对敌军喷射毒液6次(4点伤害)，若敌方无手牌，自身+9/+9'],
      [40, 90, '攻击前:对敌军喷射毒液6次(5点伤害)，若敌方无手牌，自身+9/+9']
    ]
  },
  {
    name: '地狱巨口',
    quality: '紫',
    cost: 7,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/diyujukou.jpg', import.meta.url),
    data: [
      [18, 45, '【磐龙】、【践踏】、登场:横排敌军受到13点伤害，每当一个敌军死亡:自身+4/+4'],
      [20, 50, '【磐龙】、【践踏】、登场:横排敌军受到13点伤害，每当一个敌军死亡:自身+5/+5'],
      [22, 55, '【磐龙】、【践踏】、登场:横排敌军受到15点伤害，每当一个敌军死亡:自身+5/+5'],
      [24, 60, '【磐龙】、【践踏】、登场:横排敌军受到15点伤害，每当一个敌军死亡:自身+6/+6'],
      [26, 66, '【磐龙】、【践踏】、登场:横排敌军受到16点伤害，每当一个敌军死亡:自身+6/+6'],
      [28, 73, '【磐龙】、【践踏】、登场:横排敌军受到17点伤害，每当一个敌军死亡:自身+7/+7'],
      [30, 80, '【磐龙】、【践踏】、登场:横排敌军受到20点伤害，每当一个敌军死亡:自身+7/+7'],
      [33, 90, '【磐龙】、【践踏】、登场:横排敌军受到22点伤害，每当一个敌军死亡:自身+8/+8'],
      [36, 100, '【磐龙】、【践踏】、登场:横排敌军受到25点伤害，每当一个敌军死亡:自身+8/+8']
    ]
  },
  {
    name: '传记·流星落',
    quality: '紫',
    cost: 1,
    type: 3,
    img: new URL('@/assets/zhongzu/lianyushenyuan/zhuanji_liuxingluo.jpg', import.meta.url),
    data: [
      [0, 0, '敌方随机区域坠落12点伤害，获得【传记·火尘落】'],
      [0, 0, '敌方随机区域坠落13点伤害，获得【传记·火尘落】'],
      [0, 0, '敌方随机区域坠落14点伤害，获得【传记·火尘落】'],
      [0, 0, '敌方随机区域坠落15点伤害，获得【传记·火尘落】'],
      [0, 0, '敌方随机区域坠落16点伤害，获得【传记·火尘落】'],
      [0, 0, '敌方随机区域坠落18点伤害，获得【传记·火尘落】'],
      [0, 0, '敌方随机区域坠落20点伤害，获得【传记·火尘落】'],
      [0, 0, '敌方随机区域坠落22点伤害，获得【传记·火尘落】'],
      [0, 0, '敌方随机区域坠落24点伤害，获得【传记·火尘落】']
    ]
  },
  {
    name: '传记·火尘落',
    quality: '紫',
    cost: 1,
    type: 3,
    img: new URL('@/assets/zhongzu/lianyushenyuan/zhuanji_huochenluo.jpg', import.meta.url),
    data: [
      [0, 0, '目标区域坠落12点伤害，获得【传记·流星火陨】'],
      [0, 0, '目标区域坠落13点伤害，获得【传记·流星火陨】'],
      [0, 0, '目标区域坠落14点伤害，获得【传记·流星火陨】'],
      [0, 0, '目标区域坠落15点伤害，获得【传记·流星火陨】'],
      [0, 0, '目标区域坠落16点伤害，获得【传记·流星火陨】'],
      [0, 0, '目标区域坠落18点伤害，获得【传记·流星火陨】'],
      [0, 0, '目标区域坠落20点伤害，获得【传记·流星火陨】'],
      [0, 0, '目标区域坠落22点伤害，获得【传记·流星火陨】'],
      [0, 0, '目标区域坠落24点伤害，获得【传记·流星火陨】']
    ]
  },
  {
    name: '传记·流星火陨',
    quality: '紫',
    cost: 3,
    type: 3,
    img: new URL('@/assets/zhongzu/lianyushenyuan/zhuanji_liuxinghuoyun.jpg', import.meta.url),
    data: [
      [0, 0, '目标及随机敌方区域各坠落12点伤害'],
      [0, 0, '目标及随机敌方区域各坠落13点伤害'],
      [0, 0, '目标及随机敌方区域各坠落14点伤害'],
      [0, 0, '目标及随机敌方区域各坠落15点伤害'],
      [0, 0, '目标及随机敌方区域各坠落16点伤害'],
      [0, 0, '目标及随机敌方区域各坠落18点伤害'],
      [0, 0, '目标及随机敌方区域各坠落20点伤害'],
      [0, 0, '目标及随机敌方区域各坠落22点伤害'],
      [0, 0, '目标及随机敌方区域各坠落24点伤害']
    ]
  },
  {
    name: '痛苦之心',
    quality: '橙',
    cost: 2,
    type: 2,
    img: new URL('@/assets/zhongzu/lianyushenyuan/tongkuzhixin.jpg', import.meta.url),
    data: [
      [0, 0, '对手弃掉一张牌，你获得《痛苦之心-lv12》、若其无手牌:改为召唤7/17苦痛守望者-lv12'],
      [0, 0, '对手弃掉一张牌，你获得《痛苦之心-lv13》、若其无手牌:改为召唤8/19苦痛守望者-lv13'],
      [0, 0, '对手弃掉一张牌，你获得《痛苦之心-lv14》、若其无手牌:改为召唤8/21苦痛守望者-lv14'],
      [0, 0, '对手弃掉一张牌，你获得《痛苦之心-lv15》、若其无手牌:改为召唤8/24苦痛守望者-lv15'],
      [0, 0, '对手弃掉一张牌，你获得《痛苦之心-lv16》、若其无手牌:改为召唤10/28苦痛守望者-lv16'],
      [0, 0, '对手弃掉一张牌，你获得《痛苦之心-lv17》、若其无手牌:改为召唤11/30苦痛守望者-lv17'],
      [0, 0, '对手弃掉一张牌，你获得《痛苦之心-lv18》、若其无手牌:改为召唤13/33苦痛守望者-lv18'],
      [0, 0, '对手弃掉一张牌，你获得《痛苦之心-lv19》、若其无手牌:改为召唤14/36苦痛守望者-lv19'],
      [0, 0, '对手弃掉一张牌，你获得《痛苦之心-lv20》、若其无手牌:改为召唤16/39苦痛守望者-lv20']
    ]
  },
  {
    name: '血影',
    quality: '橙',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/xueying.jpg', import.meta.url),
    data: [
      [20, 7, '敌方英雄受到伤害:随机敌军生命-2、死亡:回到手牌'],
      [22, 9, '敌方英雄受到伤害:随机敌军生命-2、死亡:回到手牌'],
      [24, 11, '敌方英雄受到伤害:随机敌军生命-2、死亡:回到手牌'],
      [25, 12, '敌方英雄受到伤害:随机敌军生命-3、死亡:回到手牌'],
      [28, 13, '敌方英雄受到伤害:随机敌军生命-3、死亡:回到手牌'],
      [33, 14, '敌方英雄受到伤害:随机敌军生命-3、死亡:回到手牌'],
      [39, 15, '敌方英雄受到伤害:随机敌军生命-3、死亡:回到手牌'],
      [45, 17, '敌方英雄受到伤害:随机敌军生命-3、死亡:回到手牌'],
      [49, 19, '敌方英雄受到伤害:随机敌军生命-4、死亡:回到手牌']
    ]
  },
  {
    name: '巴克&巴罗',
    quality: '橙',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/bakebaluo.jpg', import.meta.url),
    data: [
      [10, 27, '【连击】、【践踏】、【护甲4】、攻击前：全体敌军受到3点伤害'],
      [12, 29, '【连击】、【践踏】、【护甲4】、攻击前：全体敌军受到3点伤害'],
      [13, 32, '【连击】、【践踏】、【护甲4】、攻击前：全体敌军受到4点伤害'],
      [15, 35, '【连击】、【践踏】、【护甲5】、攻击前：全体敌军受到4点伤害'],
      [18, 36, '【连击】、【践踏】、【护甲5】、攻击前：全体敌军受到4点伤害'],
      [20, 40, '【连击】、【践踏】、【护甲5】、攻击前：全体敌军受到5点伤害'],
      [22, 42, '【连击】、【践踏】、【护甲6】、攻击前：全体敌军受到5点伤害'],
      [24, 46, '【连击】、【践踏】、【护甲6】、攻击前：全体敌军受到6点伤害'],
      [26, 50, '【连击】、【践踏】、【护甲6】、攻击前：全体敌军受到6点伤害']
    ]
  },
  {
    name: '怨魂饕餮兽',
    quality: '橙',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/yuanhuntaotieshou.jpg', import.meta.url),
    data: [
      [16, 30, '登场:吸取敌方玩家25点生命、死亡:归还敌方玩家25点生命'],
      [18, 32, '登场:吸取敌方玩家30点生命、死亡:归还敌方玩家30点生命'],
      [20, 35, '登场:吸取敌方玩家35点生命、死亡:归还敌方玩家35点生命'],
      [22, 40, '登场:吸取敌方玩家40点生命、死亡:归还敌方玩家40点生命'],
      [24, 45, '登场:吸取敌方玩家45点生命、死亡:归还敌方玩家45点生命'],
      [27, 52, '登场:吸取敌方玩家52点生命、死亡:归还敌方玩家52点生命'],
      [30, 60, '登场:吸取敌方玩家60点生命、死亡:归还敌方玩家60点生命'],
      [33, 66, '登场:吸取敌方玩家66点生命、死亡:归还敌方玩家66点生命'],
      [37, 73, '登场:吸取敌方玩家73点生命、死亡:归还敌方玩家73点生命']
    ]
  },
  {
    name: '血翼·莉莉斯',
    quality: '橙',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/xueyi_lilisi.jpg', import.meta.url),
    data: [
      [29, 19, '【先攻】、回合开始:若你无手牌，消灭随机敌军，英雄生命-4'],
      [32, 22, '【先攻】、回合开始:若你无手牌，消灭随机敌军，英雄生命-5'],
      [35, 25, '【先攻】、回合开始:若你无手牌，消灭随机敌军，英雄生命-5'],
      [39, 29, '【先攻】、回合开始:若你无手牌，消灭随机敌军，英雄生命-5'],
      [45, 30, '【先攻】、回合开始:若你无手牌，消灭随机敌军，英雄生命-6'],
      [50, 33, '【先攻】、回合开始:若你无手牌，消灭随机敌军，英雄生命-6'],
      [60, 35, '【先攻】、回合开始:若你无手牌，消灭随机敌军，英雄生命-7'],
      [66, 38, '【先攻】、回合开始:若你无手牌，消灭随机敌军，英雄生命-7'],
      [75, 40, '【先攻】、回合开始:若你无手牌，消灭随机敌军，英雄生命-8']
    ]
  },
  {
    name: '熔炉梦魇',
    quality: '橙',
    cost: 7,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/ronglumengyan.jpg', import.meta.url),
    data: [
      [23, 13, '登场:敌方玩家弃掉3张牌、回合结束:若敌方没有手牌，召唤熔炉尸嵌-lv12'],
      [25, 15, '登场:敌方玩家弃掉3张牌、回合结束:若敌方没有手牌，召唤熔炉尸嵌-lv13'],
      [27, 17, '登场:敌方玩家弃掉3张牌、回合结束:若敌方没有手牌，召唤熔炉尸嵌-lv14'],
      [30, 19, '登场:敌方玩家弃掉3张牌、回合结束:若敌方没有手牌，召唤熔炉尸嵌-lv15'],
      [33, 22, '登场:敌方玩家弃掉3张牌、回合结束:若敌方没有手牌，召唤熔炉尸嵌-lv16'],
      [38, 25, '登场:敌方玩家弃掉4张牌、回合结束:若敌方没有手牌，召唤熔炉尸嵌-lv17'],
      [45, 30, '登场:敌方玩家弃掉4张牌、回合结束:若敌方没有手牌，召唤熔炉尸嵌-lv18'],
      [52, 35, '登场:敌方玩家弃掉4张牌、回合结束:若敌方没有手牌，召唤熔炉尸嵌-lv19'],
      [60, 40, '登场:敌方玩家弃掉4张牌、回合结束:若敌方没有手牌，召唤熔炉尸嵌-lv20']
    ]
  },
  {
    name: '烬喉地狱魔',
    quality: '橙',
    cost: 8,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/jinhoudiyumo.jpg', import.meta.url),
    data: [
      [25, 72, '回合开始、攻击前、回合结束:随机敌军生命-9，否则敌方英雄生命-9'],
      [27, 75, '回合开始、攻击前、回合结束:随机敌军生命-10，否则敌方英雄生命-10'],
      [29, 80, '回合开始、攻击前、回合结束:随机敌军生命-11，否则敌方英雄生命-11'],
      [30, 90, '回合开始、攻击前、回合结束:随机敌军生命-12，否则敌方英雄生命-12'],
      [33, 99, '回合开始、攻击前、回合结束:随机敌军生命-13，否则敌方英雄生命-13'],
      [36, 108, '回合开始、攻击前、回合结束:随机敌军生命-14，否则敌方英雄生命-14'],
      [40, 120, '回合开始、攻击前、回合结束:随机敌军生命-15，否则敌方英雄生命-15'],
      [45, 135, '回合开始、攻击前、回合结束:随机敌军生命-16，否则敌方英雄生命-16'],
      [50, 150, '回合开始、攻击前、回合结束:随机敌军生命-18，否则敌方英雄生命-18']
    ]
  },
  {
    name: '猩红领主·巴拉克',
    quality: '橙',
    cost: 9,
    type: 1,
    img: new URL('@/assets/zhongzu/lianyushenyuan/xinghonglingzhu_balake.jpg', import.meta.url),
    data: [
      [36, 36, '【践踏】、登场:召唤四个5/4猩红仆从-lv8、攻击前:所有其他友军攻击+6'],
      [38, 38, '【践踏】、登场:召唤四个5/6猩红仆从-lv9、攻击前:所有其他友军攻击+6'],
      [40, 40, '【践踏】、登场:召唤四个5/6猩红仆从-lv9、攻击前:所有其他友军攻击+7'],
      [45, 45, '【践踏】、登场:召唤四个6/6猩红仆从-lv10、攻击前:所有其他友军攻击+7'],
      [52, 52, '【践踏】、登场:召唤四个6/6猩红仆从-lv10、攻击前:所有其他友军攻击+8'],
      [60, 60, '【践踏】、登场:召唤四个7/7猩红仆从-lv11、攻击前:所有其他友军攻击+8'],
      [70, 70, '【践踏】、登场:召唤四个8/8猩红仆从-lv12、攻击前:所有其他友军攻击+9'],
      [80, 80, '【践踏】、登场:召唤四个9/9猩红仆从-lv13、攻击前:所有其他友军攻击+9'],
      [90, 90, '【践踏】、登场:召唤四个10/10猩红仆从-lv14、攻击前:所有其他友军攻击+10']
    ]
  }
];
