export default [
  {
    name: '草原狼',
    quality: '白',
    cost: 1,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/caoyuanlang.jpg', import.meta.url),
    data: [
      [9, 4, '/'],
      [10, 4, '/'],
      [11, 4, '/'],
      [12, 4, '/'],
      [14, 4, '/'],
      [15, 5, '/'],
      [17, 5, '/'],
      [19, 5, '/'],
      [20, 6, '/']
    ]
  },
  {
    name: '斑毛幼猪',
    quality: '白',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/banmaoyouzhu.jpg', import.meta.url),
    data: [
      [9, 9, '死亡:英雄生命+9'],
      [10, 10, '死亡:英雄生命+10'],
      [11, 11, '死亡:英雄生命+11'],
      [12, 12, '死亡:英雄生命+12'],
      [13, 13, '死亡:英雄生命+13'],
      [14, 15, '死亡:英雄生命+14'],
      [16, 16, '死亡:英雄生命+16'],
      [18, 18, '死亡:英雄生命+18'],
      [20, 20, '死亡:英雄生命+20']
    ]
  },
  {
    name: '蛮化术',
    quality: '白',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/manshikuangye/manhuashu.jpg', import.meta.url),
    data: [
      [0, 0, '目标单位+10/+10'],
      [0, 0, '目标单位+11/+11'],
      [0, 0, '目标单位+12/+12'],
      [0, 0, '目标单位+13/+13'],
      [0, 0, '目标单位+15/+15'],
      [0, 0, '目标单位+17/+17'],
      [0, 0, '目标单位+19/+19'],
      [0, 0, '目标单位+21/+21'],
      [0, 0, '目标单位+23/+23']
    ]
  },
  {
    name: '再生食人魔',
    quality: '白',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/zaishengshirenmo.jpg', import.meta.url),
    data: [
      [6, 20, '回合结束:若本回合受到过伤害，自身+4/+6'],
      [7, 21, '回合结束:若本回合受到过伤害，自身+4/+7'],
      [8, 22, '回合结束:若本回合受到过伤害，自身+4/+8'],
      [9, 24, '回合结束:若本回合受到过伤害，自身+4/+9'],
      [10, 25, '回合结束:若本回合受到过伤害，自身+5/+10'],
      [11, 27, '回合结束:若本回合受到过伤害，自身+5/+11'],
      [12, 30, '回合结束:若本回合受到过伤害，自身+5/+12'],
      [14, 33, '回合结束:若本回合受到过伤害，自身+5/+13'],
      [16, 36, '回合结束:若本回合受到过伤害，自身+5/+15']
    ]
  },
  {
    name: '长毛象',
    quality: '白',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/changmaoxiang.jpg', import.meta.url),
    data: [
      [18, 32, '/'],
      [20, 35, '/'],
      [22, 38, '/'],
      [24, 40, '/'],
      [25, 45, '/'],
      [27, 48, '/'],
      [30, 50, '/'],
      [33, 55, '/'],
      [36, 60, '/']
    ]
  },
  {
    name: '愚笨鲸头鹅',
    quality: '蓝',
    cost: 0,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/yubenjingtoue.jpg', import.meta.url),
    data: [
      [4, 11, '【洞察1】、【迟缓】、命中英雄:抓一张牌，并且【洞察1】'],
      [5, 12, '【洞察1】、【迟缓】、命中英雄:抓一张牌，并且【洞察1】'],
      [6, 13, '【洞察1】、【迟缓】、命中英雄:抓一张牌，并且【洞察1】'],
      [7, 15, '【洞察1】、【迟缓】、命中英雄:抓一张牌，并且【洞察1】'],
      [8, 18, '【洞察1】、【迟缓】、命中英雄:抓一张牌，并且【洞察1】'],
      [10, 19, '【洞察1】、【迟缓】、命中英雄:抓一张牌，并且【洞察1】'],
      [12, 20, '【洞察1】、【迟缓】、命中英雄:抓一张牌，并且【洞察1】'],
      [13, 22, '【洞察1】、【迟缓】、命中英雄:抓一张牌，并且【洞察1】'],
      [15, 23, '【洞察1】、【迟缓】、命中英雄:抓一张牌，并且【洞察1】']
    ]
  },
  {
    name: '蛮石血蜥',
    quality: '蓝',
    cost: 1,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/manshixuexi.jpg', import.meta.url),
    data: [
      [8, 8, '当己方英雄恢复生命时：自身攻击+5'],
      [9, 9, '当己方英雄恢复生命时：自身攻击+6'],
      [10, 10, '当己方英雄恢复生命时：自身攻击+6'],
      [11, 11, '当己方英雄恢复生命时：自身攻击+7'],
      [13, 12, '当己方英雄恢复生命时：自身攻击+7'],
      [14, 14, '当己方英雄恢复生命时：自身攻击+8'],
      [16, 15, '当己方英雄恢复生命时：自身攻击+8'],
      [18, 16, '当己方英雄恢复生命时：自身攻击+9'],
      [20, 18, '当己方英雄恢复生命时：自身攻击+10']
    ]
  },
  {
    name: '迟来的补给',
    quality: '蓝',
    cost: 1,
    type: 2,
    img: new URL('@/assets/zhongzu/manshikuangye/chilaidebuji.jpg', import.meta.url),
    data: [
      [0, 0, '目标友军+8/+8，若该生物具有迟缓，则获得【践踏】、抽一张牌'],
      [0, 0, '目标友军+9/+9，若该生物具有迟缓，则获得【践踏】、抽一张牌'],
      [0, 0, '目标友军+10/+10，若该生物具有迟缓，则获得【践踏】、抽一张牌'],
      [0, 0, '目标友军+11/+11，若该生物具有迟缓，则获得【践踏】、抽一张牌'],
      [0, 0, '目标友军+13/+12，若该生物具有迟缓，则获得【践踏】、抽一张牌'],
      [0, 0, '目标友军+14/+14，若该生物具有迟缓，则获得【践踏】、抽一张牌'],
      [0, 0, '目标友军+15/+16，若该生物具有迟缓，则获得【践踏】、抽一张牌'],
      [0, 0, '目标友军+17/+17，若该生物具有迟缓，则获得【践踏】、抽一张牌'],
      [0, 0, '目标友军+19/+19，若该生物具有迟缓，则获得【践踏】、抽一张牌']
    ]
  },
  {
    name: '旷野祭师',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/kuangyejishi.jpg', import.meta.url),
    data: [
      [3, 13, '【洞察1】、你得法力上限+1、洞察时:英雄生命+7'],
      [4, 14, '【洞察1】、你得法力上限+1、洞察时:英雄生命+8'],
      [4, 16, '【洞察1】、你得法力上限+1、洞察时:英雄生命+9'],
      [5, 17, '【洞察1】、你得法力上限+1、洞察时:英雄生命+10'],
      [6, 18, '【洞察1】、你得法力上限+1、洞察时:英雄生命+12'],
      [7, 19, '【洞察1】、你得法力上限+1、洞察时:英雄生命+13'],
      [8, 20, '【洞察1】、你得法力上限+1、洞察时:英雄生命+15'],
      [9, 22, '【洞察1】、你得法力上限+1、洞察时:英雄生命+16'],
      [10, 24, '【洞察1】、你得法力上限+1、洞察时:英雄生命+18']
    ]
  },
  {
    name: '蓄力射手',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/xulisheshou.jpg', import.meta.url),
    data: [
      [6, 17, '登场，回合结束:射击敌方英雄'],
      [7, 18, '登场，回合结束:射击敌方英雄'],
      [8, 20, '登场，回合结束:射击敌方英雄'],
      [9, 22, '登场，回合结束:射击敌方英雄'],
      [10, 25, '登场，回合结束:射击敌方英雄'],
      [12, 26, '登场，回合结束:射击敌方英雄'],
      [13, 30, '登场，回合结束:射击敌方英雄'],
      [15, 32, '登场，回合结束:射击敌方英雄'],
      [17, 35, '登场，回合结束:射击敌方英雄']
    ]
  },
  {
    name: '痴蛮野人',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/chimanyeren.jpg', import.meta.url),
    data: [
      [17, 17, '【迟缓】、洞察时:自身+3/+3'],
      [19, 19, '【迟缓】、洞察时:自身+3/+4'],
      [21, 21, '【迟缓】、洞察时:自身+3/+4'],
      [23, 23, '【迟缓】、洞察时:自身+4/+4'],
      [26, 26, '【迟缓】、洞察时:自身+4/+4'],
      [29, 29, '【迟缓】、洞察时:自身+5/+5'],
      [32, 32, '【迟缓】、洞察时:自身+5/+5'],
      [35, 35, '【迟缓】、洞察时:自身+6/+6'],
      [38, 38, '【迟缓】、洞察时:自身+6/+6']
    ]
  },
  {
    name: '贪食肥鼠',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/tanshifeishu.jpg', import.meta.url),
    data: [
      [6, 20, '当己方英雄恢复生命:自身+2/+5，魔防+2'],
      [7, 23, '当己方英雄恢复生命:自身+2/+5，魔防+2'],
      [8, 26, '当己方英雄恢复生命:自身+2/+6，魔防+2'],
      [9, 30, '当己方英雄恢复生命:自身+2/+6，魔防+3'],
      [10, 33, '当己方英雄恢复生命:自身+3/+6，魔防+3'],
      [11, 36, '当己方英雄恢复生命:自身+3/+7，魔防+3'],
      [12, 40, '当己方英雄恢复生命:自身+3/+7，魔防+4'],
      [14, 44, '当己方英雄恢复生命:自身+3/+9，魔防+4'],
      [16, 46, '当己方英雄恢复生命:自身+4/+10，魔防+4']
    ]
  },
  {
    name: '蛮石穿山甲',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/manshichuanshanshu.jpg', import.meta.url),
    data: [
      [8, 15, '【护甲3】、当己方英雄恢复生命:自身攻击+3，护甲+1'],
      [10, 16, '【护甲3】、当己方英雄恢复生命:自身攻击+4，护甲+1'],
      [12, 17, '【护甲4】、当己方英雄恢复生命:自身攻击+4，护甲+1'],
      [14, 18, '【护甲4】、当己方英雄恢复生命:自身攻击+5，护甲+1'],
      [15, 20, '【护甲5】、当己方英雄恢复生命:自身攻击+5，护甲+1'],
      [16, 22, '【护甲5】、当己方英雄恢复生命:自身攻击+5，护甲+2'],
      [18, 24, '【护甲5】、当己方英雄恢复生命:自身攻击+6，护甲+2'],
      [21, 25, '【护甲6】、当己方英雄恢复生命:自身攻击+6，护甲+3'],
      [24, 27, '【护甲6】、当己方英雄恢复生命:自身攻击+7，护甲+3']
    ]
  },
  {
    name: '势如破竹',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: new URL('@/assets/zhongzu/manshikuangye/shirupozhu.jpg', import.meta.url),
    data: [
      [0, 0, '目标单位+8/+14，并获得【践踏】'],
      [0, 0, '目标单位+9/+15，并获得【践踏】'],
      [0, 0, '目标单位+10/+16，并获得【践踏】'],
      [0, 0, '目标单位+12/+16，并获得【践踏】'],
      [0, 0, '目标单位+15/+17，并获得【践踏】'],
      [0, 0, '目标单位+17/+17，并获得【践踏】'],
      [0, 0, '目标单位+19/+19，并获得【践踏】'],
      [0, 0, '目标单位+21/+22，并获得【践踏】'],
      [0, 0, '目标单位+24/+24，并获得【践踏】']
    ]
  },
  {
    name: '蛮石仙人掌',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/manshixianrenzhang.jpg', import.meta.url),
    data: [
      [4, 18, '【守军】、【荆棘】、死亡:抽一张牌'],
      [4, 21, '【守军】、【荆棘】、死亡:抽一张牌'],
      [5, 22, '【守军】、【荆棘】、死亡:抽一张牌'],
      [5, 25, '【守军】、【荆棘】、死亡:抽一张牌'],
      [6, 28, '【守军】、【荆棘】、死亡:抽一张牌'],
      [6, 32, '【守军】、【荆棘】、死亡:抽一张牌'],
      [7, 35, '【守军】、【荆棘】、死亡:抽一张牌'],
      [8, 40, '【守军】、【荆棘】、死亡:抽一张牌'],
      [9, 45, '【守军】、【荆棘】、死亡:抽一张牌']
    ]
  },
  {
    name: '高原卫士',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/gaoyuanweishi.jpg', import.meta.url),
    data: [
      [12, 20, '【洞察1】、【迟缓】、回合结束：若本回合受到过伤害，自身+3/+5，【洞察1】'],
      [13, 22, '【洞察1】、【迟缓】、回合结束：若本回合受到过伤害，自身+3/+6，【洞察1】'],
      [15, 23, '【洞察1】、【迟缓】、回合结束：若本回合受到过伤害，自身+3/+8，【洞察1】'],
      [16, 25, '【洞察1】、【迟缓】、回合结束：若本回合受到过伤害，自身+5/+8，【洞察1】'],
      [18, 26, '【洞察1】、【迟缓】、回合结束：若本回合受到过伤害，自身+4/+9，【洞察1】'],
      [20, 28, '【洞察1】、【迟缓】、回合结束：若本回合受到过伤害，自身+4/+10，【洞察1】'],
      [22, 30, '【洞察1】、【迟缓】、回合结束：若本回合受到过伤害，自身+5/+10，【洞察1】'],
      [25, 33, '【洞察1】、【迟缓】、回合结束：若本回合受到过伤害，自身+5/+11，【洞察1】'],
      [28, 36, '【洞察1】、【迟缓】、回合结束：若本回合受到过伤害，自身+5/+12，【洞察1】']
    ]
  },
  {
    name: '盘旋秃鹰',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/panxuantuying.jpg', import.meta.url),
    data: [
      [12, 8, '命中英雄:【洞察1】、洞察时:自身攻击+4'],
      [13, 9, '命中英雄:【洞察1】、洞察时:自身攻击+4'],
      [14, 10, '命中英雄:【洞察1】、洞察时:自身攻击+5'],
      [15, 12, '命中英雄:【洞察1】、洞察时:自身攻击+5'],
      [16, 13, '命中英雄:【洞察1】、洞察时:自身攻击+6'],
      [18, 14, '命中英雄:【洞察1】、洞察时:自身攻击+6'],
      [20, 15, '命中英雄:【洞察1】、洞察时:自身攻击+7'],
      [22, 17, '命中英雄:【洞察1】、洞察时:自身攻击+7'],
      [25, 18, '命中英雄:【洞察1】、洞察时:自身攻击+8']
    ]
  },
  {
    name: '沙暴试炼',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: new URL('@/assets/zhongzu/manshikuangye/shabaoshilian.jpg', import.meta.url),
    data: [
      [0, 0, '全体生物受到1点伤害，随机友军+4/+11，抽一张牌'],
      [0, 0, '全体生物受到1点伤害，随机友军+5/+12，抽一张牌'],
      [0, 0, '全体生物受到1点伤害，随机友军+6/+13，抽一张牌'],
      [0, 0, '全体生物受到1点伤害，随机友军+6/+15，抽一张牌'],
      [0, 0, '全体生物受到1点伤害，随机友军+7/+17，抽一张牌'],
      [0, 0, '全体生物受到1点伤害，随机友军+7/+20，抽一张牌'],
      [0, 0, '全体生物受到1点伤害，随机友军+8/+22，抽一张牌'],
      [0, 0, '全体生物受到1点伤害，随机友军+9/+24，抽一张牌'],
      [0, 0, '全体生物受到1点伤害，随机友军+10/+26，抽一张牌']
    ]
  },
  {
    name: '寻路斥候',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/xunluchihou.jpg', import.meta.url),
    data: [
      [11, 7, '登场:射击随机敌方，7点伤害、洞察时:射击随机敌军，5点伤害'],
      [13, 8, '登场:射击随机敌方，8点伤害、洞察时:射击随机敌军，5点伤害'],
      [15, 9, '登场:射击随机敌方，8点伤害、洞察时:射击随机敌军，6点伤害'],
      [17, 10, '登场:射击随机敌方，9点伤害、洞察时:射击随机敌军，6点伤害'],
      [20, 10, '登场:射击随机敌方，10点伤害、洞察时:射击随机敌军，7点伤害'],
      [22, 11, '登场:射击随机敌方，11点伤害、洞察时:射击随机敌军，8点伤害'],
      [25, 12, '登场:射击随机敌方，12点伤害、洞察时:射击随机敌军，9点伤害'],
      [27, 13, '登场:射击随机敌方，13点伤害、洞察时:射击随机敌军，10点伤害'],
      [29, 15, '登场:射击随机敌方，15点伤害、洞察时:射击随机敌军，12点伤害']
    ]
  },
  {
    name: '喧哗舞者',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/xuanhuawuzhe.jpg', import.meta.url),
    data: [
      [12, 8, '登场:相邻随机友军+9/+0，魔防+4'],
      [13, 10, '登场:相邻随机友军+10/+0，魔防+4'],
      [15, 10, '登场:相邻随机友军+11/+0，魔防+5'],
      [17, 10, '登场:相邻随机友军+12/+0，魔防+5'],
      [19, 10, '登场:相邻随机友军+13/+0，魔防+6'],
      [21, 11, '登场:相邻随机友军+14/+0，魔防+6'],
      [23, 12, '登场:相邻随机友军+15/+0，魔防+7'],
      [25, 13, '登场:相邻随机友军+17/+0，魔防+7'],
      [27, 15, '登场:相邻随机友军+19/+0，魔防+7']
    ]
  },
  {
    name: '迅捷长矛手',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/xunjiechangmaoshou.jpg', import.meta.url),
    data: [
      [10, 20, '命中英雄:对随机敌军投掷长矛，5点伤害，两次效果'],
      [12, 22, '命中英雄:对随机敌军投掷长矛，5点伤害，两次效果'],
      [14, 25, '命中英雄:对随机敌军投掷长矛，5点伤害，两次效果'],
      [16, 26, '命中英雄:对随机敌军投掷长矛，6点伤害，两次效果'],
      [17, 30, '命中英雄:对随机敌军投掷长矛，6点伤害，两次效果'],
      [19, 32, '命中英雄:对随机敌军投掷长矛，7点伤害，两次效果'],
      [22, 35, '命中英雄:对随机敌军投掷长矛，7点伤害，两次效果'],
      [24, 37, '命中英雄:对随机敌军投掷长矛，8点伤害，两次效果'],
      [26, 40, '命中英雄:对随机敌军投掷长矛，9点伤害，两次效果']
    ]
  },
  {
    name: '厚皮河马',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/houpihema.jpg', import.meta.url),
    data: [
      [12, 32, '【洞察1】、【迟缓】、回合结束:若本回合受到过伤害，自身生命+6'],
      [13, 35, '【洞察1】、【迟缓】、回合结束:若本回合受到过伤害，自身生命+7'],
      [14, 38, '【洞察1】、【迟缓】、回合结束:若本回合受到过伤害，自身生命+8'],
      [16, 40, '【洞察1】、【迟缓】、回合结束:若本回合受到过伤害，自身生命+10'],
      [17, 45, '【洞察1】、【迟缓】、回合结束:若本回合受到过伤害，自身生命+11'],
      [18, 50, '【洞察1】、【迟缓】、回合结束:若本回合受到过伤害，自身生命+12'],
      [20, 54, '【洞察1】、【迟缓】、回合结束:若本回合受到过伤害，自身生命+13'],
      [22, 60, '【洞察1】、【迟缓】、回合结束:若本回合受到过伤害，自身生命+14'],
      [25, 66, '【洞察1】、【迟缓】、回合结束:若本回合受到过伤害，自身生命+15']
    ]
  },
  {
    name: '面包树',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/mianbaoshu.jpg', import.meta.url),
    data: [
      [0, 35, '【守军】、【磐龙】、法力上限+1'],
      [0, 40, '【守军】、【磐龙】、法力上限+1'],
      [0, 45, '【守军】、【磐龙】、法力上限+1'],
      [0, 50, '【守军】、【磐龙】、法力上限+1'],
      [0, 55, '【守军】、【磐龙】、法力上限+1'],
      [0, 60, '【守军】、【磐龙】、法力上限+1'],
      [0, 65, '【守军】、【磐龙】、法力上限+1'],
      [0, 72, '【守军】、【磐龙】、法力上限+1'],
      [0, 80, '【守军】、【磐龙】、法力上限+1']
    ]
  },
  {
    name: '噬人花',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/shirenhua.jpg', import.meta.url),
    data: [
      [0, 35, '回合结束:若本回合曾受到伤害，则自身+7/+7'],
      [0, 40, '回合结束:若本回合曾受到伤害，则自身+8/+8'],
      [0, 45, '回合结束:若本回合曾受到伤害，则自身+9/+9'],
      [0, 50, '回合结束:若本回合曾受到伤害，则自身+10/+10'],
      [0, 55, '回合结束:若本回合曾受到伤害，则自身+11/+11'],
      [0, 60, '回合结束:若本回合曾受到伤害，则自身+12/+12'],
      [0, 65, '回合结束:若本回合曾受到伤害，则自身+13/+13'],
      [0, 72, '回合结束:若本回合曾受到伤害，则自身+14/+14'],
      [0, 80, '回合结束:若本回合曾受到伤害，则自身+15/+15']
    ]
  },
  {
    name: '天降碎石',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/manshikuangye/tianjiangsuishi.jpg', import.meta.url),
    data: [
      [0, 0, '目标区域坠落25点伤害，全场生物受到1点伤害'],
      [0, 0, '目标区域坠落30点伤害，全场生物受到1点伤害'],
      [0, 0, '目标区域坠落35点伤害，全场生物受到1点伤害'],
      [0, 0, '目标区域坠落40点伤害，全场生物受到1点伤害'],
      [0, 0, '目标区域坠落45点伤害，全场生物受到1点伤害'],
      [0, 0, '目标区域坠落50点伤害，全场生物受到1点伤害'],
      [0, 0, '目标区域坠落55点伤害，全场生物受到1点伤害'],
      [0, 0, '目标区域坠落59点伤害，全场生物受到1点伤害'],
      [0, 0, '目标区域坠落63点伤害，全场生物受到1点伤害']
    ]
  },
  {
    name: '机敏雀鹰',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/jiminqueying.jpg', import.meta.url),
    data: [
      [7, 14, '【洞察1】、洞察时：自身+2/+3，魔防+2'],
      [8, 16, '【洞察1】、洞察时：自身+2/+3，魔防+3'],
      [9, 18, '【洞察1】、洞察时：自身+3/+3，魔防+3'],
      [10, 22, '【洞察1】、洞察时：自身+3/+3，魔防+3'],
      [11, 25, '【洞察1】、洞察时：自身+3/+4，魔防+3'],
      [12, 28, '【洞察1】、洞察时：自身+3/+4，魔防+4'],
      [13, 32, '【洞察1】、洞察时：自身+4/+4，魔防+4'],
      [14, 36, '【洞察1】、洞察时：自身+4/+5，魔防+5'],
      [15, 40, '【洞察1】、洞察时：自身+5/+5，魔防+5']
    ]
  },
  {
    name: '雪域牦牛',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/xueyuhaoniu.jpg', import.meta.url),
    data: [
      [24, 20, '【迟缓】、【魔防7】、场上有冰封则失去【迟缓'],
      [26, 23, '【迟缓】、【魔防7】、场上有冰封则失去【迟缓'],
      [28, 26, '【迟缓】、【魔防8】、场上有冰封则失去【迟缓'],
      [30, 30, '【迟缓】、【魔防8】、场上有冰封则失去【迟缓'],
      [33, 33, '【迟缓】、【魔防9】、场上有冰封则失去【迟缓'],
      [36, 36, '【迟缓】、【魔防9】、场上有冰封则失去【迟缓'],
      [40, 40, '【迟缓】、【魔防10】、场上有冰封则失去【迟缓'],
      [45, 45, '【迟缓】、【魔防11】、场上有冰封则失去【迟缓'],
      [50, 50, '【迟缓】、【魔防12】、场上有冰封则失去【迟缓']
    ]
  },
  {
    name: '荒野赞颂人',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/huangyezansongren.jpg', import.meta.url),
    data: [
      [8, 22, '回合开始:另一个友军+6/+0，魔防+3'],
      [10, 24, '回合开始:另一个友军+7/+0，魔防+3'],
      [23, 24, '回合开始:另一个友军+8/+0，魔防+4'],
      [15, 25, '回合开始:另一个友军+9/+0，魔防+4'],
      [18, 26, '回合开始:另一个友军+10/+0，魔防+5'],
      [21, 27, '回合开始:另一个友军+11/+0，魔防+5'],
      [24, 28, '回合开始:另一个友军+12/+0，魔防+6'],
      [27, 30, '回合开始:另一个友军+13/+0，魔防+7'],
      [30, 33, '回合开始:另一个友军+15/+0，魔防+7']
    ]
  },
  {
    name: '原野狂战士',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/yuanyekuangzhanshi.jpg', import.meta.url),
    data: [
      [16, 16, '【洞察1】、【践踏】、【魔防3】'],
      [18, 18, '【洞察1】、【践踏】、【魔防3】'],
      [19, 19, '【洞察1】、【践踏】、【魔防4】'],
      [21, 21, '【洞察1】、【践踏】、【魔防5】'],
      [23, 23, '【洞察1】、【践踏】、【魔防6】'],
      [25, 25, '【洞察1】、【践踏】、【魔防7】'],
      [28, 28, '【洞察1】、【践踏】、【魔防7】'],
      [32, 32, '【洞察1】、【践踏】、【魔防8】'],
      [36, 36, '【洞察1】、【践踏】、【魔防9】']
    ]
  },
  {
    name: '巨兽猎户',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/jushouliehu.jpg', import.meta.url),
    data: [
      [17, 19, '登场:英雄生命+7、死亡:英雄生命+7'],
      [19, 21, '登场:英雄生命+8、死亡:英雄生命+8'],
      [21, 24, '登场:英雄生命+9、死亡:英雄生命+9'],
      [23, 27, '登场:英雄生命+10、死亡:英雄生命+10'],
      [26, 30, '登场:英雄生命+11、死亡:英雄生命+11'],
      [29, 33, '登场:英雄生命+12、死亡:英雄生命+12'],
      [32, 36, '登场:英雄生命+13、死亡:英雄生命+13'],
      [35, 40, '登场:英雄生命+14、死亡:英雄生命+14'],
      [38, 45, '登场:英雄生命+15、死亡:英雄生命+15']
    ]
  },
  {
    name: '生命源力',
    quality: '蓝',
    cost: 4,
    type: 2,
    img: new URL('@/assets/zhongzu/manshikuangye/shengmingyuanli.jpg', import.meta.url),
    data: [
      [0, 0, '【洞察1】、目标单位+16/+16'],
      [0, 0, '【洞察1】、目标单位+17/+17，魔防+4'],
      [0, 0, '【洞察1】、目标单位+18/+18，魔防+8'],
      [0, 0, '【洞察1】、目标单位+20/+20，魔防+10'],
      [0, 0, '【洞察1】、目标单位+23/+23，魔防+10'],
      [0, 0, '【洞察1】、目标单位+25/+25，魔防+13'],
      [0, 0, '【洞察1】、目标单位+28/+28，魔防+13'],
      [0, 0, '【洞察1】、目标单位+31/+31，魔防+13'],
      [0, 0, '【洞察1】、目标单位+34/+34，魔防+14']
    ]
  },
  {
    name: '强行捕猎',
    quality: '蓝',
    cost: 4,
    type: 2,
    img: new URL('@/assets/zhongzu/manshikuangye/qiangxingbulie.jpg', import.meta.url),
    data: [
      [0, 0, '对目标敌军造成120点伤害、己方英雄生命+30'],
      [0, 0, '对目标敌军造成140点伤害、己方英雄生命+33'],
      [0, 0, '对目标敌军造成160点伤害、己方英雄生命+36'],
      [0, 0, '对目标敌军造成180点伤害、己方英雄生命+40'],
      [0, 0, '对目标敌军造成200点伤害、己方英雄生命+45'],
      [0, 0, '对目标敌军造成220点伤害、己方英雄生命+52'],
      [0, 0, '对目标敌军造成240点伤害、己方英雄生命+60'],
      [0, 0, '对目标敌军造成255点伤害、己方英雄生命+70'],
      [0, 0, '对目标敌军造成270点伤害、己方英雄生命+80']
    ]
  },
  {
    name: '旷野蛮族',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/kuangyemanzu.jpg', import.meta.url),
    data: [
      [13, 26, '回合结束:若本回合受到过伤害，则自身+5/+5，获得【磐龙】'],
      [15, 29, '回合结束:若本回合受到过伤害，则自身+5/+5，获得【磐龙】'],
      [16, 31, '回合结束:若本回合受到过伤害，则自身+6/+6，获得【磐龙】'],
      [18, 35, '回合结束:若本回合受到过伤害，则自身+6/+6，获得【磐龙】'],
      [20, 38, '回合结束:若本回合受到过伤害，则自身+7/+7，获得【磐龙】'],
      [23, 40, '回合结束:若本回合受到过伤害，则自身+7/+7，获得【磐龙】'],
      [25, 42, '回合结束:若本回合受到过伤害，则自身+8/+8，获得【磐龙】'],
      [27, 45, '回合结束:若本回合受到过伤害，则自身+9/+9，获得【磐龙】'],
      [30, 49, '回合结束:若本回合受到过伤害，则自身+10/+10，获得【磐龙】']
    ]
  },
  {
    name: '复仇噬人花',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/fuchoushirenhua.jpg', import.meta.url),
    data: [
      [12, 30, '回合结束：若本回合受到过伤害，则撕咬前方敌军或玩家'],
      [13, 33, '回合结束：若本回合受到过伤害，则撕咬前方敌军或玩家'],
      [14, 36, '回合结束：若本回合受到过伤害，则撕咬前方敌军或玩家'],
      [15, 39, '回合结束：若本回合受到过伤害，则撕咬前方敌军或玩家'],
      [16, 42, '回合结束：若本回合受到过伤害，则撕咬前方敌军或玩家'],
      [18, 45, '回合结束：若本回合受到过伤害，则撕咬前方敌军或玩家'],
      [20, 48, '回合结束：若本回合受到过伤害，则撕咬前方敌军或玩家'],
      [22, 52, '回合结束：若本回合受到过伤害，则撕咬前方敌军或玩家'],
      [25, 55, '回合结束：若本回合受到过伤害，则撕咬前方敌军或玩家']
    ]
  },
  {
    name: '雪原野人',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/xueyuanyeren.jpg', import.meta.url),
    data: [
      [23, 23, '【迟缓】、【回命】、【洞察1】、场上有冰封则失去【迟缓】'],
      [25, 25, '【迟缓】、【回命】、【洞察1】、场上有冰封则失去【迟缓】'],
      [27, 27, '【迟缓】、【回命】、【洞察1】、场上有冰封则失去【迟缓】'],
      [29, 29, '【迟缓】、【回命】、【洞察1】、场上有冰封则失去【迟缓】'],
      [32, 32, '【迟缓】、【回命】、【洞察1】、场上有冰封则失去【迟缓】'],
      [35, 35, '【迟缓】、【回命】、【洞察1】、场上有冰封则失去【迟缓】'],
      [38, 38, '【迟缓】、【回命】、【洞察1】、场上有冰封则失去【迟缓】'],
      [41, 41, '【迟缓】、【回命】、【洞察1】、场上有冰封则失去【迟缓】'],
      [45, 45, '【迟缓】、【回命】、【洞察1】、场上有冰封则失去【迟缓】']
    ]
  },
  {
    name: '鼓舞图腾',
    quality: '蓝',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/guwututeng.jpg', import.meta.url),
    data: [
      [0, 40, '【洞察1】、回合开始:其他全体友军+3/+1，魔防+1'],
      [0, 45, '【洞察1】、回合开始:其他全体友军+3/+1，魔防+1'],
      [0, 50, '【洞察1】、回合开始:其他全体友军+3/+1，魔防+2'],
      [0, 60, '【洞察1】、回合开始:其他全体友军+3/+1，魔防+2'],
      [0, 70, '【洞察1】、回合开始:其他全体友军+3/+2，魔防+2'],
      [0, 80, '【洞察1】、回合开始:其他全体友军+3/+2，魔防+2'],
      [0, 90, '【洞察1】、回合开始:其他全体友军+3/+2，魔防+3'],
      [0, 95, '【洞察1】、回合开始:其他全体友军+3/+3，魔防+4'],
      [0, 100, '【洞察1】、回合开始:其他全体友军+4/+3，魔防+4']
    ]
  },
  {
    name: '迷茫巨人',
    quality: '蓝',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/mimangjuren.jpg', import.meta.url),
    data: [
      [25, 40, '【洞察1】、【迟缓】、【魔防7】'],
      [27, 42, '【洞察1】、【迟缓】、【魔防8】'],
      [30, 45, '【洞察1】、【迟缓】、【魔防9】'],
      [32, 50, '【洞察1】、【迟缓】、【魔防10】'],
      [35, 55, '【洞察1】、【迟缓】、【魔防11】'],
      [38, 60, '【洞察1】、【迟缓】、【魔防12】'],
      [40, 66, '【洞察1】、【迟缓】、【魔防13】'],
      [45, 70, '【洞察1】、【迟缓】、【魔防14】'],
      [50, 75, '【洞察1】、【迟缓】、【魔防15】']
    ]
  },
  {
    name: '疯狂祭师',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/fengkuangjishi.jpg', import.meta.url),
    data: [
      [16, 5, '法力上限+1、死亡:英雄生命-6'],
      [18, 5, '法力上限+1、死亡:英雄生命-7'],
      [19, 6, '法力上限+1、死亡:英雄生命-7'],
      [20, 7, '法力上限+1、死亡:英雄生命-7'],
      [22, 8, '法力上限+1、死亡:英雄生命-8'],
      [24, 9, '法力上限+1、死亡:英雄生命-8'],
      [26, 10, '法力上限+1、死亡:英雄生命-9'],
      [29, 11, '法力上限+1、死亡:英雄生命-10'],
      [33, 13, '法力上限+1、死亡:英雄生命-11']
    ]
  },
  {
    name: '无畏猎户',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/wuweiliehu.jpg', import.meta.url),
    data: [
      [10, 16, '【洞察1】、命中英雄时:再攻击一次'],
      [11, 18, '【洞察1】、命中英雄时:再攻击一次'],
      [12, 20, '【洞察1】、命中英雄时:再攻击一次'],
      [13, 23, '【洞察1】、命中英雄时:再攻击一次'],
      [15, 24, '【洞察1】、命中英雄时:再攻击一次'],
      [16, 28, '【洞察1】、命中英雄时:再攻击一次'],
      [18, 30, '【洞察1】、命中英雄时:再攻击一次'],
      [20, 33, '【洞察1】、命中英雄时:再攻击一次'],
      [23, 35, '【洞察1】、命中英雄时:再攻击一次']
    ]
  },
  {
    name: '血蜥头领',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/xuexitouling.jpg', import.meta.url),
    data: [
      [13, 9, '英雄回复生命时:向敌方随机位置投掷长矛(等于攻击力)'],
      [14, 10, '英雄回复生命时:向敌方随机位置投掷长矛(等于攻击力)'],
      [15, 11, '英雄回复生命时:向敌方随机位置投掷长矛(等于攻击力)'],
      [16, 12, '英雄回复生命时:向敌方随机位置投掷长矛(等于攻击力)'],
      [18, 13, '英雄回复生命时:向敌方随机位置投掷长矛(等于攻击力)'],
      [20, 15, '英雄回复生命时:向敌方随机位置投掷长矛(等于攻击力)'],
      [22, 17, '英雄回复生命时:向敌方随机位置投掷长矛(等于攻击力)'],
      [24, 19, '英雄回复生命时:向敌方随机位置投掷长矛(等于攻击力)'],
      [26, 22, '英雄回复生命时:向敌方随机位置投掷长矛(等于攻击力)']
    ]
  },
  {
    name: '暴怒野人',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/baonuyeren.jpg', import.meta.url),
    data: [
      [11, 15, '【践踏】、回合开始：每有1点剩余法力，自身+2/+2'],
      [13, 16, '【践踏】、回合开始：每有1点剩余法力，自身+2/+2'],
      [14, 19, '【践踏】、回合开始：每有1点剩余法力，自身+2/+3'],
      [16, 21, '【践踏】、回合开始：每有1点剩余法力，自身+2/+3'],
      [17, 24, '【践踏】、回合开始：每有1点剩余法力，自身+3/+3'],
      [19, 26, '【践踏】、回合开始：每有1点剩余法力，自身+3/+3'],
      [20, 30, '【践踏】、回合开始：每有1点剩余法力，自身+3/+4'],
      [23, 33, '【践踏】、回合开始：每有1点剩余法力，自身+3/+4'],
      [25, 36, '【践踏】、回合开始：每有1点剩余法力，自身+4/+4']
    ]
  },
  {
    name: '诱敌草人',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/youdicaoren.jpg', import.meta.url),
    data: [
      [0, 24, '回合结束：若本回合受到过伤害，抽一张牌，英雄生命+9，【洞察1】'],
      [0, 28, '回合结束：若本回合受到过伤害，抽一张牌，英雄生命+10，【洞察1】'],
      [0, 33, '回合结束：若本回合受到过伤害，抽一张牌，英雄生命+11，【洞察1】'],
      [0, 39, '回合结束：若本回合受到过伤害，抽一张牌，英雄生命+12，【洞察1】'],
      [0, 45, '回合结束：若本回合受到过伤害，抽一张牌，英雄生命+13，【洞察1】'],
      [0, 52, '回合结束：若本回合受到过伤害，抽一张牌，英雄生命+14，【洞察1】'],
      [0, 59, '回合结束：若本回合受到过伤害，抽一张牌，英雄生命+15，【洞察1】'],
      [0, 67, '回合结束：若本回合受到过伤害，抽一张牌，英雄生命+16，【洞察1】'],
      [0, 77, '回合结束：若本回合受到过伤害，抽一张牌，英雄生命+18，【洞察1】']
    ]
  },
  {
    name: '雪原狼女',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/xueyuanlangnv.jpg', import.meta.url),
    data: [
      [14, 10, '命中英雄:召唤4/3草原狼-lv6、攻击前:场上有冰封，另一友军攻击+4'],
      [15, 11, '命中英雄:召唤4/3草原狼-lv6、攻击前:场上有冰封，另一友军攻击+5'],
      [16, 12, '命中英雄:召唤5/3草原狼-lv7、攻击前:场上有冰封，另一友军攻击+5'],
      [17, 13, '命中英雄:召唤5/3草原狼-lv7、攻击前:场上有冰封，另一友军攻击+6'],
      [18, 15, '命中英雄:召唤6/3草原狼-lv8、攻击前:场上有冰封，另一友军攻击+6'],
      [20, 16, '命中英雄:召唤6/4草原狼-lv9、攻击前:场上有冰封，另一友军攻击+7'],
      [22, 18, '命中英雄:召唤7/4草原狼-lv10、攻击前:场上有冰封，另一友军攻击+8'],
      [25, 19, '命中英雄:召唤8/4草原狼-lv11、攻击前:场上有冰封，另一友军攻击+9'],
      [28, 20, '命中英雄:召唤9/4草原狼-lv12、攻击前:场上有冰封，另一友军攻击+10']
    ]
  },
  {
    name: '狼月祭师',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/langyuejishi.jpg', import.meta.url),
    data: [
      [16, 15, '回合结束:召唤6/4草原狼-lv9'],
      [18, 16, '回合结束:召唤7/4草原狼-lv10'],
      [20, 17, '回合结束:召唤8/4草原狼-lv11'],
      [23, 18, '回合结束:召唤9/4草原狼-lv12'],
      [25, 20, '回合结束:召唤10/4草原狼-lv13'],
      [27, 22, '回合结束:召唤11/4草原狼-lv14'],
      [30, 23, '回合结束:召唤12/4草原狼-lv15'],
      [33, 25, '回合结束:召唤14/4草原狼-lv16'],
      [37, 27, '回合结束:召唤15/5草原狼-lv17']
    ]
  },
  {
    name: '荒原智者',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/huangyuanzhizhe.jpg', import.meta.url),
    data: [
      [9, 15, '回合开始:所有迟缓友军+2/+8，随机另一友军+2/+2，失去迟缓'],
      [10, 17, '回合开始:所有迟缓友军+2/+9，随机另一友军+2/+2，失去迟缓'],
      [11, 18, '回合开始:所有迟缓友军+2/+10，随机另一友军+3/+3，失去迟缓'],
      [13, 19, '回合开始:所有迟缓友军+3/+10，随机另一友军+3/+3，失去迟缓'],
      [15, 20, '回合开始:所有迟缓友军+3/+10，随机另一友军+4/+4，失去迟缓'],
      [17, 22, '回合开始:所有迟缓友军+3/+11，随机另一友军+4/+4，失去迟缓'],
      [19, 24, '回合开始:所有迟缓友军+3/+13，随机另一友军+4/+4，失去迟缓'],
      [21, 27, '回合开始:所有迟缓友军+3/+14，随机另一友军+5/+5，失去迟缓'],
      [23, 30, '回合开始:所有迟缓友军+3/+15，随机另一友军+6/+6，失去迟缓']
    ]
  },
  {
    name: '地洞巨獾',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/didongjuhuan.jpg', import.meta.url),
    data: [
      [10, 22, '【回命】、英雄恢复生命时:自身+3/+3'],
      [11, 24, '【回命】、英雄恢复生命时:自身+3/+4'],
      [13, 26, '【回命】、英雄恢复生命时:自身+3/+4'],
      [14, 30, '【回命】、英雄恢复生命时:自身+4/+4'],
      [16, 32, '【回命】、英雄恢复生命时:自身+4/+4'],
      [18, 35, '【回命】、英雄恢复生命时:自身+4/+5'],
      [20, 38, '【回命】、英雄恢复生命时:自身+4/+5'],
      [23, 42, '【回命】、英雄恢复生命时:自身+5/+5'],
      [26, 46, '【回命】、英雄恢复生命时:自身+5/+5']
    ]
  },
  {
    name: '肥鼠晚宴',
    quality: '紫',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/manshikuangye/feishuwanyan.jpg', import.meta.url),
    data: [
      [0, 0, '回合结束:召唤2个6/20贪食肥鼠-lv12、英雄生命+7'],
      [0, 0, '回合结束:召唤2个7/23贪食肥鼠-lv13、英雄生命+8'],
      [0, 0, '回合结束:召唤2个8/26贪食肥鼠-lv14、英雄生命+12'],
      [0, 0, '回合结束:召唤2个9/30贪食肥鼠-lv15、英雄生命+12'],
      [0, 0, '回合结束:召唤2个10/33贪食肥鼠-lv16、英雄生命+15'],
      [0, 0, '回合结束:召唤2个11/36贪食肥鼠-lv17、英雄生命+16'],
      [0, 0, '回合结束:召唤2个12/40贪食肥鼠-lv18、英雄生命+18'],
      [0, 0, '回合结束:召唤2个14/44贪食肥鼠-lv19、英雄生命+19'],
      [0, 0, '回合结束:召唤2个16/46贪食肥鼠-lv20、英雄生命+20']
    ]
  },
  {
    name: '活力仙人掌',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/huolixianrenzhang.jpg', import.meta.url),
    data: [
      [6, 45, '【守军】、【荆棘】、每当一个生物死亡:65%几率英雄生命+12'],
      [7, 47, '【守军】、【荆棘】、每当一个生物死亡:65%几率英雄生命+13'],
      [7, 52, '【守军】、【荆棘】、每当一个生物死亡:65%几率英雄生命+14'],
      [8, 55, '【守军】、【荆棘】、每当一个生物死亡:65%几率英雄生命+15'],
      [9, 60, '【守军】、【荆棘】、每当一个生物死亡:65%几率英雄生命+16'],
      [10, 65, '【守军】、【荆棘】、每当一个生物死亡:65%几率英雄生命+17'],
      [11, 70, '【守军】、【荆棘】、每当一个生物死亡:65%几率英雄生命+18'],
      [12, 77, '【守军】、【荆棘】、每当一个生物死亡:65%几率英雄生命+19'],
      [13, 85, '【守军】、【荆棘】、每当一个生物死亡:65%几率英雄生命+20']
    ]
  },
  {
    name: '圣兽祭师',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/shengshoujishi.jpg', import.meta.url),
    data: [
      [13, 15, '回合开始：相邻一个友军获得【践踏】1回合、攻击前：全体践踏友军+3/+5'],
      [15, 17, '回合开始：相邻一个友军获得【践踏】1回合、攻击前：全体践踏友军+4/+5'],
      [16, 21, '回合开始：相邻一个友军获得【践踏】1回合、攻击前：全体践踏友军+5/+5'],
      [18, 24, '回合开始：相邻一个友军获得【践踏】1回合、攻击前：全体践踏友军+5/+5'],
      [20, 26, '回合开始：相邻一个友军获得【践踏】1回合、攻击前：全体践踏友军+6/+5'],
      [23, 28, '回合开始：相邻一个友军获得【践踏】1回合、攻击前：全体践踏友军+6/+5'],
      [25, 30, '回合开始：相邻一个友军获得【践踏】1回合、攻击前：全体践踏友军+6/+6'],
      [28, 33, '回合开始：相邻一个友军获得【践踏】1回合、攻击前：全体践踏友军+6/+6'],
      [31, 36, '回合开始：相邻一个友军获得【践踏】1回合、攻击前：全体践踏友军+6/+6']
    ]
  },
  {
    name: '象牙少女',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/xiangyashaonv.jpg', import.meta.url),
    data: [
      [4, 4, '【洞察1】、回合结束:召唤18/32长毛象-lv12'],
      [4, 5, '【洞察1】、回合结束:召唤20/35长毛象-lv13'],
      [5, 5, '【洞察1】、回合结束:召唤22/38长毛象-lv14'],
      [6, 6, '【洞察1】、回合结束:召唤24/40长毛象-lv15'],
      [6, 8, '【洞察1】、回合结束:召唤25/45长毛象-lv16'],
      [6, 9, '【洞察1】、回合结束:召唤27/48长毛象-lv17'],
      [7, 10, '【洞察1】、回合结束:召唤30/50长毛象-lv18'],
      [8, 11, '【洞察1】、回合结束:召唤33/55长毛象-lv19'],
      [9, 13, '【洞察1】、回合结束:召唤36/60长毛象-lv20']
    ]
  },
  {
    name: '源力祭师',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/yuanlijishi.jpg', import.meta.url),
    data: [
      [19, 26, '攻击前:每有1点法力，随机友军+2/+3'],
      [20, 30, '攻击前:每有1点法力，随机友军+2/+3'],
      [22, 33, '攻击前:每有1点法力，随机友军+3/+3'],
      [24, 36, '攻击前:每有1点法力，随机友军+3/+3'],
      [26, 40, '攻击前:每有1点法力，随机友军+3/+4'],
      [28, 45, '攻击前:每有1点法力，随机友军+3/+4'],
      [30, 50, '攻击前:每有1点法力，随机友军+4/+4'],
      [33, 55, '攻击前:每有1点法力，随机友军+4/+5'],
      [36, 60, '攻击前:每有1点法力，随机友军+5/+5']
    ]
  },
  {
    name: '饥蛮巨汉',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/jimanjuhan.jpg', import.meta.url),
    data: [
      [15, 35, '【迟缓】、【磐龙】、英雄恢复生命时:自身+8/+8'],
      [16, 40, '【迟缓】、【磐龙】、英雄恢复生命时:自身+8/+8'],
      [17, 42, '【迟缓】、【磐龙】、英雄恢复生命时:自身+9/+9'],
      [18, 48, '【迟缓】、【磐龙】、英雄恢复生命时:自身+9/+9'],
      [20, 50, '【迟缓】、【磐龙】、英雄恢复生命时:自身+10/+10'],
      [22, 55, '【迟缓】、【磐龙】、英雄恢复生命时:自身+10/+10'],
      [24, 59, '【迟缓】、【磐龙】、英雄恢复生命时:自身+11/+11'],
      [27, 64, '【迟缓】、【磐龙】、英雄恢复生命时:自身+12/+12'],
      [30, 70, '【迟缓】、【磐龙】、英雄恢复生命时:自身+13/+13']
    ]
  },
  {
    name: '飞斧狂人',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/feifukuangren.jpg', import.meta.url),
    data: [
      [10, 25, '回合开始:向对面横排，投掷飞斧，65%几率，再投掷一次'],
      [11, 28, '回合开始:向对面横排，投掷飞斧，65%几率，再投掷一次'],
      [13, 30, '回合开始:向对面横排，投掷飞斧，65%几率，再投掷一次'],
      [15, 32, '回合开始:向对面横排，投掷飞斧，65%几率，再投掷一次'],
      [18, 33, '回合开始:向对面横排，投掷飞斧，65%几率，再投掷一次'],
      [20, 36, '回合开始:向对面横排，投掷飞斧，65%几率，再投掷一次'],
      [22, 39, '回合开始:向对面横排，投掷飞斧，65%几率，再投掷一次'],
      [24, 42, '回合开始:向对面横排，投掷飞斧，65%几率，再投掷一次'],
      [25, 48, '回合开始:向对面横排，投掷飞斧，65%几率，再投掷一次']
    ]
  },
  {
    name: '霜矛骑士',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/shuangmaoqishi.jpg', import.meta.url),
    data: [
      [19, 19, '【迟缓】、登场、攻击前:向敌方随机位置投掷长矛、场上有冰封则失去【迟缓】'],
      [21, 21, '【迟缓】、登场、攻击前:向敌方随机位置投掷长矛、场上有冰封则失去【迟缓】'],
      [23, 23, '【迟缓】、登场、攻击前:向敌方随机位置投掷长矛、场上有冰封则失去【迟缓】'],
      [25, 25, '【迟缓】、登场、攻击前:向敌方随机位置投掷长矛、场上有冰封则失去【迟缓】'],
      [27, 27, '【迟缓】、登场、攻击前:向敌方随机位置投掷长矛、场上有冰封则失去【迟缓】'],
      [30, 30, '【迟缓】、登场、攻击前:向敌方随机位置投掷长矛、场上有冰封则失去【迟缓】'],
      [33, 33, '【迟缓】、登场、攻击前:向敌方随机位置投掷长矛、场上有冰封则失去【迟缓】'],
      [36, 36, '【迟缓】、登场、攻击前:向敌方随机位置投掷长矛、场上有冰封则失去【迟缓】'],
      [40, 40, '【迟缓】、登场、攻击前:向敌方随机位置投掷长矛、场上有冰封则失去【迟缓】']
    ]
  },
  {
    name: '愤怒狂战士',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/fennukuangzhanshi.jpg', import.meta.url),
    data: [
      [14, 36, '回合结束:若本回合受到过伤害，攻击+14、攻击高于30:获得【磐龙】'],
      [15, 40, '回合结束:若本回合受到过伤害，攻击+15、攻击高于30:获得【磐龙】'],
      [16, 45, '回合结束:若本回合受到过伤害，攻击+16、攻击高于30:获得【磐龙】'],
      [18, 48, '回合结束:若本回合受到过伤害，攻击+18、攻击高于30:获得【磐龙】'],
      [20, 52, '回合结束:若本回合受到过伤害，攻击+20、攻击高于30:获得【磐龙】'],
      [22, 58, '回合结束:若本回合受到过伤害，攻击+22、攻击高于30:获得【磐龙】'],
      [25, 65, '回合结束:若本回合受到过伤害，攻击+25、攻击高于30:获得【磐龙】'],
      [27, 72, '回合结束:若本回合受到过伤害，攻击+27、攻击高于30:获得【磐龙】'],
      [29, 80, '回合结束:若本回合受到过伤害，攻击+30、攻击高于30:获得【磐龙】']
    ]
  },
  {
    name: '牛角图腾',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/niujiaotuteng.jpg', import.meta.url),
    data: [
      [0, 22, '登场:召唤雪域牦牛-lv12、回合开始:其他友军攻击+3'],
      [0, 24, '登场:召唤雪域牦牛-lv13、回合开始:其他友军攻击+3'],
      [0, 26, '登场:召唤雪域牦牛-lv14、回合开始:其他友军攻击+3'],
      [0, 29, '登场:召唤雪域牦牛-lv15、回合开始:其他友军攻击+3'],
      [0, 30, '登场:召唤雪域牦牛-lv16、回合开始:其他友军攻击+4'],
      [0, 33, '登场:召唤雪域牦牛-lv17、回合开始:其他友军攻击+4'],
      [0, 36, '登场:召唤雪域牦牛-lv18、回合开始:其他友军攻击+4'],
      [0, 40, '登场:召唤雪域牦牛-lv19、回合开始:其他友军攻击+5'],
      [0, 45, '登场:召唤雪域牦牛-lv20、回合开始:其他友军攻击+5']
    ]
  },
  {
    name: '石斧头领',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/shifutouling.jpg', import.meta.url),
    data: [
      [16, 22, '【践踏】、登场:相邻随机友军+7/+7并获得【践踏】'],
      [18, 25, '【践踏】、登场:相邻随机友军+8/+8并获得【践踏】'],
      [20, 27, '【践踏】、登场:相邻随机友军+9/+9并获得【践踏】'],
      [22, 30, '【践踏】、登场:相邻随机友军+10/+10并获得【践踏】'],
      [25, 35, '【践踏】、登场:相邻随机友军+10/+10并获得【践踏】'],
      [27, 37, '【践踏】、登场:相邻随机友军+11/+11并获得【践踏】'],
      [30, 40, '【践踏】、登场:相邻随机友军+12/+12并获得【践踏】'],
      [33, 45, '【践踏】、登场:相邻随机友军+13/+13并获得【践踏】'],
      [35, 50, '【践踏】、登场:相邻随机友军+15/+15并获得【践踏】']
    ]
  },
  {
    name: '飞斧女豪',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/feifunvhao.jpg', import.meta.url),
    data: [
      [12, 36, '回合开始、攻击前、死亡:向敌方横排投掷飞斧(12点伤害)'],
      [14, 38, '回合开始、攻击前、死亡:向敌方横排投掷飞斧(14点伤害)'],
      [16, 40, '回合开始、攻击前、死亡:向敌方横排投掷飞斧(16点伤害)'],
      [18, 42, '回合开始、攻击前、死亡:向敌方横排投掷飞斧(18点伤害)'],
      [20, 45, '回合开始、攻击前、死亡:向敌方横排投掷飞斧(20点伤害)'],
      [22, 48, '回合开始、攻击前、死亡:向敌方横排投掷飞斧(22点伤害)'],
      [25, 50, '回合开始、攻击前、死亡:向敌方横排投掷飞斧(25点伤害)'],
      [27, 55, '回合开始、攻击前、死亡:向敌方横排投掷飞斧(27点伤害)'],
      [30, 60, '回合开始、攻击前、死亡:向敌方横排投掷飞斧(30点伤害)']
    ]
  },
  {
    name: '坚毅大祭司',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/jianyidajisi.jpg', import.meta.url),
    data: [
      [20, 33, '【磐龙】、回合结束：若本回合受到过伤害，全体友军+3/+4'],
      [22, 40, '【磐龙】、回合结束：若本回合受到过伤害，全体友军+3/+4'],
      [23, 45, '【磐龙】、回合结束：若本回合受到过伤害，全体友军+4/+4'],
      [25, 50, '【磐龙】、回合结束：若本回合受到过伤害，全体友军+4/+4'],
      [26, 55, '【磐龙】、回合结束：若本回合受到过伤害，全体友军+4/+5'],
      [28, 60, '【磐龙】、回合结束：若本回合受到过伤害，全体友军+4/+5'],
      [30, 65, '【磐龙】、回合结束：若本回合受到过伤害，全体友军+5/+5'],
      [33, 70, '【磐龙】、回合结束：若本回合受到过伤害，全体友军+5/+6'],
      [36, 75, '【磐龙】、回合结束：若本回合受到过伤害，全体友军+6/+6']
    ]
  },
  {
    name: '荒原牛头怪',
    quality: '紫',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/huangyuanniutouguai.jpg', import.meta.url),
    data: [
      [25, 35, '回合结束:若本回合受到伤害，则自身得+5/+15，获得【践踏】'],
      [27, 39, '回合结束:若本回合受到伤害，则自身得+6/+16，获得【践踏】'],
      [30, 42, '回合结束:若本回合受到伤害，则自身得+7/+17，获得【践踏】'],
      [33, 45, '回合结束:若本回合受到伤害，则自身得+7/+20，获得【践踏】'],
      [35, 50, '回合结束:若本回合受到伤害，则自身得+8/+20，获得【践踏】'],
      [37, 55, '回合结束:若本回合受到伤害，则自身得+9/+20，获得【践踏】'],
      [40, 60, '回合结束:若本回合受到伤害，则自身得+10/+20，获得【践踏】'],
      [45, 65, '回合结束:若本回合受到伤害，则自身得+10/+22，获得【践踏】'],
      [50, 70, '回合结束:若本回合受到伤害，则自身得+10/+24，获得【践踏】']
    ]
  },
  {
    name: '杂斑野猪王',
    quality: '紫',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/zabanyezhuwang.jpg', import.meta.url),
    data: [
      [21, 21, '登场:召唤8/8斑毛幼猪-lv12、死亡:英雄生命+40'],
      [23, 23, '登场:召唤10/10斑毛幼猪-lv13、死亡:英雄生命+45'],
      [26, 26, '登场:召唤11/11斑毛幼猪-lv14、死亡:英雄生命+50'],
      [30, 30, '登场:召唤12/12斑毛幼猪-lv15、死亡:英雄生命+55'],
      [33, 33, '登场:召唤13/13斑毛幼猪-lv16、死亡:英雄生命+60'],
      [36, 36, '登场:召唤14/15斑毛幼猪-lv17、死亡:英雄生命+65'],
      [40, 40, '登场:召唤16/16斑毛幼猪-lv18、死亡:英雄生命+70'],
      [45, 45, '登场:召唤18/18斑毛幼猪-lv19、死亡:英雄生命+75'],
      [50, 50, '登场:召唤20/20斑毛幼猪-lv20、死亡:英雄生命+80']
    ]
  },
  {
    name: '大嘴酋长',
    quality: '紫',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/dazuiqiuzhang.jpg', import.meta.url),
    data: [
      [23, 23, '【回命】、攻击前:召唤4/4蛮石血蜥-lv8'],
      [25, 25, '【回命】、攻击前:召唤5/5蛮石血蜥-lv9'],
      [28, 28, '【回命】、攻击前:召唤6/6蛮石血蜥-lv10'],
      [30, 30, '【回命】、攻击前:召唤7/7蛮石血蜥-lv11'],
      [33, 33, '【回命】、攻击前:召唤8/8蛮石血蜥-lv12'],
      [36, 35, '【回命】、攻击前:召唤9/9蛮石血蜥-lv13'],
      [38, 38, '【回命】、攻击前:召唤10/10蛮石血蜥-lv14'],
      [41, 41, '【回命】、攻击前:召唤12/12蛮石血蜥-lv16'],
      [45, 45, '【回命】、攻击前:召唤16/15蛮石血蜥-lv18']
    ]
  },
  {
    name: '源力苏醒',
    quality: '紫',
    cost: 6,
    type: 2,
    img: new URL('@/assets/zhongzu/manshikuangye/yuanlisuxing.jpg', import.meta.url),
    data: [
      [0, 0, '目标单位+24/+24，获得【磐龙】、另一友军+6/+6并获得【磐龙】'],
      [0, 0, '目标单位+26/+26，获得【磐龙】、另一友军+7/+7并获得【磐龙】'],
      [0, 0, '目标单位+28/+28，获得【磐龙】、另一友军+8/+8并获得【磐龙】'],
      [0, 0, '目标单位+30/+30，获得【磐龙】、另一友军+9/+9并获得【磐龙】'],
      [0, 0, '目标单位+33/+33，获得【磐龙】、另一友军+10/+10并获得【磐龙】'],
      [0, 0, '目标单位+36/+36，获得【磐龙】、另一友军+11/+11并获得【磐龙】'],
      [0, 0, '目标单位+40/+40，获得【磐龙】、另一友军+12/+12并获得【磐龙】'],
      [0, 0, '目标单位+45/+45，获得【磐龙】、另一友军+13/+13并获得【磐龙】'],
      [0, 0, '目标单位+50/+50，获得【磐龙】、另一友军+15/+15并获得【磐龙】']
    ]
  },
  {
    name: '蛮石独眼巨人',
    quality: '紫',
    cost: 7,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/manshiduyanjuren.jpg', import.meta.url),
    data: [
      [22, 55, '【迟缓】、登场、攻击前:向敌方横排投掷巨石，22点伤害'],
      [24, 65, '【迟缓】、登场、攻击前:向敌方横排投掷巨石，25点伤害'],
      [27, 70, '【迟缓】、登场、攻击前:向敌方横排投掷巨石，27点伤害'],
      [30, 80, '【迟缓】、登场、攻击前:向敌方横排投掷巨石，30点伤害'],
      [35, 90, '【迟缓】、登场、攻击前:向敌方横排投掷巨石，35点伤害'],
      [40, 100, '【迟缓】、登场、攻击前:向敌方横排投掷巨石，40点伤害'],
      [45, 110, '【迟缓】、登场、攻击前:向敌方横排投掷巨石，45点伤害'],
      [50, 120, '【迟缓】、登场、攻击前:向敌方横排投掷巨石，50点伤害'],
      [55, 135, '【迟缓】、登场、攻击前:向敌方横排投掷巨石，55点伤害']
    ]
  },
  {
    name: '贪食白龙',
    quality: '紫',
    cost: 8,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/tanshibailong.jpg', import.meta.url),
    data: [
      [22, 60, '登场、英雄获得生命:喷吐7个火球到敌方随机区域，各6点伤害'],
      [24, 66, '登场、英雄获得生命:喷吐7个火球到敌方随机区域，各6点伤害'],
      [25, 70, '登场、英雄获得生命:喷吐7个火球到敌方随机区域，各7点伤害'],
      [28, 75, '登场、英雄获得生命:喷吐7个火球到敌方随机区域，各8点伤害'],
      [30, 80, '登场、英雄获得生命:喷吐7个火球到敌方随机区域，各9点伤害'],
      [32, 85, '登场、英雄获得生命:喷吐7个火球到敌方随机区域，各10点伤害'],
      [35, 90, '登场、英雄获得生命:喷吐7个火球到敌方随机区域，各11点伤害'],
      [40, 95, '登场、英雄获得生命:喷吐7个火球到敌方随机区域，各12点伤害'],
      [45, 100, '登场、英雄获得生命:喷吐7个火球到敌方随机区域，各13点伤害']
    ]
  },
  {
    name: '传记·野蛮花园',
    quality: '紫',
    cost: 2,
    type: 3,
    img: new URL('@/assets/zhongzu/manshikuangye/zhuanji_yemanhuayuan.jpg', import.meta.url),
    data: [
      [0, 0, '回合结束:召唤噬人花-lv12、获得【传记·伤痛记忆】'],
      [0, 0, '回合结束:召唤噬人花-lv13、获得【传记·伤痛记忆】'],
      [0, 0, '回合结束:召唤噬人花-lv14、获得【传记·伤痛记忆】'],
      [0, 0, '回合结束:召唤噬人花-lv15、获得【传记·伤痛记忆】'],
      [0, 0, '回合结束:召唤噬人花-lv16、获得【传记·伤痛记忆】'],
      [0, 0, '回合结束:召唤噬人花-lv17、获得【传记·伤痛记忆】'],
      [0, 0, '回合结束:召唤噬人花-lv18、获得【传记·伤痛记忆】'],
      [0, 0, '回合结束:召唤噬人花-lv19、获得【传记·伤痛记忆】'],
      [0, 0, '回合结束:召唤噬人花-lv20、获得【传记·伤痛记忆】']
    ]
  },
  {
    name: '传记·伤痛记忆',
    quality: '紫',
    cost: 1,
    type: 3,
    img: new URL('@/assets/zhongzu/manshikuangye/zhuanji_shangtongjiyi.jpg', import.meta.url),
    data: [
      [0, 0, '随机友军+10/-1，获得【践踏】和【盘龙】'],
      [0, 0, '随机友军+11/-1，获得【践踏】和【盘龙】'],
      [0, 0, '随机友军+12/-1，获得【践踏】和【盘龙】'],
      [0, 0, '随机友军+13/-1，获得【践踏】和【盘龙】'],
      [0, 0, '随机友军+14/-1，获得【践踏】和【盘龙】'],
      [0, 0, '随机友军+15/-1，获得【践踏】和【盘龙】'],
      [0, 0, '随机友军+16/-1，获得【践踏】和【盘龙】'],
      [0, 0, '随机友军+18/-1，获得【践踏】和【盘龙】'],
      [0, 0, '随机友军+20/-1，获得【践踏】和【盘龙】']
    ]
  },
  {
    name: '鸵鸟王·霍利',
    quality: '橙',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/tuoniaowang_huoli.jpg', import.meta.url),
    data: [
      [18, 26, '【迟缓】、具有迟缓的其他友军，失去迟缓、命中英雄:另一友军+13/+13，无友军:抓一张牌'],
      [20, 30, '【迟缓】、具有迟缓的其他友军，失去迟缓、命中英雄:另一友军+15/+15，无友军:抓一张牌'],
      [22, 35, '【迟缓】、具有迟缓的其他友军，失去迟缓、命中英雄:另一友军+15/+15，无友军:抓一张牌'],
      [24, 40, '【迟缓】、具有迟缓的其他友军，失去迟缓、命中英雄:另一友军+15/+15，无友军:抓一张牌'],
      [25, 49, '【迟缓】、具有迟缓的其他友军，失去迟缓、命中英雄:另一友军+15/+15，无友军:抓一张牌'],
      [27, 55, '【迟缓】、具有迟缓的其他友军，失去迟缓、命中英雄:另一友军+15/+15，无友军:抓一张牌'],
      [30, 60, '【迟缓】、具有迟缓的其他友军，失去迟缓、命中英雄:另一友军+15/+15，无友军:抓一张牌'],
      [35, 64, '【迟缓】、具有迟缓的其他友军，失去迟缓、命中英雄:另一友军+18/+18，无友军:抓一张牌'],
      [40, 70, '【迟缓】、具有迟缓的其他友军，失去迟缓、命中英雄:另一友军+18/+18，无友军:抓一张牌']
    ]
  },
  {
    name: '旷野游侠·大羽',
    quality: '橙',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/kuangyeyouxia_dayu.jpg', import.meta.url),
    data: [
      [11, 17, '【践踏】、登场、命中时:射击敌方随机区域、回合结束:55%几率射击'],
      [12, 18, '【践踏】、登场、命中时:射击敌方随机区域、回合结束:60%几率射击'],
      [13, 20, '【践踏】、登场、命中时:射击敌方随机区域、回合结束:60%几率射击'],
      [15, 20, '【践踏】、登场、命中时:射击敌方随机区域、回合结束:65%几率射击'],
      [16, 24, '【践踏】、登场、命中时:射击敌方随机区域、回合结束:66.6%几率射击'],
      [18, 28, '【践踏】、登场、命中时:射击敌方随机区域、回合结束:68%几率射击'],
      [21, 30, '【践踏】、登场、命中时:射击敌方随机区域、回合结束:70%几率射击'],
      [23, 33, '【践踏】、登场、命中时:射击敌方随机区域、回合结束:72%几率射击'],
      [25, 36, '【践踏】、登场、命中时:射击敌方随机区域、回合结束:75%几率射击']
    ]
  },
  {
    name: '比尔&比利',
    quality: '橙',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/bierbili.jpg', import.meta.url),
    data: [
      [26, 26, '【践踏】、【迟缓】、【魔防10】、有践踏友军在场，他失去【迟缓】；有迟缓友军在场，他获得【磐龙】'],
      [29, 29, '【践踏】、【迟缓】、【魔防11】、有践踏友军在场，他失去【迟缓】；有迟缓友军在场，他获得【磐龙】'],
      [32, 32, '【践踏】、【迟缓】、【魔防12】、有践踏友军在场，他失去【迟缓】；有迟缓友军在场，他获得【磐龙】'],
      [36, 36, '【践踏】、【迟缓】、【魔防13】、有践踏友军在场，他失去【迟缓】；有迟缓友军在场，他获得【磐龙】'],
      [40, 40, '【践踏】、【迟缓】、【魔防14】、有践踏友军在场，他失去【迟缓】；有迟缓友军在场，他获得【磐龙】'],
      [45, 45, '【践踏】、【迟缓】、【魔防16】、有践踏友军在场，他失去【迟缓】；有迟缓友军在场，他获得【磐龙】'],
      [50, 50, '【践踏】、【迟缓】、【魔防18】、有践踏友军在场，他失去【迟缓】；有迟缓友军在场，他获得【磐龙】'],
      [55, 55, '【践踏】、【迟缓】、【魔防20】、有践踏友军在场，他失去【迟缓】；有迟缓友军在场，他获得【磐龙】'],
      [60, 60, '【践踏】、【迟缓】、【魔防22】、有践踏友军在场，他失去【迟缓】；有迟缓友军在场，他获得【磐龙】']
    ]
  },
  {
    name: '血饮烈斧·凯',
    quality: '橙',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/xueyinliefu_kai.jpg', import.meta.url),
    data: [
      [15, 29, '回合开始:其他所有友军本回合获得【回命】、英雄恢复生命:自身+6/+6、获得【践踏】'],
      [17, 32, '回合开始:其他所有友军本回合获得【回命】、英雄恢复生命:自身+7/+7、获得【践踏】'],
      [19, 36, '回合开始:其他所有友军本回合获得【回命】、英雄恢复生命:自身+8/+8、获得【践踏】'],
      [21, 40, '回合开始:其他所有友军本回合获得【回命】、英雄恢复生命:自身+9/+9、获得【践踏】'],
      [23, 45, '回合开始:其他所有友军本回合获得【回命】、英雄恢复生命:自身+10/+10、获得【践踏】'],
      [26, 50, '回合开始:其他所有友军本回合获得【回命】、英雄恢复生命:自身+11/+11、获得【践踏】'],
      [30, 55, '回合开始:其他所有友军本回合获得【回命】、英雄恢复生命:自身+12/+12、获得【践踏】'],
      [35, 58, '回合开始:其他所有友军本回合获得【回命】、英雄恢复生命:自身+13/+13、获得【践踏】'],
      [40, 60, '回合开始:其他所有友军本回合获得【回命】、英雄恢复生命:自身+15/+15、获得【践踏】']
    ]
  },
  {
    name: '蛮古撼地兽',
    quality: '橙',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/manguhandishou.jpg', import.meta.url),
    data: [
      [30, 70, '【迟缓】、【践踏】、【魔防25】、登场:其他迟缓、践踏友军获得生命+15，并获得【磐龙】'],
      [35, 75, '【迟缓】、【践踏】、【魔防30】、登场:其他迟缓、践踏友军获得生命+16，并获得【磐龙】'],
      [35, 85, '【迟缓】、【践踏】、【魔防35】、登场:其他迟缓、践踏友军获得生命+18，并获得【磐龙】'],
      [40, 90, '【迟缓】、【践踏】、【魔防40】、登场:其他迟缓、践踏友军获得生命+20，并获得【磐龙】'],
      [40, 100, '【迟缓】、【践踏】、【魔防40】、登场:其他迟缓、践踏友军获得生命+24，并获得【磐龙】'],
      [50, 110, '【迟缓】、【践踏】、【魔防50】、登场:其他迟缓、践踏友军获得生命+27，并获得【磐龙】'],
      [60, 120, '【迟缓】、【践踏】、【魔防60】、登场:其他迟缓、践踏友军获得生命+30，并获得【磐龙】'],
      [70, 130, '【迟缓】、【践踏】、【魔防70】、登场:其他迟缓、践踏友军获得生命+33，并获得【磐龙】'],
      [80, 140, '【迟缓】、【践踏】、【魔防80】、登场:其他迟缓、践踏友军获得生命+36，并获得【磐龙】']
    ]
  },
  {
    name: '原野大祭师·鲁玛',
    quality: '橙',
    cost: 7,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/yuanyedajishi_luma.jpg', import.meta.url),
    data: [
      [15, 50, '登场:另一友军+15/15，获得【践踏】、回合结束:另一友军+6/+6，获得【践踏】'],
      [16, 60, '登场:另一友军+16/16，获得【践踏】、回合结束:另一友军+7/+7，获得【践踏】'],
      [18, 64, '登场:另一友军+18/18，获得【践踏】、回合结束:另一友军+8/+8，获得【践踏】'],
      [20, 70, '登场:另一友军+20/20，获得【践踏】、回合结束:另一友军+9/+9，获得【践踏】'],
      [22, 80, '登场:另一友军+22/22，获得【践踏】、回合结束:另一友军+10/+10，获得【践踏】'],
      [25, 90, '登场:另一友军+25/25，获得【践踏】、回合结束:另一友军+11/+11，获得【践踏】'],
      [29, 100, '登场:另一友军+29/29，获得【践踏】、回合结束:另一友军+12/+12，获得【践踏】'],
      [33, 110, '登场:另一友军+33/33，获得【践踏】、回合结束:另一友军+13/+13，获得【践踏】'],
      [36, 130, '登场:另一友军+36/36，获得【践踏】、回合结束:另一友军+15/+15，获得【践踏】']
    ]
  },
  {
    name: '荒原暴君·血眼',
    quality: '橙',
    cost: 8,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/huangyuanbaojun_xueyan.jpg', import.meta.url),
    data: [
      [40, 52, '【践踏】、【连击】、【磐龙】、【魂歌】、登场若有冰封:获得【回命】2回合'],
      [45, 56, '【践踏】、【连击】、【磐龙】、【魂歌】、登场若有冰封:获得【回命】2回合'],
      [50, 60, '【践踏】、【连击】、【磐龙】、【魂歌】、登场若有冰封:获得【回命】2回合'],
      [55, 66, '【践踏】、【连击】、【磐龙】、【魂歌】、登场若有冰封:获得【回命】2回合'],
      [60, 72, '【践踏】、【连击】、【磐龙】、【魂歌】、登场若有冰封:获得【回命】2回合'],
      [65, 80, '【践踏】、【连击】、【磐龙】、【魂歌】、登场若有冰封:获得【回命】2回合'],
      [70, 90, '【践踏】、【连击】、【磐龙】、【魂歌】、登场若有冰封:获得【回命】2回合'],
      [75, 100, '【践踏】、【连击】、【磐龙】、【魂歌】、登场若有冰封:获得【回命】2回合'],
      [80, 110, '【践踏】、【连击】、【磐龙】、【魂歌】、登场若有冰封:获得【回命】2回合']
    ]
  },
  {
    name: '炎阳巨龙',
    quality: '橙',
    cost: 9,
    type: 1,
    img: new URL('@/assets/zhongzu/manshikuangye/yangyanjulong.jpg', import.meta.url),
    data: [
      [60, 60, '登场:焚烧全体敌军18点伤害、攻击前:烈焰吐息横排敌军15点伤害'],
      [66, 66, '登场:焚烧全体敌军18点伤害、攻击前:烈焰吐息横排敌军16点伤害'],
      [75, 75, '登场:焚烧全体敌军18点伤害、攻击前:烈焰吐息横排敌军18点伤害'],
      [80, 80, '登场:焚烧全体敌军18点伤害、攻击前:烈焰吐息横排敌军20点伤害'],
      [90, 90, '登场:焚烧全体敌军18点伤害、攻击前:烈焰吐息横排敌军20点伤害'],
      [100, 100, '登场:焚烧全体敌军18点伤害、攻击前:烈焰吐息横排敌军22点伤害'],
      [110, 110, '登场:焚烧全体敌军18点伤害、攻击前:烈焰吐息横排敌军24点伤害'],
      [125, 125, '登场:焚烧全体敌军20点伤害、攻击前:烈焰吐息横排敌军27点伤害'],
      [140, 140, '登场:焚烧全体敌军22点伤害、攻击前:烈焰吐息横排敌军30点伤害']
    ]
  }
];
