export default [
  {
    name: '小镇民兵',
    quality: '白',
    cost: 1,
    type: 1,
    img: '',
    data: [
      [7, 7, '/'],
      [8, 8, '/'],
      [9, 9, '/'],
      [10, 10, '/'],
      [11, 11, '/'],
      [12, 12, '/'],
      [13, 13, '/'],
      [14, 14, '/'],
      [15, 15, '/']
    ]
  },
  {
    name: '警卫',
    quality: '白',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [12, 6, '/'],
      [13, 7, '/'],
      [15, 7, '/'],
      [16, 8, '/'],
      [18, 8, '/'],
      [19, 9, '/'],
      [21, 9, '/'],
      [22, 10, '/'],
      [24, 10, '/']
    ]
  },
  {
    name: '士兵战衣',
    quality: '白',
    cost: 2,
    type: 2,
    img: '',
    data: [
      [0, 0, '目标友军+2/+16'],
      [0, 0, '目标友军+3/+17'],
      [0, 0, '目标友军+3/+20'],
      [0, 0, '目标友军+4/+21'],
      [0, 0, '目标友军+5/+25'],
      [0, 0, '目标友军+5/+30'],
      [0, 0, '目标友军+6/+33'],
      [0, 0, '目标友军+6/+38'],
      [0, 0, '目标友军+7/+40']
    ]
  },
  {
    name: '圣堂门卫',
    quality: '白',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [1, 25, '【护甲2】'],
      [1, 30, '【护甲2】'],
      [1, 35, '【护甲2】'],
      [1, 40, '【护甲2】'],
      [2, 40, '【护甲3】'],
      [2, 45, '【护甲3】'],
      [2, 50, '【护甲3】'],
      [2, 56, '【护甲3】'],
      [3, 60, '【护甲3】']
    ]
  },
  {
    name: '民兵勇士',
    quality: '白',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [14, 5, '/'],
      [16, 5, '/'],
      [18, 6, '/'],
      [20, 7, '/'],
      [22, 8, '/'],
      [24, 9, '/'],
      [26, 10, '/']
    ]
  },
  {
    name: '先锋骑手',
    quality: '白',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [6, 12, '登场:对面横排无敌军，自身+3/-2'],
      [7, 15, '登场:对面横排无敌军，自身+4/-2'],
      [9, 16, '登场:对面横排无敌军，自身+4/-2'],
      [12, 16, '登场:对面横排无敌军，自身+4/-2'],
      [14, 18, '登场:对面横排无敌军，自身+5/-2'],
      [16, 20, '登场:对面横排无敌军，自身+5/-2'],
      [18, 22, '登场:对面横排无敌军，自身+6/-2'],
      [20, 24, '登场:对面横排无敌军，自身+6/-2'],
      [23, 26, '登场:对面横排无敌军，自身+6/-2']
    ]
  },
  {
    name: '帝国重锤兵',
    quality: '白',
    cost: 5,
    type: 1,
    img: '',
    data: [
      [23, 7, '/'],
      [26, 8, '/'],
      [30, 8, '/'],
      [35, 9, '/'],
      [39, 10, '/'],
      [42, 12, '/'],
      [45, 15, '/'],
      [49, 15, '/'],
      [50, 20, '/']
    ]
  },
  {
    name: '圣殿斥候',
    quality: '蓝',
    cost: 1,
    type: 1,
    img: '',
    data: [
      [9, 6, '【洞察1】、【协战4】'],
      [10, 8, '【洞察1】、【协战4】'],
      [11, 9, '【洞察1】、【协战5】'],
      [13, 9, '【洞察1】、【协战5】'],
      [15, 10, '【洞察1】、【协战6】'],
      [17, 11, '【洞察1】、【协战6】'],
      [18, 14, '【洞察1】、【协战7】'],
      [20, 16, '【洞察1】、【协战7】'],
      [22, 18, '【洞察1】、【协战8】']
    ]
  },
  {
    name: '旅行背包',
    quality: '蓝',
    cost: 1,
    type: 2,
    img: '',
    data: [
      [0, 0, '目标友军+5/+10，获得【回命】'],
      [0, 0, '目标友军+5/+12，获得【回命】'],
      [0, 0, '目标友军+6/+13，获得【回命】'],
      [0, 0, '目标友军+7/+15，获得【回命】'],
      [0, 0, '目标友军+8/+18，获得【回命】'],
      [0, 0, '目标友军+9/+21，获得【回命】'],
      [0, 0, '目标友军+10/+24，获得【回命】'],
      [0, 0, '目标友军+11/+28，获得【回命】'],
      [0, 0, '目标友军+12/+30，获得【回命】']
    ]
  },
  {
    name: '重装固守',
    quality: '蓝',
    cost: 1,
    type: 2,
    img: '',
    data: [
      [0, 0, '目标友军+2/+12，若他有护甲，则护甲+2并获得【磐龙】、抽一张牌'],
      [0, 0, '目标友军+3/+12，若他有护甲，则护甲+3并获得【磐龙】、抽一张牌'],
      [0, 0, '目标友军+3/+14，若他有护甲，则护甲+3并获得【磐龙】、抽一张牌'],
      [0, 0, '目标友军+4/+14，若他有护甲，则护甲+4并获得【磐龙】、抽一张牌'],
      [0, 0, '目标友军+5/+15，若他有护甲，则护甲+4并获得【磐龙】、抽一张牌'],
      [0, 0, '目标友军+6/+16，若他有护甲，则护甲+5并获得【磐龙】、抽一张牌'],
      [0, 0, '目标友军+6/+20，若他有护甲，则护甲+5并获得【磐龙】、抽一张牌'],
      [0, 0, '目标友军+7/+22，若他有护甲，则护甲+6并获得【磐龙】、抽一张牌'],
      [0, 0, '目标友军+8/+26，若他有护甲，则护甲+6并获得【磐龙】、抽一张牌']
    ]
  },
  {
    name: '防御工事',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [0, 30, '【守军】、回合结束:自身生命+6'],
      [0, 35, '【守军】、回合结束:自身生命+7'],
      [0, 40, '【守军】、回合结束:自身生命+8'],
      [0, 45, '【守军】、回合结束:自身生命+9'],
      [0, 50, '【守军】、回合结束:自身生命+10'],
      [0, 55, '【守军】、回合结束:自身生命+11'],
      [0, 60, '【守军】、回合结束:自身生命+12'],
      [0, 66, '【守军】、回合结束:自身生命+13'],
      [0, 72, '【守军】、回合结束:自身生命+14']
    ]
  },
  {
    name: '圣殿卫士',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [10, 15, '【洞察1】、【回命】'],
      [12, 15, '【洞察1】、【回命】'],
      [13, 17, '【洞察1】、【回命】'],
      [15, 18, '【洞察1】、【回命】'],
      [16, 21, '【洞察1】、【回命】'],
      [18, 23, '【洞察1】、【回命】'],
      [20, 25, '【洞察1】、【回命】'],
      [22, 28, '【洞察1】、【回命】'],
      [25, 30, '【洞察1】、【回命】']
    ]
  },
  {
    name: '修女',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [6, 13, '登场:英雄生命+15、回合结束:75%几率，英雄生命+10'],
      [7, 15, '登场:英雄生命+18、回合结束:75%几率，英雄生命+10'],
      [8, 17, '登场:英雄生命+21、回合结束:75%几率，英雄生命+12'],
      [9, 19, '登场:英雄生命+25、回合结束:80%几率，英雄生命+12'],
      [10, 21, '登场:英雄生命+30、回合结束:英雄生命+12'],
      [11, 23, '登场:英雄生命+30、回合结束:英雄生命+15'],
      [12, 25, '登场:英雄生命+35、回合结束:英雄生命+15'],
      [13, 27, '登场:英雄生命+36、回合结束:英雄生命+18'],
      [15, 29, '登场:英雄生命+40、回合结束:英雄生命+18']
    ]
  },
  {
    name: '欢乐奶牛',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [2, 20, '回合结束::85%几率，恢复英雄生命，等同于自身防御'],
      [3, 21, '回合结束::90%几率，恢复英雄生命，等同于自身防御'],
      [3, 23, '回合结束::95%几率，恢复英雄生命，等同于自身防御'],
      [3, 25, '回合结束:恢复英雄生命，等同于自身防御'],
      [4, 26, '回合结束:恢复英雄生命，等同于自身防御'],
      [4, 29, '回合结束:恢复英雄生命，等同于自身防御'],
      [5, 31, '回合结束:恢复英雄生命，等同于自身防御'],
      [5, 35, '回合结束:恢复英雄生命，等同于自身防御'],
      [6, 39, '回合结束:恢复英雄生命，等同于自身防御']
    ]
  },
  {
    name: '炫目神光',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: '',
    data: [
      [0, 0, '两个随机敌军，本回合不能进行攻击、英雄生命+20、获得《真理碎片》'],
      [0, 0, '两个随机敌军，本回合不能进行攻击、英雄生命+25、获得《真理碎片》'],
      [0, 0, '两个随机敌军，本回合不能进行攻击、英雄生命+30、获得《真理碎片》'],
      [0, 0, '三个随机敌军，本回合不能进行攻击、英雄生命+30、获得《真理碎片》'],
      [0, 0, '三个随机敌军，本回合不能进行攻击、英雄生命+35、获得《真理碎片》'],
      [0, 0, '三个随机敌军，本回合不能进行攻击、英雄生命+40、获得《真理碎片》'],
      [0, 0, '三个随机敌军，本回合不能进行攻击、英雄生命+45、获得《真理碎片》'],
      [0, 0, '三个随机敌军，本回合不能进行攻击、英雄生命+50、获得《真理碎片》'],
      [0, 0, '三个随机敌军，本回合不能进行攻击、英雄生命+55、获得《真理碎片》']
    ]
  },
  {
    name: '天使琼浆',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: '',
    data: [
      [0, 0, '【洞察1】、英雄生命+28、抓一张牌、75%几率获得《真理碎片》'],
      [0, 0, '【洞察1】、英雄生命+32、抓一张牌、75%几率获得《真理碎片》'],
      [0, 0, '【洞察1】、英雄生命+35、抓一张牌、80%几率获得《真理碎片》'],
      [0, 0, '【洞察1】、英雄生命+40、抓一张牌、80%几率获得《真理碎片》'],
      [0, 0, '【洞察1】、英雄生命+45、抓一张牌、获得《真理碎片》'],
      [0, 0, '【洞察1】、英雄生命+50、抓一张牌、获得《真理碎片》'],
      [0, 0, '【洞察1】、英雄生命+55、抓一张牌、获得《真理碎片》'],
      [0, 0, '【洞察1】、英雄生命+60、抓一张牌、获得《真理碎片》'],
      [0, 0, '【洞察1】、英雄生命+66、抓一张牌、获得《真理碎片》']
    ]
  },
  {
    name: '圣甲先锋',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [12, 12, '【护甲3】、命中英雄:手上一张护甲生物卡法力-1（次数上限:2）'],
      [13, 13, '【护甲3】、命中英雄:手上一张护甲生物卡法力-1（次数上限:2）'],
      [14, 15, '【护甲3】、命中英雄:手上一张护甲生物卡法力-1（次数上限:2）'],
      [16, 16, '【护甲3】、命中英雄:手上一张护甲生物卡法力-1（次数上限:2）'],
      [17, 17, '【护甲4】、命中英雄:手上一张护甲生物卡法力-1（次数上限:2）'],
      [18, 19, '【护甲4】、命中英雄:手上一张护甲生物卡法力-1（次数上限:2）'],
      [20, 20, '【护甲5】、命中英雄:手上一张护甲生物卡法力-1（次数上限:2）'],
      [22, 22, '【护甲5】、命中英雄:手上一张护甲生物卡法力-1（次数上限:2）'],
      [24, 24, '【护甲6】、命中英雄:手上一张护甲生物卡法力-1（次数上限:2）']
    ]
  },
  {
    name: '民兵队长',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [7, 7, '【协战4】、登场:相邻区域召唤5/5小镇民兵-lv10'],
      [8, 8, '【协战4】、登场:相邻区域召唤6/6小镇民兵-lv11'],
      [9, 9, '【协战5】、登场:相邻区域召唤7/7小镇民兵-lv12'],
      [10, 10, '【协战5】、登场:相邻区域召唤8/8小镇民兵-lv13'],
      [11, 11, '【协战5】、登场:相邻区域召唤9/9小镇民兵-lv14'],
      [12, 13, '【协战6】、登场:相邻区域召唤10/10小镇民兵-lv15'],
      [14, 14, '【协战6】、登场:相邻区域召唤11/11小镇民兵-lv16'],
      [15, 15, '【协战7】、登场:相邻区域召唤12/12小镇民兵-lv17'],
      [16, 16, '【协战8】、登场:相邻区域召唤13/13小镇民兵-lv18']
    ]
  },
  {
    name: '盾甲禁卫',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [13, 11, '【护甲6】'],
      [14, 12, '【护甲7】'],
      [16, 13, '【护甲7】'],
      [17, 15, '【护甲8】'],
      [19, 17, '【护甲8】'],
      [21, 18, '【护甲9】'],
      [24, 19, '【护甲9】'],
      [26, 21, '【护甲10】'],
      [29, 24, '【护甲10】']
    ]
  },
  {
    name: '帝国后勤官',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [10, 24, '回合结束:恢复英雄生命，等同自身攻击'],
      [11, 27, '回合结束:恢复英雄生命，等同自身攻击'],
      [12, 30, '回合结束:恢复英雄生命，等同自身攻击'],
      [13, 33, '回合结束:恢复英雄生命，等同自身攻击'],
      [15, 35, '回合结束:恢复英雄生命，等同自身攻击'],
      [16, 39, '回合结束:恢复英雄生命，等同自身攻击'],
      [18, 40, '回合结束:恢复英雄生命，等同自身攻击'],
      [20, 42, '回合结束:恢复英雄生命，等同自身攻击'],
      [22, 45, '回合结束:恢复英雄生命，等同自身攻击']
    ]
  },
  {
    name: '圣殿弩手',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [7, 16, '【协战4】、回合开始:射击敌方英雄'],
      [8, 17, '【协战4】、回合开始:射击敌方英雄'],
      [9, 18, '【协战5】、回合开始:射击敌方英雄'],
      [10, 21, '【协战5】、回合开始:射击敌方英雄'],
      [11, 24, '【协战6】、回合开始:射击敌方英雄'],
      [12, 27, '【协战7】、回合开始:射击敌方英雄'],
      [13, 30, '【协战8】、回合开始:射击敌方英雄'],
      [15, 33, '【协战8】、回合开始:射击敌方英雄'],
      [17, 35, '【协战9】、回合开始:射击敌方英雄']
    ]
  },
  {
    name: '大型弩车',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [0, 26, '【洞察1】、【协战11】'],
      [0, 30, '【洞察1】、【协战12】'],
      [0, 35, '【洞察1】、【协战13】'],
      [0, 40, '【洞察1】、【协战14】'],
      [0, 45, '【洞察1】、【协战15】'],
      [0, 48, '【洞察1】、【协战17】'],
      [0, 50, '【洞察1】、【协战19】'],
      [0, 55, '【洞察1】、【协战22】'],
      [0, 60, '【洞察1】、【协战25】']
    ]
  },
  {
    name: '无畏爆破手',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [10, 27, '回合结束:投掷炸弹，15点伤害、死亡:炸伤你的英雄'],
      [11, 30, '回合结束:投掷炸弹，16点伤害、死亡:炸伤你的英雄'],
      [12, 33, '回合结束:投掷炸弹，17点伤害、死亡:炸伤你的英雄'],
      [13, 36, '回合结束:投掷炸弹，18点伤害、死亡:炸伤你的英雄'],
      [14, 40, '回合结束:投掷炸弹，20点伤害、死亡:炸伤你的英雄'],
      [15, 45, '回合结束:投掷炸弹，22点伤害、死亡:炸伤你的英雄'],
      [16, 49, '回合结束:投掷炸弹，25点伤害、死亡:炸伤你的英雄'],
      [18, 53, '回合结束:投掷炸弹，27点伤害、死亡:炸伤你的英雄'],
      [20, 55, '回合结束:投掷炸弹，30点伤害、死亡:炸伤你的英雄']
    ]
  },
  {
    name: '增援战线',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: '',
    data: [
      [0, 0, '召唤3个4/5民兵-lv8，60%概率再召唤一个'],
      [0, 0, '【洞察1】、召唤3个5/5民兵-lv9，60%概率再召唤一个'],
      [0, 0, '【洞察1】、召唤3个6/6民兵-lv10，66%概率再召唤一个'],
      [0, 0, '【洞察1】、召唤3个7/7民兵-lv12，66%概率再召唤一个'],
      [0, 0, '【洞察1】、召唤3个8/8民兵-lv13，66%概率再召唤一个'],
      [0, 0, '【洞察1】、召唤3个9/9民兵-lv14，67%概率再召唤一个'],
      [0, 0, '【洞察1】、召唤3个10/10民兵-lv15，68%概率再召唤一个'],
      [0, 0, '【洞察1】、召唤3个11/11民兵-lv16，72%概率再召唤一个'],
      [0, 0, '【洞察1】、召唤3个12/12民兵-lv17，75%概率再召唤一个']
    ]
  },
  {
    name: '信念雕像',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [7, 22, '【守军】、【护甲3】、回合开始:另一友军生命+X（等同攻击）'],
      [8, 23, '【守军】、【护甲4】、回合开始:另一友军生命+X（等同攻击）'],
      [9, 25, '【守军】、【护甲4】、回合开始:另一友军生命+X（等同攻击）'],
      [10, 28, '【守军】、【护甲4】、回合开始:另一友军生命+X（等同攻击）'],
      [11, 31, '【守军】、【护甲5】、回合开始:另一友军生命+X（等同攻击）'],
      [12, 35, '【守军】、【护甲5】、回合开始:另一友军生命+X（等同攻击）'],
      [13, 38, '【守军】、【护甲6】、回合开始:另一友军生命+X（等同攻击）'],
      [14, 44, '【守军】、【护甲7】、回合开始:另一友军生命+X（等同攻击）'],
      [15, 50, '【守军】、【护甲8】、回合开始:另一友军生命+X（等同攻击）']
    ]
  },
  {
    name: '塔楼弓手',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [13, 7, '【先攻】、洞察时:自身+3/+2、死亡:【洞察1】'],
      [15, 7, '【先攻】、洞察时:自身+3/+2、死亡:【洞察1】'],
      [16, 8, '【先攻】、洞察时:自身+4/+2、死亡:【洞察1】'],
      [18, 9, '【先攻】、洞察时:自身+4/+2、死亡:【洞察1】'],
      [20, 10, '【先攻】、洞察时:自身+5/+2、死亡:【洞察1】'],
      [22, 12, '【先攻】、洞察时:自身+5/+2、死亡:【洞察1】'],
      [25, 12, '【先攻】、洞察时:自身+5/+3、死亡:【洞察1】'],
      [28, 13, '【先攻】、洞察时:自身+6/+3、死亡:【洞察1】'],
      [30, 15, '【先攻】、洞察时:自身+6/+4、死亡:【洞察1】']
    ]
  },
  {
    name: '神圣活化',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: '',
    data: [
      [0, 0, '目标友军+12/+12，失去【守军】'],
      [0, 0, '目标友军+13/+14，失去【守军】'],
      [0, 0, '目标友军+15/+15，失去【守军】'],
      [0, 0, '目标友军+16/+17，失去【守军】'],
      [0, 0, '目标友军+18/+18，失去【守军】'],
      [0, 0, '目标友军+20/+20，失去【守军】'],
      [0, 0, '目标友军+22/+22，失去【守军】'],
      [0, 0, '目标友军+24/+24，失去【守军】'],
      [0, 0, '目标友军+26/+26，失去【守军】']
    ]
  },
  {
    name: '圣殿精英',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [9, 24, '【协战8】、【护甲1】'],
      [10, 26, '【协战8】、【护甲2】'],
      [11, 29, '【协战9】、【护甲2】'],
      [13, 30, '【协战10】、【护甲2】'],
      [14, 34, '【协战11】、【护甲2】'],
      [16, 35, '【协战12】、【护甲3】'],
      [18, 38, '【协战13】、【护甲3】'],
      [20, 42, '【协战14】、【护甲3】'],
      [22, 45, '【协战16】、【护甲3】']
    ]
  },
  {
    name: '白头狮鹫',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [15, 8, '【回命】、攻击前:65%几率，吹飞对面首位敌军。'],
      [16, 9, '【回命】、攻击前:70%几率，吹飞对面首位敌军。'],
      [18, 9, '【回命】、攻击前:70%几率，吹飞对面首位敌军。'],
      [19, 9, '【回命】、攻击前:75%几率，吹飞对面首位敌军。'],
      [20, 10, '【回命】、攻击前:75%几率，吹飞对面首位敌军。'],
      [23, 11, '【回命】、攻击前:75%几率，吹飞对面首位敌军。'],
      [25, 13, '【回命】、攻击前:75%几率，吹飞对面首位敌军。'],
      [28, 16, '【回命】、攻击前:75%几率，吹飞对面首位敌军。'],
      [32, 18, '【回命】、攻击前:75%几率，吹飞对面首位敌军。']
    ]
  },
  {
    name: '箭楼车',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [4, 40, '回合结束:射击随机敌军3点伤害，随机另一名友军+2/+2'],
      [4, 45, '回合结束:射击随机敌军4点伤害，随机另一名友军+2/+2'],
      [5, 50, '回合结束:射击随机敌军4点伤害，随机另一名友军+2/+2'],
      [5, 55, '回合结束:射击随机敌军5点伤害，随机另一名友军+2/+2'],
      [6, 60, '回合结束:射击随机敌军5点伤害，随机另一名友军+3/+3'],
      [6, 66, '回合结束:射击随机敌军6点伤害，随机另一名友军+3/+3'],
      [7, 70, '回合结束:射击随机敌军6点伤害，随机另一名友军+4/+4'],
      [8, 80, '回合结束:射击随机敌军7点伤害，随机另一名友军+4/+4'],
      [9, 90, '回合结束:射击随机敌军7点伤害，随机另一名友军+5/+5']
    ]
  },
  {
    name: '帝国老兵',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [11, 25, '登场:召唤7/7小镇民兵-lv12'],
      [12, 26, '登场:召唤8/8小镇民兵-lv13'],
      [13, 28, '登场:召唤9/9小镇民兵-lv14'],
      [15, 30, '登场:召唤10/10小镇民兵-lv15'],
      [16, 33, '登场:召唤11/11小镇民兵-lv16'],
      [17, 36, '登场:召唤12/12小镇民兵-lv17'],
      [18, 40, '登场:召唤13/13小镇民兵-lv18'],
      [20, 42, '登场:召唤14/14小镇民兵-lv19'],
      [22, 45, '登场:召唤15/15小镇民兵-lv20']
    ]
  },
  {
    name: '四芒营帐',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [0, 38, '【守军】、登场、回合结束:召唤4/5小镇民兵-lv8'],
      [0, 42, '【守军】、登场、回合结束:召唤5/5小镇民兵-lv9'],
      [0, 46, '【守军】、登场、回合结束:召唤6/6小镇民兵-lv10'],
      [0, 50, '【守军】、登场、回合结束:召唤7/7小镇民兵-lv12'],
      [0, 55, '【守军】、登场、回合结束:召唤8/8小镇民兵-lv13'],
      [0, 62, '【守军】、登场、回合结束:召唤9/9小镇民兵-lv14'],
      [0, 70, '【守军】、登场、回合结束:召唤10/10小镇民兵-lv15'],
      [0, 80, '【守军】、登场、回合结束:召唤11/11小镇民兵-lv16'],
      [0, 90, '【守军】、登场、回合结束:召唤12/12小镇民兵-lv17']
    ]
  },
  {
    name: '帝国重炮',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [15, 37, '【守军】、回合结束:炮击敌横排随机区域'],
      [16, 42, '【守军】、回合结束:炮击敌横排随机区域'],
      [18, 45, '【守军】、回合结束:炮击敌横排随机区域'],
      [19, 50, '【守军】、回合结束:炮击敌横排随机区域'],
      [20, 55, '【守军】、回合结束:炮击敌横排随机区域'],
      [22, 60, '【守军】、回合结束:炮击敌横排随机区域'],
      [24, 65, '【守军】、回合结束:炮击敌横排随机区域'],
      [27, 70, '【守军】、回合结束:炮击敌横排随机区域'],
      [30, 75, '【守军】、回合结束:炮击敌横排随机区域']
    ]
  },
  {
    name: '谨慎的火枪手',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [10, 25, '攻击前、回合结束:若友军更多，枪击随机敌军(5点伤害)'],
      [11, 28, '攻击前、回合结束:若友军更多，枪击随机敌军(6点伤害)'],
      [13, 30, '攻击前、回合结束:若友军更多，枪击随机敌军(6点伤害)'],
      [14, 33, '攻击前、回合结束:若友军更多，枪击随机敌军(7点伤害)'],
      [15, 37, '攻击前、回合结束:若友军更多，枪击随机敌军(8点伤害)'],
      [17, 40, '攻击前、回合结束:若友军更多，枪击随机敌军(9点伤害)'],
      [19, 43, '攻击前、回合结束:若友军更多，枪击随机敌军(10点伤害)'],
      [22, 46, '攻击前、回合结束:若友军更多，枪击随机敌军(12点伤害)'],
      [25, 50, '攻击前、回合结束:若友军更多，枪击随机敌军(14点伤害)']
    ]
  },
  {
    name: '生命之光',
    quality: '蓝',
    cost: 4,
    type: 2,
    img: '',
    data: [
      [0, 0, '英雄生命+40，若生命高于敌方英雄:召唤6/6小镇民兵-lv10'],
      [0, 0, '英雄生命+48，若生命高于敌方英雄:召唤6/6小镇民兵-lv10'],
      [0, 0, '英雄生命+50，若生命高于敌方英雄:召唤7/7小镇民兵-lv12'],
      [0, 0, '英雄生命+60，若生命高于敌方英雄:召唤8/8小镇民兵-lv13'],
      [0, 0, '英雄生命+66，若生命高于敌方英雄:召唤9/9小镇民兵-lv14'],
      [0, 0, '英雄生命+75，若生命高于敌方英雄:召唤10/10小镇民兵-lv15'],
      [0, 0, '英雄生命+80，若生命高于敌方英雄:召唤12/12小镇民兵-lv17'],
      [0, 0, '英雄生命+90，若生命高于敌方英雄:召唤13/13小镇民兵-lv18'],
      [0, 0, '英雄生命+100，若生命高于敌方英雄:召唤15/15小镇民兵-lv20']
    ]
  },
  {
    name: '四芒牧师',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [7, 20, '回合开始:另一友军生命+10'],
      [8, 22, '回合开始:另一友军生命+11'],
      [9, 24, '回合开始:另一友军生命+12'],
      [10, 26, '回合开始:另一友军生命+13'],
      [10, 30, '回合开始:另一友军生命+15'],
      [11, 33, '回合开始:另一友军生命+16'],
      [12, 35, '回合开始:另一友军生命+18'],
      [14, 38, '回合开始:另一友军生命+21'],
      [16, 42, '回合开始:另一友军生命+24']
    ]
  },
  {
    name: '精英射手',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [15, 10, '【洞察1】、【先攻】、【协战4】'],
      [16, 12, '【洞察1】、【先攻】、【协战5】'],
      [18, 14, '【洞察1】、【先攻】、【协战5】'],
      [19, 15, '【洞察1】、【先攻】、【协战6】'],
      [22, 16, '【洞察1】、【先攻】、【协战6】'],
      [24, 18, '【洞察1】、【先攻】、【协战7】'],
      [27, 20, '【洞察1】、【先攻】、【协战7】'],
      [31, 21, '【洞察1】、【先攻】、【协战8】'],
      [35, 22, '【洞察1】、【先攻】、【协战9】']
    ]
  },
  {
    name: '帝国冲锋骑士',
    quality: '蓝',
    cost: 5,
    type: 1,
    img: '',
    data: [
      [27, 12, '登场:若对面首位敌军为新进场，则将其消灭'],
      [30, 14, '登场:若对面首位敌军为新进场，则将其消灭'],
      [33, 16, '登场:若对面首位敌军为新进场，则将其消灭'],
      [36, 18, '登场:若对面首位敌军为新进场，则将其消灭'],
      [40, 20, '登场:若对面首位敌军为新进场，则将其消灭'],
      [45, 21, '登场:若对面首位敌军为新进场，则将其消灭'],
      [50, 22, '登场:若对面首位敌军为新进场，则将其消灭'],
      [55, 26, '登场:若对面首位敌军为新进场，则将其消灭'],
      [60, 30, '登场:若对面首位敌军为新进场，则将其消灭']
    ]
  },
  {
    name: '战场传教士',
    quality: '蓝',
    cost: 5,
    type: 1,
    img: '',
    data: [
      [15, 13, '登场:全体其他友军+4/+4'],
      [16, 15, '登场:全体其他友军+5/+4'],
      [18, 16, '登场:全体其他友军+5/+5'],
      [20, 17, '登场:全体其他友军+6/+5'],
      [22, 19, '登场:全体其他友军+6/+6'],
      [25, 20, '登场:全体其他友军+6/+7'],
      [27, 23, '登场:全体其他友军+7/+7'],
      [30, 25, '登场:全体其他友军+7/+8'],
      [35, 26, '登场:全体其他友军+8/+8']
    ]
  },
  {
    name: '光明惩戒',
    quality: '蓝',
    cost: 5,
    type: 2,
    img: '',
    data: [
      [0, 0, '【洞察1】、横排所有敌军受到75点伤害'],
      [0, 0, '【洞察1】、横排所有敌军受到80点伤害、30%概率获得《真理碎片》'],
      [0, 0, '【洞察1】、横排所有敌军受到90点伤害、35%概率获得《真理碎片》'],
      [0, 0, '【洞察1】、横排所有敌军受到100点伤害、35%概率获得《真理碎片》'],
      [0, 0, '【洞察1】、横排所有敌军受到110点伤害、45%概率获得《真理碎片》'],
      [0, 0, '【洞察1】、横排所有敌军受到120点伤害、45%概率获得《真理碎片》'],
      [0, 0, '【洞察1】、横排所有敌军受到130点伤害、50%概率获得《真理碎片》'],
      [0, 0, '【洞察1】、横排所有敌军受到140点伤害、50%概率获得《真理碎片》'],
      [0, 0, '【洞察1】、横排所有敌军受到150点伤害、50%概率获得《真理碎片》']
    ]
  },
  {
    name: '传记·生命序曲',
    quality: '蓝',
    cost: 1,
    type: 3,
    img: '',
    data: [
      [0, 0, '英雄生命+12，获得【传记·生命赞歌】'],
      [0, 0, '英雄生命+13，获得【传记·生命赞歌】'],
      [0, 0, '英雄生命+14，获得【传记·生命赞歌】'],
      [0, 0, '英雄生命+15，获得【传记·生命赞歌】'],
      [0, 0, '英雄生命+16，获得【传记·生命赞歌】'],
      [0, 0, '英雄生命+17，获得【传记·生命赞歌】'],
      [0, 0, '英雄生命+18，获得【传记·生命赞歌】'],
      [0, 0, '英雄生命+19，获得【传记·生命赞歌】'],
      [0, 0, '英雄生命+20，获得【传记·生命赞歌】']
    ]
  },
  {
    name: '传记·生命赞歌',
    quality: '蓝',
    cost: 2,
    type: 3,
    img: '',
    data: [
      [0, 0, '英雄生命+19，获得【传记·生命咏叹调】'],
      [0, 0, '英雄生命+21，获得【传记·生命咏叹调】'],
      [0, 0, '英雄生命+23，获得【传记·生命咏叹调】'],
      [0, 0, '英雄生命+25，获得【传记·生命咏叹调】'],
      [0, 0, '英雄生命+28，获得【传记·生命咏叹调】'],
      [0, 0, '英雄生命+30，获得【传记·生命咏叹调】'],
      [0, 0, '英雄生命+33，获得【传记·生命咏叹调】'],
      [0, 0, '英雄生命+36，获得【传记·生命咏叹调】'],
      [0, 0, '英雄生命+40，获得【传记·生命咏叹调】']
    ]
  },
  {
    name: '传记·生命咏叹调',
    quality: '蓝',
    cost: 3,
    type: 3,
    img: '',
    data: [
      [0, 0, '英雄生命+29'],
      [0, 0, '英雄生命+32'],
      [0, 0, '英雄生命+36'],
      [0, 0, '英雄生命+40'],
      [0, 0, '英雄生命+45'],
      [0, 0, '英雄生命+50'],
      [0, 0, '英雄生命+55'],
      [0, 0, '英雄生命+60'],
      [0, 0, '英雄生命+66']
    ]
  },
  {
    name: '四芒军旗',
    quality: '紫',
    cost: 1,
    type: 1,
    img: '',
    data: [
      [0, 20, '【守军】、【魔免】、登场:全体友军+4/+4、当前回合:护甲和魔防+3、回合结束:四个友军+1/+3'],
      [0, 22, '【守军】、【魔免】、登场:全体友军+4/+4、当前回合:护甲和魔防+4、回合结束:四个友军+1/+4'],
      [0, 24, '【守军】、【魔免】、登场:全体友军+4/+5、当前回合:护甲和魔防+4、回合结束:四个友军+1/+4'],
      [0, 26, '【守军】、【魔免】、登场:全体友军+4/+5、当前回合:护甲和魔防+5、回合结束:四个友军+1/+5'],
      [0, 28, '【守军】、【魔免】、登场:全体友军+5/+5、当前回合:护甲和魔防+5、回合结束:四个友军+1/+5'],
      [0, 30, '【守军】、【魔免】、登场:全体友军+5/+6、当前回合:护甲和魔防+5、回合结束:四个友军+1/+6'],
      [0, 33, '【守军】、【魔免】、登场:全体友军+6/+6、当前回合:护甲和魔防+6、回合结束:四个友军+1/+6'],
      [0, 36, '【守军】、【魔免】、登场:全体友军+6/+7、当前回合:护甲和魔防+6、回合结束:四个友军+1/+7'],
      [0, 40, '【守军】、【魔免】、登场:全体友军+7/+7、当前回合:护甲和魔防+7、回合结束:四个友军+1/+7']
    ]
  },
  {
    name: '圣殿御卫',
    quality: '紫',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [10, 14, '【洞察1】、命中英雄:召唤5/3警卫-lv6'],
      [11, 17, '【洞察1】、命中英雄:召唤6/4警卫-lv7'],
      [12, 19, '【洞察1】、命中英雄:召唤8/4警卫-lv9'],
      [13, 21, '【洞察1】、命中英雄:召唤9/5警卫-lv10'],
      [14, 23, '【洞察1】、命中英雄:召唤10/6警卫-lv11'],
      [15, 25, '【洞察1】、命中英雄:召唤12/6警卫-lv12'],
      [16, 28, '【洞察1】、命中英雄:召唤13/7警卫-lv13'],
      [18, 30, '【洞察1】、命中英雄:召唤15/7警卫-lv14'],
      [20, 32, '【洞察1】、命中英雄:召唤16/8警卫-lv15']
    ]
  },
  {
    name: '流星斗士',
    quality: '紫',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [11, 12, '【护甲2】、【协战4】、死亡:向对面横排，投掷流星锤'],
      [13, 13, '【护甲2】、【协战4】、死亡:向对面横排，投掷流星锤'],
      [14, 15, '【护甲2】、【协战5】、死亡:向对面横排，投掷流星锤'],
      [16, 16, '【护甲3】、【协战5】、死亡:向对面横排，投掷流星锤'],
      [17, 18, '【护甲3】、【协战5】、死亡:向对面横排，投掷流星锤'],
      [19, 19, '【护甲3】、【协战6】、死亡:向对面横排，投掷流星锤'],
      [20, 21, '【护甲3】、【协战6】、死亡:向对面横排，投掷流星锤'],
      [22, 22, '【护甲4】、【协战7】、死亡:向对面横排，投掷流星锤'],
      [24, 24, '【护甲4】、【协战8】、死亡:向对面横排，投掷流星锤']
    ]
  },
  {
    name: '热血冒险家',
    quality: '紫',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [11, 14, '【魔防3】、攻击前：若英雄生命高于敌方，自身+2/+3，否则获得【回命】1回合'],
      [12, 16, '【魔防4】、攻击前：若英雄生命高于敌方，自身+2/+3，否则获得【回命】1回合'],
      [13, 17, '【魔防4】、攻击前：若英雄生命高于敌方，自身+3/+3，否则获得【回命】1回合'],
      [14, 20, '【魔防5】、攻击前：若英雄生命高于敌方，自身+3/+3，否则获得【回命】1回合'],
      [15, 23, '【魔防5】、攻击前：若英雄生命高于敌方，自身+3/+4，否则获得【回命】1回合'],
      [17, 25, '【魔防6】、攻击前：若英雄生命高于敌方，自身+3/+4，否则获得【回命】1回合'],
      [19, 27, '【魔防6】、攻击前：若英雄生命高于敌方，自身+4/+4，否则获得【回命】1回合'],
      [21, 30, '【魔防7】、攻击前：若英雄生命高于敌方，自身+4/+4，否则获得【回命】1回合'],
      [22, 32, '【魔防7】、攻击前：若英雄生命高于敌方，自身+5/+5，否则获得【回命】1回合']
    ]
  },
  {
    name: '圣殿骑士',
    quality: '紫',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [11, 24, '【护甲3】、【回命】、【协战5】'],
      [13, 26, '【护甲3】、【回命】、【协战5】'],
      [15, 28, '【护甲3】、【回命】、【协战6】'],
      [17, 30, '【护甲4】、【回命】、【协战6】'],
      [19, 32, '【护甲4】、【回命】、【协战7】'],
      [21, 35, '【护甲4】、【回命】、【协战8】'],
      [23, 36, '【护甲5】、【回命】、【协战9】'],
      [25, 39, '【护甲5】、【回命】、【协战10】'],
      [27, 42, '【护甲6】、【回命】、【协战10】']
    ]
  },
  {
    name: '白袍主教',
    quality: '紫',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [9, 19, '回合开始:另一个随机友军+4/+4，其他友军+1/+2'],
      [10, 22, '回合开始:另一个随机友军+4/+4，其他友军+1/+2'],
      [11, 24, '回合开始:另一个随机友军+5/+5，其他友军+1/+2'],
      [12, 25, '回合开始:另一个随机友军+5/+5，其他友军+2/+2'],
      [13, 26, '回合开始:另一个随机友军+5/+5，其他友军+2/+3'],
      [14, 28, '回合开始:另一个随机友军+6/+6，其他友军+2/+3'],
      [16, 30, '回合开始:另一个随机友军+6/+6，其他友军+3/+3'],
      [18, 32, '回合开始:另一个随机友军+7/+7，其他友军+3/+3'],
      [20, 33, '回合开始:另一个随机友军+7/+7，其他友军+4/+4']
    ]
  },
  {
    name: '边境高墙',
    quality: '紫',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [0, 50, '【守军】、【磐龙】、【护甲3】、回合结束:【洞察1】，若场上有冰封，自身生命+6'],
      [0, 52, '【守军】、【磐龙】、【护甲4】、回合结束:【洞察1】，若场上有冰封，自身生命+7'],
      [0, 58, '【守军】、【磐龙】、【护甲4】、回合结束:【洞察1】，若场上有冰封，自身生命+8'],
      [0, 60, '【守军】、【磐龙】、【护甲5】、回合结束:【洞察1】，若场上有冰封，自身生命+10'],
      [0, 65, '【守军】、【磐龙】、【护甲5】、回合结束:【洞察1】，若场上有冰封，自身生命+12'],
      [0, 70, '【守军】、【磐龙】、【护甲6】、回合结束:【洞察1】，若场上有冰封，自身生命+13'],
      [0, 75, '【守军】、【磐龙】、【护甲6】、回合结束:【洞察1】，若场上有冰封，自身生命+15'],
      [0, 80, '【守军】、【磐龙】、【护甲7】、回合结束:【洞察1】，若场上有冰封，自身生命+15'],
      [0, 85, '【守军】、【磐龙】、【护甲8】、回合结束:【洞察1】，若场上有冰封，自身生命+15']
    ]
  },
  {
    name: '冲锋装备',
    quality: '紫',
    cost: 3,
    type: 2,
    img: '',
    data: [
      [0, 0, '目标友军+12/+16、并获得【护甲8】'],
      [0, 0, '【洞察1】、目标友军+13/+18、并获得【护甲8】'],
      [0, 0, '【洞察1】、目标友军+15/+20、并获得【护甲9】'],
      [0, 0, '【洞察1】、目标友军+18/+20、并获得【护甲10】'],
      [0, 0, '【洞察1】、目标友军+20/+22、并获得【护甲10】'],
      [0, 0, '【洞察1】、目标友军+22/+23、并获得【护甲11】'],
      [0, 0, '【洞察1】、目标友军+24/+24、并获得【护甲12】'],
      [0, 0, '【洞察1】、目标友军+25/+26、并获得【护甲13】'],
      [0, 0, '【洞察1】、目标友军+27/+27、并获得【护甲14】']
    ]
  },
  {
    name: '王城酒吧老板',
    quality: '紫',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [12, 17, '【回命】、回合开始:若英雄生命高于敌方，随机友军+2/+7并获得【魂歌】'],
      [13, 19, '【回命】、回合开始:若英雄生命高于敌方，随机友军+3/+7并获得【魂歌】'],
      [14, 22, '【回命】、回合开始:若英雄生命高于敌方，随机友军+3/+8并获得【魂歌】'],
      [15, 25, '【回命】、回合开始:若英雄生命高于敌方，随机友军+3/+9并获得【魂歌】'],
      [16, 28, '【回命】、回合开始:若英雄生命高于敌方，随机友军+4/+9并获得【魂歌】'],
      [17, 32, '【回命】、回合开始:若英雄生命高于敌方，随机友军+4/+10并获得【魂歌】'],
      [18, 36, '【回命】、回合开始:若英雄生命高于敌方，随机友军+5/+10并获得【魂歌】'],
      [20, 40, '【回命】、回合开始:若英雄生命高于敌方，随机友军+5/+12并获得【魂歌】'],
      [21, 45, '【回命】、回合开始:若英雄生命高于敌方，随机友军+6/+13并获得【魂歌】']
    ]
  },
  {
    name: '月光祭司',
    quality: '紫',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [4, 17, '登场:眩晕两个非帝国与禅意的敌军、回合结束:英雄生命+30'],
      [5, 18, '登场:眩晕两个非帝国与禅意的敌军、回合结束:英雄生命+33'],
      [6, 20, '登场:眩晕两个非帝国与禅意的敌军、回合结束:英雄生命+35'],
      [7, 21, '登场:眩晕两个非帝国与禅意的敌军、回合结束:英雄生命+40'],
      [8, 23, '登场:眩晕两个非帝国与禅意的敌军、回合结束:英雄生命+45'],
      [9, 25, '登场:眩晕两个非帝国与禅意的敌军、回合结束:英雄生命+50'],
      [10, 28, '登场:眩晕两个非帝国与禅意的敌军、回合结束:英雄生命+55'],
      [11, 32, '登场:眩晕两个非帝国与禅意的敌军、回合结束:英雄生命+62'],
      [13, 36, '登场:眩晕两个非帝国与禅意的敌军、回合结束:英雄生命+70']
    ]
  },
  {
    name: '圣殿卫队长',
    quality: '紫',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [14, 31, '【回命】、命中英雄:召唤6/8圣殿卫士-lv8'],
      [16, 34, '【回命】、命中英雄:召唤7/9圣殿卫士-lv9'],
      [18, 37, '【回命】、命中英雄:召唤8/11圣殿卫士-lv10'],
      [20, 40, '【回命】、命中英雄:召唤9/13圣殿卫士-lv11'],
      [22, 44, '【回命】、命中英雄:召唤10/15圣殿卫士-lv12'],
      [24, 48, '【回命】、命中英雄:召唤12/15圣殿卫士-lv13'],
      [26, 52, '【回命】、命中英雄:召唤13/18圣殿卫士-lv14'],
      [28, 56, '【回命】、命中英雄:召唤15/18圣殿卫士-lv15'],
      [30, 60, '【回命】、命中英雄:召唤16/21圣殿卫士-lv16']
    ]
  },
  {
    name: '光之赞歌',
    quality: '紫',
    cost: 4,
    type: 2,
    img: '',
    data: [
      [0, 0, '所有友军+8/+8，魔防+4'],
      [0, 0, '所有友军+8/+9，魔防+6'],
      [0, 0, '所有友军+9/+9，魔防+8'],
      [0, 0, '所有友军+10/+10，魔防+10'],
      [0, 0, '所有友军+11/+12，魔防+12'],
      [0, 0, '所有友军+13/+13，魔防+13'],
      [0, 0, '所有友军+14/+15，魔防+15'],
      [0, 0, '所有友军+16/+16，魔防+16'],
      [0, 0, '所有友军+18/+18，魔防+18']
    ]
  },
  {
    name: '夺取阵地',
    quality: '紫',
    cost: 4,
    type: 2,
    img: '',
    data: [
      [0, 0, '【洞察1】、将横排敌军移回玩家手上、友军横排召唤9/5警卫-lv10'],
      [0, 0, '【洞察1】、将横排敌军移回玩家手上、友军横排召唤10/6警卫-lv11'],
      [0, 0, '【洞察1】、将横排敌军移回玩家手上、友军横排召唤12/6警卫-lv12'],
      [0, 0, '【洞察1】、将横排敌军移回玩家手上、友军横排召唤13/7警卫-lv13'],
      [0, 0, '【洞察1】、将横排敌军移回玩家手上、友军横排召唤15/7警卫-lv14'],
      [0, 0, '【洞察1】、将横排敌军移回玩家手上、友军横排召唤16/8警卫-lv15'],
      [0, 0, '【洞察1】、将横排敌军移回玩家手上、友军横排召唤18/8警卫-lv16'],
      [0, 0, '【洞察1】、将横排敌军移回玩家手上、友军横排召唤19/9警卫-lv17'],
      [0, 0, '【洞察1】、将横排敌军移回玩家手上、友军横排召唤21/9警卫-lv18']
    ]
  },
  {
    name: '钢铁大师',
    quality: '紫',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [10, 35, '【护甲4】、回合结束:全体护甲友军攻击+6'],
      [12, 36, '【护甲5】、回合结束:全体护甲友军攻击+6'],
      [14, 39, '【护甲5】、回合结束:全体护甲友军攻击+7'],
      [16, 42, '【护甲6】、回合结束:全体护甲友军攻击+8'],
      [18, 46, '【护甲7】、回合结束:全体护甲友军攻击+8'],
      [20, 50, '【护甲8】、回合结束:全体护甲友军攻击+9'],
      [22, 58, '【护甲9】、回合结束:全体护甲友军攻击+10'],
      [24, 65, '【护甲10】、回合结束:全体护甲友军攻击+10'],
      [27, 70, '【护甲10】、回合结束:全体护甲友军攻击+10']
    ]
  },
  {
    name: '召集护卫',
    quality: '紫',
    cost: 4,
    type: 2,
    img: '',
    data: [
      [0, 0, '【洞察1】、在目标位置和随机位置，召唤1/25圣堂门卫-lv12、护甲友军攻击+5，获得【磐龙】1回合'],
      [0, 0, '【洞察1】、在目标位置和随机位置，召唤1/30圣堂门卫-lv13、护甲友军攻击+5，获得【磐龙】1回合'],
      [0, 0, '【洞察1】、在目标位置和随机位置，召唤1/35圣堂门卫-lv14、护甲友军攻击+6，获得【磐龙】1回合'],
      [0, 0, '【洞察1】、在目标位置和随机位置，召唤1/40圣堂门卫-lv15、护甲友军攻击+7，获得【磐龙】1回合'],
      [0, 0, '【洞察1】、在目标位置和随机位置，召唤2/40圣堂门卫-lv16、护甲友军攻击+8，获得【磐龙】1回合'],
      [0, 0, '【洞察1】、在目标位置和随机位置，召唤2/45圣堂门卫-lv17、护甲友军攻击+9，获得【磐龙】1回合'],
      [0, 0, '【洞察1】、在目标位置和随机位置，召唤2/50圣堂门卫-lv18、护甲友军攻击+10，获得【磐龙】1回合'],
      [0, 0, '【洞察1】、在目标位置和随机位置，召唤2/56圣堂门卫-lv19、护甲友军攻击+11，获得【磐龙】1回合'],
      [0, 0, '【洞察1】、在目标位置和随机位置，召唤3/60圣堂门卫-lv20、护甲友军攻击+12，获得【磐龙】1回合']
    ]
  },
  {
    name: '明光主教',
    quality: '紫',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [14, 15, '登场:横排敌军不能攻击1回合、回合开始:友军数多于敌军，随机敌军不能攻击1回合'],
      [16, 16, '登场:横排敌军不能攻击1回合、回合开始:友军数多于敌军，随机敌军不能攻击1回合'],
      [17, 18, '登场:横排敌军不能攻击1回合、回合开始:友军数多于敌军，随机敌军不能攻击1回合'],
      [19, 19, '登场:横排敌军不能攻击1回合、回合开始:友军数多于敌军，随机敌军不能攻击1回合'],
      [21, 21, '登场:横排敌军不能攻击1回合、回合开始:友军数多于敌军，随机敌军不能攻击1回合'],
      [23, 23, '登场:横排敌军不能攻击1回合、回合开始:友军数多于敌军，随机敌军不能攻击1回合'],
      [25, 25, '登场:横排敌军不能攻击1回合、回合开始:友军数多于敌军，随机敌军不能攻击1回合'],
      [28, 28, '登场:横排敌军不能攻击1回合、回合开始:友军数多于敌军，随机敌军不能攻击1回合'],
      [31, 31, '登场:横排敌军不能攻击1回合、回合开始:友军数多于敌军，随机敌军不能攻击1回合']
    ]
  },
  {
    name: '炽阳坠落',
    quality: '紫',
    cost: 4,
    type: 2,
    img: '',
    data: [
      [0, 0, '横排敌军受到27点伤害，英雄生命+27'],
      [0, 0, '横排敌军受到30点伤害，英雄生命+30'],
      [0, 0, '横排敌军受到33点伤害，英雄生命+33'],
      [0, 0, '横排敌军受到36点伤害，英雄生命+36'],
      [0, 0, '横排敌军受到40点伤害，英雄生命+40'],
      [0, 0, '横排敌军受到45点伤害，英雄生命+45'],
      [0, 0, '横排敌军受到50点伤害，英雄生命+50'],
      [0, 0, '横排敌军受到55点伤害，英雄生命+55'],
      [0, 0, '横排敌军受到60点伤害，英雄生命+60']
    ]
  },
  {
    name: '禁卫百夫长',
    quality: '紫',
    cost: 5,
    type: 1,
    img: '',
    data: [
      [16, 25, '【磐龙】、【护甲9】、【协战6】'],
      [18, 28, '【磐龙】、【护甲10】、【协战6】'],
      [20, 30, '【磐龙】、【护甲11】、【协战7】'],
      [22, 32, '【磐龙】、【护甲12】、【协战8】'],
      [25, 36, '【磐龙】、【护甲13】、【协战8】'],
      [27, 40, '【磐龙】、【护甲14】、【协战9】'],
      [30, 45, '【磐龙】、【护甲15】、【协战10】'],
      [33, 48, '【磐龙】、【护甲16】、【协战12】'],
      [36, 50, '【磐龙】、【护甲18】、【协战14】']
    ]
  },
  {
    name: '田园保卫战',
    quality: '紫',
    cost: 5,
    type: 2,
    img: '',
    data: [
      [0, 0, '回合结束:召唤4个4/15田野农夫-lv12、抓一张牌、英雄生命+35'],
      [0, 0, '回合结束:召唤4个4/18田野农夫-lv13、抓一张牌、英雄生命+40'],
      [0, 0, '回合结束:召唤4个5/20田野农夫-lv14、抓一张牌、英雄生命+45'],
      [0, 0, '回合结束:召唤4个6/22田野农夫-lv15、抓一张牌、英雄生命+50'],
      [0, 0, '回合结束:召唤4个7/24田野农夫-lv16、抓一张牌、英雄生命+55'],
      [0, 0, '回合结束:召唤4个7/28田野农夫-lv17、抓一张牌、英雄生命+60'],
      [0, 0, '回合结束:召唤4个8/30田野农夫-lv18、抓一张牌、英雄生命+65'],
      [0, 0, '回合结束:召唤4个8/33田野农夫-lv19、抓一张牌、英雄生命+70'],
      [0, 0, '回合结束:召唤4个9/35田野农夫-lv20、抓一张牌、英雄生命+75']
    ]
  },
  {
    name: '圣光主祭',
    quality: '紫',
    cost: 5,
    type: 1,
    img: '',
    data: [
      [7, 19, '登场:英雄生命+12、英雄获得生命时:另一友军+5/+10'],
      [8, 21, '登场:英雄生命+13、英雄获得生命时:另一友军+6/+10'],
      [9, 25, '登场:英雄生命+14、英雄获得生命时:另一友军+6/+12'],
      [10, 29, '登场:英雄生命+15、英雄获得生命时:另一友军+7/+13'],
      [12, 33, '登场:英雄生命+16、英雄获得生命时:另一友军+7/+15'],
      [13, 36, '登场:英雄生命+18、英雄获得生命时:另一友军+7/+17'],
      [15, 38, '登场:英雄生命+20、英雄获得生命时:另一友军+8/+18'],
      [18, 40, '登场:英雄生命+22、英雄获得生命时:另一友军+9/+19'],
      [20, 45, '登场:英雄生命+25、英雄获得生命时:另一友军+10/+20']
    ]
  },
  {
    name: '惩戒天使',
    quality: '紫',
    cost: 6,
    type: 1,
    img: '',
    data: [
      [18, 36, '【回命】、【洞察3】、登场:消灭对面横排首位新进场敌军'],
      [20, 40, '【回命】、【洞察3】、登场:消灭对面横排首位新进场敌军'],
      [22, 45, '【回命】、【洞察3】、登场:消灭对面横排首位新进场敌军'],
      [24, 50, '【回命】、【洞察3】、登场:消灭对面横排首位新进场敌军'],
      [25, 60, '【回命】、【洞察3】、登场:消灭对面横排首位新进场敌军'],
      [27, 66, '【回命】、【洞察3】、登场:消灭对面横排首位新进场敌军'],
      [30, 70, '【回命】、【洞察3】、登场:消灭对面横排首位新进场敌军'],
      [35, 75, '【回命】、【洞察3】、登场:消灭对面横排首位新进场敌军'],
      [40, 80, '【回命】、【洞察3】、登场:消灭对面横排首位新进场敌军']
    ]
  },
  {
    name: '光明圣骑士',
    quality: '紫',
    cost: 6,
    type: 1,
    img: '',
    data: [
      [20, 20, '【护甲6】、登场:英雄生命+20'],
      [23, 23, '【护甲6】、登场:英雄生命+23'],
      [26, 26, '【护甲7】、登场:英雄生命+26'],
      [30, 30, '【护甲7】、登场:英雄生命+30'],
      [33, 33, '【护甲8】、登场:英雄生命+33'],
      [36, 36, '【护甲9】、登场:英雄生命+36'],
      [40, 40, '【护甲9】、登场:英雄生命+40'],
      [45, 45, '【护甲10】、登场:英雄生命+45'],
      [50, 50, '【护甲11】、登场:英雄生命+50']
    ]
  },
  {
    name: '禁卫指挥官',
    quality: '紫',
    cost: 6,
    type: 1,
    img: '',
    data: [
      [15, 33, '【洞察1】、【护甲4】、洞察时：全体友军+3/+3'],
      [17, 35, '【洞察1】、【护甲5】、洞察时：全体友军+3/+3'],
      [18, 40, '【洞察1】、【护甲5】、洞察时：全体友军+3/+4'],
      [20, 40, '【洞察1】、【护甲5】、洞察时：全体友军+4/+4'],
      [21, 45, '【洞察1】、【护甲6】、洞察时：全体友军+4/+5'],
      [22, 48, '【洞察1】、【护甲6】、洞察时：全体友军+5/+5'],
      [25, 50, '【洞察1】、【护甲7】、洞察时：全体友军+5/+5'],
      [28, 52, '【洞察1】、【护甲7】、洞察时：全体友军+5/+6'],
      [30, 54, '【洞察1】、【护甲8】、洞察时：全体友军+6/+6']
    ]
  },
  {
    name: '皇家狮鹫',
    quality: '紫',
    cost: 7,
    type: 1,
    img: '',
    data: [
      [18, 12, '【回命】、【护甲4】、登场:召唤15/8白头狮鹫-lv12，吹飞随机敌军'],
      [21, 15, '【回命】、【护甲5】、登场:召唤16/9白头狮鹫-lv13，吹飞随机敌军'],
      [25, 18, '【回命】、【护甲5】、登场:召唤18/9白头狮鹫-lv14，吹飞随机敌军'],
      [30, 20, '【回命】、【护甲5】、登场:召唤19/9白头狮鹫-lv15，吹飞随机敌军'],
      [33, 22, '【回命】、【护甲6】、登场:召唤21/10白头狮鹫-lv16，吹飞随机敌军'],
      [36, 25, '【回命】、【护甲6】、登场:召唤23/11白头狮鹫-lv17，吹飞随机敌军'],
      [40, 28, '【回命】、【护甲7】、登场:召唤25/13白头狮鹫-lv18，吹飞随机敌军'],
      [45, 32, '【回命】、【护甲8】、登场:召唤28/16白头狮鹫-lv19，吹飞随机敌军'],
      [50, 36, '【回命】、【护甲9】、登场:召唤32/18白头狮鹫-lv20，吹飞随机敌军']
    ]
  },
  {
    name: '破城者·阿基琉斯',
    quality: '紫',
    cost: 7,
    type: 1,
    img: '',
    data: [
      [0, 80, '【迟缓】、【磐龙】、【践踏】、【护甲9】、【协战22】'],
      [0, 90, '【迟缓】、【磐龙】、【践踏】、【护甲10】、【协战25】'],
      [0, 95, '【迟缓】、【磐龙】、【践踏】、【护甲11】、【协战30】'],
      [0, 100, '【迟缓】、【磐龙】、【践踏】、【护甲12】、【协战33】'],
      [0, 110, '【迟缓】、【磐龙】、【践踏】、【护甲13】、【协战35】'],
      [0, 124, '【迟缓】、【磐龙】、【践踏】、【护甲14】、【协战38】'],
      [0, 140, '【迟缓】、【磐龙】、【践踏】、【护甲16】、【协战40】'],
      [0, 160, '【迟缓】、【磐龙】、【践踏】、【护甲18】、【协战45】'],
      [0, 180, '【迟缓】、【磐龙】、【践踏】、【护甲20】、【协战50】']
    ]
  },
  {
    name: '荣光壁垒',
    quality: '紫',
    cost: 8,
    type: 1,
    img: '',
    data: [
      [0, 100, '【磐龙】、【守军】、【护甲4】、回合结束:炮击敌横排随机区域15点伤害，炮击2次'],
      [0, 110, '【磐龙】、【守军】、【护甲5】、回合结束:炮击敌横排随机区域16点伤害，炮击2次'],
      [0, 125, '【磐龙】、【守军】、【护甲5】、回合结束:炮击敌横排随机区域17点伤害，炮击2次'],
      [0, 136, '【磐龙】、【守军】、【护甲6】、回合结束:炮击敌横排随机区域18点伤害，炮击2次'],
      [0, 150, '【磐龙】、【守军】、【护甲6】、回合结束:炮击敌横排随机区域20点伤害，炮击2次'],
      [0, 165, '【磐龙】、【守军】、【护甲7】、回合结束:炮击敌横排随机区域22点伤害，炮击2次'],
      [0, 180, '【磐龙】、【守军】、【护甲7】、回合结束:炮击敌横排随机区域25点伤害，炮击2次'],
      [0, 200, '【磐龙】、【守军】、【护甲8】、回合结束:炮击敌横排随机区域28点伤害，炮击2次'],
      [0, 220, '【磐龙】、【守军】、【护甲9】、回合结束:炮击敌横排随机区域32点伤害，炮击2次']
    ]
  },
  {
    name: '传记·钢铁守卫',
    quality: '紫',
    cost: 1,
    type: 3,
    img: '',
    data: [
      [0, 0, '前排位置召唤圣堂门卫-lv10、获得【传记·钢铁赞歌】'],
      [0, 0, '前排位置召唤圣堂门卫-lv11、获得【传记·钢铁赞歌】'],
      [0, 0, '前排位置召唤圣堂门卫-lv12、获得【传记·钢铁赞歌】'],
      [0, 0, '前排位置召唤圣堂门卫-lv13、获得【传记·钢铁赞歌】'],
      [0, 0, '前排位置召唤圣堂门卫-lv14、获得【传记·钢铁赞歌】'],
      [0, 0, '前排位置召唤圣堂门卫-lv15、获得【传记·钢铁赞歌】'],
      [0, 0, '前排位置召唤圣堂门卫-lv16、获得【传记·钢铁赞歌】'],
      [0, 0, '前排位置召唤圣堂门卫-lv17、获得【传记·钢铁赞歌】'],
      [0, 0, '前排位置召唤圣堂门卫-lv18、获得【传记·钢铁赞歌】']
    ]
  },
  {
    name: '传记·钢铁赞歌',
    quality: '紫',
    cost: 2,
    type: 3,
    img: '',
    data: [
      [0, 0, '召唤圣堂门卫-lv12，随机护甲友军获得【魂歌】、获得【传记·钢铁意志】'],
      [0, 0, '召唤圣堂门卫-lv13，随机护甲友军获得【魂歌】、获得【传记·钢铁意志】'],
      [0, 0, '召唤圣堂门卫-lv14，随机护甲友军获得【魂歌】、获得【传记·钢铁意志】'],
      [0, 0, '召唤圣堂门卫-lv15，随机护甲友军获得【魂歌】、获得【传记·钢铁意志】'],
      [0, 0, '召唤圣堂门卫-lv16，随机护甲友军获得【魂歌】、获得【传记·钢铁意志】'],
      [0, 0, '召唤圣堂门卫-lv17，随机护甲友军获得【魂歌】、获得【传记·钢铁意志】'],
      [0, 0, '召唤圣堂门卫-lv18，随机护甲友军获得【魂歌】、获得【传记·钢铁意志】'],
      [0, 0, '召唤圣堂门卫-lv19，随机护甲友军获得【魂歌】、获得【传记·钢铁意志】'],
      [0, 0, '召唤圣堂门卫-lv20，随机护甲友军获得【魂歌】、获得【传记·钢铁意志】']
    ]
  },
  {
    name: '传记·钢铁意志',
    quality: '紫',
    cost: 5,
    type: 3,
    img: '',
    data: [
      [0, 0, '全体护甲友军+8/+8，护甲+3，获得【神佑】1回合'],
      [0, 0, '全体护甲友军+9/+9，护甲+3，获得【神佑】1回合'],
      [0, 0, '全体护甲友军+9/+9，护甲+4，获得【神佑】1回合'],
      [0, 0, '全体护甲友军+10/+10，护甲+4，获得【神佑】1回合'],
      [0, 0, '全体护甲友军+11/+11，护甲+5，获得【神佑】1回合'],
      [0, 0, '全体护甲友军+12/+13，护甲+5，获得【神佑】1回合'],
      [0, 0, '全体护甲友军+14/+14，护甲+5，获得【神佑】1回合'],
      [0, 0, '全体护甲友军+15/+16，护甲+6，获得【神佑】1回合'],
      [0, 0, '全体护甲友军+17/+17，护甲+6，获得【神佑】1回合']
    ]
  },
  {
    name: '曙光·安娜贝尔',
    quality: '橙',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [8, 15, '【洞察2】、攻击前:所有友军+3/+4'],
      [10, 16, '【洞察2】、攻击前:所有友军+3/+4'],
      [11, 19, '【洞察2】、攻击前:所有友军+3/+4，魔防+1'],
      [12, 20, '【洞察2】、攻击前:所有友军+4/+4，魔防+1'],
      [13, 22, '【洞察2】、攻击前:所有友军+4/+5，魔防+1'],
      [15, 24, '【洞察2】、攻击前:所有友军+4/+5，魔防+2'],
      [16, 27, '【洞察2】、攻击前:所有友军+5/+5，魔防+2'],
      [18, 30, '【洞察2】、攻击前:所有友军+5/+6，魔防+2'],
      [20, 32, '【洞察2】、攻击前:所有友军+6/+6，魔防+3']
    ]
  },
  {
    name: '圣枪·卡罗琳',
    quality: '橙',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/diguo/shengqiangkaluolin.jpg', import.meta.url),
    data: [
      [14, 18, '【回命】、【神佑】、【护甲6】'],
      [16, 20, '【回命】、【神佑】、【护甲6】'],
      [18, 22, '【回命】、【神佑】、【护甲7】'],
      [20, 24, '【回命】、【神佑】、【护甲8】'],
      [24, 24, '【回命】、【神佑】、【护甲9】'],
      [27, 27, '【回命】、【神佑】、【护甲10】'],
      [30, 30, '【回命】、【神佑】、【护甲11】'],
      [33, 33, '【回命】、【神佑】、【护甲13】'],
      [36, 36, '【回命】、【神佑】、【护甲15】']
    ]
  },
  {
    name: '明日之音·露娜',
    quality: '橙',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [0, 7, '【魔防7】、同横排其他单位不会攻击（无视神佑和魔免）、回合结束:【洞察1】、另一友军+2/+4'],
      [0, 8, '【魔防8】、同横排其他单位不会攻击（无视神佑和魔免）、回合结束:【洞察1】、另一友军+2/+5'],
      [0, 9, '【魔防9】、同横排其他单位不会攻击（无视神佑和魔免）、回合结束:【洞察1】、另一友军+3/+5'],
      [0, 10, '【魔防10】、同横排其他单位不会攻击（无视神佑和魔免）、回合结束:【洞察1】、另一友军+3/+7'],
      [0, 12, '【魔防12】、同横排其他单位不会攻击（无视神佑和魔免）、回合结束:【洞察1】、另一友军+4/+8'],
      [0, 14, '【魔防14】、同横排其他单位不会攻击（无视神佑和魔免）、回合结束:【洞察1】、另一友军+4/+10'],
      [0, 17, '【魔防17】、同横排其他单位不会攻击（无视神佑和魔免）、回合结束:【洞察1】、另一友军+5/+10'],
      [0, 18, '【魔防18】、同横排其他单位不会攻击（无视神佑和魔免）、回合结束:【洞察1】、另一友军+6/+12'],
      [0, 20, '【魔防20】、同横排其他单位不会攻击（无视神佑和魔免）、回合结束:【洞察1】、另一友军+7/+15']
    ]
  },
  {
    name: '帝国军魂·莱哈特',
    quality: '橙',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/diguo/diguojunhunlaihate.jpg', import.meta.url),
    data: [
      [13, 29, '【磐龙】、【践踏】、【护甲4】、【协战10】'],
      [15, 32, '【磐龙】、【践踏】、【护甲5】、【协战10】'],
      [16, 36, '【磐龙】、【践踏】、【护甲5】、【协战12】'],
      [18, 40, '【磐龙】、【践踏】、【护甲6】、【协战12】'],
      [20, 42, '【磐龙】、【践踏】、【护甲7】、【协战13】'],
      [22, 50, '【磐龙】、【践踏】、【护甲7】、【协战15】'],
      [25, 58, '【磐龙】、【践踏】、【护甲8】、【协战15】'],
      [27, 60, '【磐龙】、【践踏】、【护甲8】、【协战18】'],
      [30, 65, '【磐龙】、【践踏】、【护甲8】、【协战20】']
    ]
  },
  {
    name: '正阳大主教·伊恩',
    quality: '橙',
    cost: 6,
    type: 1,
    img: '',
    data: [
      [8, 25, '登场:英雄生命+30、英雄获得生命:回复效果加倍，自身+1/+8，其他友军+2/+3'],
      [9, 27, '登场:英雄生命+35、英雄获得生命:回复效果加倍，自身+1/+9，其他友军+2/+3'],
      [10, 29, '登场:英雄生命+40、英雄获得生命:回复效果加倍，自身+1/+10，其他友军+2/+3'],
      [11, 30, '登场:英雄生命+45、英雄获得生命:回复效果加倍，自身+1/+10，其他友军+3/+3'],
      [12, 35, '登场:英雄生命+50、英雄获得生命:回复效果加倍，自身+2/+10，其他友军+3/+3'],
      [15, 40, '登场:英雄生命+55、英雄获得生命:回复效果加倍，自身+2/+10，其他友军+3/+4'],
      [16, 60, '登场:英雄生命+60、英雄获得生命:回复效果加倍，自身+3/+10，其他友军+3/+4'],
      [18, 65, '登场:英雄生命+65、英雄获得生命:回复效果加倍，自身+3/+12，其他友军+3/+4'],
      [20, 70, '登场:英雄生命+70、英雄获得生命:回复效果加倍，自身+3/+13，其他友军+4/+4']
    ]
  },
  {
    name: '炫目天使·蕾娜',
    quality: '橙',
    cost: 7,
    type: 1,
    img: '',
    data: [
      [18, 40, '登场:英雄生命+28，所有敌军本回合不能攻击，另一友军+7/+7'],
      [21, 45, '登场:英雄生命+30，所有敌军本回合不能攻击，另一友军+7/+7'],
      [23, 50, '登场:英雄生命+35，所有敌军本回合不能攻击，另一友军+8/+8'],
      [25, 55, '登场:英雄生命+40，所有敌军本回合不能攻击，另一友军+8/+8'],
      [27, 60, '登场:英雄生命+45，所有敌军本回合不能攻击，另一友军+9/+9'],
      [32, 70, '登场:英雄生命+50，所有敌军本回合不能攻击，另一友军+9/+9'],
      [35, 80, '登场:英雄生命+55，所有敌军本回合不能攻击，另一友军+10/+10'],
      [40, 95, '登场:英雄生命+60，所有敌军本回合不能攻击，另一友军+12/+12'],
      [50, 100, '登场:英雄生命+70，所有敌军本回合不能攻击，另一友军+13/+13']
    ]
  },
  {
    name: '钢铁统帅·雷蒙德',
    quality: '橙',
    cost: 8,
    type: 1,
    img: '',
    data: [
      [16, 40, '【磐龙】、【护甲3】、回合开始:全体护甲友军+5/+5，获得【连击】3回合'],
      [18, 45, '【磐龙】、【护甲4】、回合开始:全体护甲友军+5/+6，获得【连击】3回合'],
      [19, 48, '【磐龙】、【护甲4】、回合开始:全体护甲友军+6/+6，获得【连击】3回合'],
      [20, 50, '【磐龙】、【护甲5】、回合开始:全体护甲友军+7/+7，获得【连击】3回合'],
      [22, 52, '【磐龙】、【护甲5】、回合开始:全体护甲友军+8/+8，获得【连击】3回合'],
      [25, 60, '【磐龙】、【护甲6】、回合开始:全体护甲友军+8/+8，获得【连击】3回合'],
      [27, 65, '【磐龙】、【护甲6】、回合开始:全体护甲友军+9/+9，获得【连击】3回合'],
      [30, 74, '【磐龙】、【护甲7】、回合开始:全体护甲友军+9/+9，获得【连击】3回合'],
      [33, 80, '【磐龙】、【护甲8】、回合开始:全体护甲友军+10/+10，获得【连击】3回合']
    ]
  },
  {
    name: '司莫斯的光明要塞',
    quality: '橙',
    cost: 9,
    type: 1,
    img: '',
    data: [
      [0, 130, '【魔免】、【护甲7】、回合结束:炮击横排随机区域40点伤害（无视【神佑】和【魔免】）'],
      [0, 145, '【魔免】、【护甲8】、回合结束:炮击横排随机区域45点伤害（无视【神佑】和【魔免】）'],
      [0, 160, '【魔免】、【护甲9】、回合结束:炮击横排随机区域50点伤害（无视【神佑】和【魔免】）'],
      [0, 180, '【魔免】、【护甲10】、回合结束:炮击横排随机区域60点伤害（无视【神佑】和【魔免】）'],
      [0, 200, '【魔免】、【护甲11】、回合结束:炮击横排随机区域70点伤害（无视【神佑】和【魔免】）'],
      [0, 220, '【魔免】、【护甲13】、回合结束:炮击横排随机区域80点伤害（无视【神佑】和【魔免】）'],
      [0, 240, '【魔免】、【护甲15】、回合结束:炮击横排随机区域90点伤害（无视【神佑】和【魔免】）'],
      [0, 270, '【魔免】、【护甲16】、回合结束:炮击横排随机区域100点伤害（无视【神佑】和【魔免】）'],
      [0, 300, '【魔免】、【护甲18】、回合结束:炮击横排随机区域110点伤害（无视【神佑】和【魔免】）']
    ]
  }
];
