export default [
  {
    name: '凶恶幼犬',
    quality: '白',
    cost: 1,
    type: 1,
    img: '',
    data: [
      [5, 4, '对英雄伤害+7'],
      [6, 5, '对英雄伤害+7'],
      [6, 6, '对英雄伤害+8'],
      [7, 7, '对英雄伤害+8'],
      [8, 8, '对英雄伤害+8'],
      [9, 9, '对英雄伤害+8'],
      [10, 10, '对英雄伤害+8'],
      [11, 11, '对英雄伤害+9'],
      [12, 12, '对英雄伤害+10']
    ]
  },
  {
    name: '蕾拉火弹',
    quality: '白',
    cost: 1,
    type: 2,
    img: '',
    data: [
      [0, 0, '对敌方横排，投射12点伤害'],
      [0, 0, '对敌方横排，投射13点伤害'],
      [0, 0, '对敌方横排，投射14点伤害'],
      [0, 0, '对敌方横排，投射15点伤害'],
      [0, 0, '对敌方横排，投射16点伤害'],
      [0, 0, '对敌方横排，投射17点伤害'],
      [0, 0, '对敌方横排，投射18点伤害'],
      [0, 0, '对敌方横排，投射19点伤害'],
      [0, 0, '对敌方横排，投射20点伤害']
    ]
  },
  {
    name: '田野农夫',
    quality: '白',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [4, 15, '死亡:英雄生命+4'],
      [4, 18, '死亡:英雄生命+4'],
      [5, 20, '死亡:英雄生命+5'],
      [6, 22, '死亡:英雄生命+6'],
      [7, 24, '死亡:英雄生命+7'],
      [7, 28, '死亡:英雄生命+8'],
      [8, 30, '死亡:英雄生命+9'],
      [8, 33, '死亡:英雄生命+10'],
      [9, 35, '死亡:英雄生命+10']
    ]
  },
  {
    name: '水手',
    quality: '白',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [9, 9, '/'],
      [10, 10, '/'],
      [11, 11, '/'],
      [12, 12, '/'],
      [13, 13, '/'],
      [14, 14, '/'],
      [15, 15, '/'],
      [16, 17, '/'],
      [18, 18, '/']
    ]
  },
  {
    name: '排箭攻击',
    quality: '白',
    cost: 2,
    type: 2,
    img: '',
    data: [
      [0, 0, '对横排所有敌军造成13点伤害'],
      [0, 0, '对横排所有敌军造成14点伤害'],
      [0, 0, '对横排所有敌军造成15点伤害'],
      [0, 0, '对横排所有敌军造成16点伤害'],
      [0, 0, '对横排所有敌军造成17点伤害'],
      [0, 0, '对横排所有敌军造成18点伤害'],
      [0, 0, '对横排所有敌军造成19点伤害'],
      [0, 0, '对横排所有敌军造成20点伤害'],
      [0, 0, '对横排所有敌军造成21点伤害']
    ]
  },
  {
    name: '亲切的大妈',
    quality: '白',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [6, 10, '登场:另一友军+6/+6'],
      [7, 12, '登场:另一友军+6/+6'],
      [8, 12, '登场:另一友军+7/+7'],
      [9, 14, '登场:另一友军+7/+7'],
      [10, 15, '登场:另一友军+8/+8'],
      [11, 17, '登场:另一友军+8/+8'],
      [12, 19, '登场:另一友军+9/+9'],
      [13, 21, '登场:另一友军+10/+10'],
      [14, 23, '登场:另一友军+11/+11']
    ]
  },
  {
    name: '强壮工头',
    quality: '白',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [10, 20, '/'],
      [11, 22, '/'],
      [12, 24, '/'],
      [13, 26, '/'],
      [14, 30, '/'],
      [16, 32, '/'],
      [18, 35, '/'],
      [20, 38, '/'],
      [22, 42, '/']
    ]
  },
  {
    name: '走私的珍奇兽',
    quality: '蓝',
    cost: 1,
    type: 1,
    img: '',
    data: [
      [18, 28, '场上有敌军，则无法攻击、死亡:英雄生命+12'],
      [20, 30, '场上有敌军，则无法攻击、死亡:英雄生命+13'],
      [22, 35, '场上有敌军，则无法攻击、死亡:英雄生命+14'],
      [24, 40, '场上有敌军，则无法攻击、死亡:英雄生命+15'],
      [25, 45, '场上有敌军，则无法攻击、死亡:英雄生命+16'],
      [27, 50, '场上有敌军，则无法攻击、死亡:英雄生命+17'],
      [30, 55, '场上有敌军，则无法攻击、死亡:英雄生命+18'],
      [33, 60, '场上有敌军，则无法攻击、死亡:英雄生命+19'],
      [36, 66, '场上有敌军，则无法攻击、死亡:英雄生命+20']
    ]
  },
  {
    name: '邪月小魔女',
    quality: '蓝',
    cost: 1,
    type: 1,
    img: '',
    data: [
      [8, 6, '攻击前:本回合每使用过一个法术，则随机敌军-4/-4，若是传记，则自身攻击+6'],
      [9, 7, '攻击前:本回合每使用过一个法术，则随机敌军-5/-5，若是传记，则自身攻击+6'],
      [10, 8, '攻击前:本回合每使用过一个法术，则随机敌军-5/-5，若是传记，则自身攻击+7'],
      [12, 9, '攻击前:本回合每使用过一个法术，则随机敌军-5/-5，若是传记，则自身攻击+7'],
      [13, 10, '攻击前:本回合每使用过一个法术，则随机敌军-6/-6，若是传记，则自身攻击+8'],
      [15, 11, '攻击前:本回合每使用过一个法术，则随机敌军-6/-6，若是传记，则自身攻击+9'],
      [17, 12, '攻击前:本回合每使用过一个法术，则随机敌军-7/-7，若是传记，则自身攻击+9'],
      [19, 13, '攻击前:本回合每使用过一个法术，则随机敌军-7/-7，若是传记，则自身攻击+10'],
      [21, 15, '攻击前:本回合每使用过一个法术，则随机敌军-8/-8，若是传记，则自身攻击+10']
    ]
  },
  {
    name: '心灵黑洞',
    quality: '蓝',
    cost: 1,
    type: 2,
    img: '',
    data: [
      [0, 0, '目标敌军受到70点伤害，英雄受到伤害等同目标费用*3'],
      [0, 0, '目标敌军受到75点伤害，英雄受到伤害等同目标费用*3'],
      [0, 0, '目标敌军受到80点伤害，英雄受到伤害等同目标费用*3'],
      [0, 0, '目标敌军受到85点伤害，英雄受到伤害等同目标费用*3'],
      [0, 0, '目标敌军受到90点伤害，英雄受到伤害等同目标费用*3'],
      [0, 0, '目标敌军受到95点伤害，英雄受到伤害等同目标费用*3'],
      [0, 0, '目标敌军受到100点伤害，英雄受到伤害等同目标费用*3'],
      [0, 0, '目标敌军受到107点伤害，英雄受到伤害等同目标费用*3'],
      [0, 0, '目标敌军受到120点伤害，英雄受到伤害等同目标费用*4']
    ]
  },
  {
    name: '暗潮涌动',
    quality: '蓝',
    cost: 1,
    type: 2,
    img: '',
    data: [
      [0, 0, '吸取敌方英雄19点生命'],
      [0, 0, '吸取敌方英雄21点生命'],
      [0, 0, '吸取敌方英雄23点生命'],
      [0, 0, '吸取敌方英雄25点生命'],
      [0, 0, '吸取敌方英雄27点生命'],
      [0, 0, '吸取敌方英雄29点生命'],
      [0, 0, '吸取敌方英雄31点生命'],
      [0, 0, '吸取敌方英雄33点生命'],
      [0, 0, '吸取敌方英雄35点生命']
    ]
  },
  {
    name: '愤怒农夫',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [8, 13, '回合结束:自身+2/+3'],
      [9, 16, '回合结束:自身+2/+3'],
      [10, 18, '回合结束:自身+3/+3'],
      [12, 20, '回合结束:自身+3/+3'],
      [13, 22, '回合结束:自身+4/+3'],
      [15, 25, '回合结束:自身+4/+3'],
      [16, 28, '回合结束:自身+4/+4'],
      [18, 31, '回合结束:自身+4/+4'],
      [20, 33, '回合结束:自身+4/+5']
    ]
  },
  {
    name: '狡诈学徒',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [12, 8, '【洞察1】、登场:吹回对面首位新进场敌军、洞察时自身攻击+1'],
      [13, 8, '【洞察1】、登场:吹回对面首位新进场敌军、洞察时自身攻击+2'],
      [14, 10, '【洞察1】、登场:吹回对面首位新进场敌军、洞察时自身攻击+2'],
      [15, 11, '【洞察1】、登场:吹回对面首位新进场敌军、洞察时自身攻击+3'],
      [16, 13, '【洞察1】、登场:吹回对面首位新进场敌军、洞察时自身攻击+3'],
      [18, 14, '【洞察1】、登场:吹回对面首位新进场敌军、洞察时自身攻击+3'],
      [19, 15, '【洞察1】、登场:吹回对面首位新进场敌军、洞察时自身攻击+4'],
      [21, 17, '【洞察1】、登场:吹回对面首位新进场敌军、洞察时自身攻击+4'],
      [23, 18, '【洞察1】、登场:吹回对面首位新进场敌军、洞察时自身攻击+5']
    ]
  },
  {
    name: '外来隐修者',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [7, 19, '受到传承时:抓一张牌、死亡时:若具有传承，抓一张牌'],
      [8, 20, '受到传承时:抓一张牌、死亡时:若具有传承，抓一张牌'],
      [9, 22, '受到传承时:抓一张牌、死亡时:若具有传承，抓一张牌'],
      [10, 24, '受到传承时:抓一张牌、死亡时:若具有传承，抓一张牌'],
      [11, 27, '受到传承时:抓一张牌、死亡时:若具有传承，抓一张牌'],
      [13, 29, '受到传承时:抓一张牌、死亡时:若具有传承，抓一张牌'],
      [15, 31, '受到传承时:抓一张牌、死亡时:若具有传承，抓一张牌'],
      [17, 33, '受到传承时:抓一张牌、死亡时:若具有传承，抓一张牌'],
      [19, 35, '受到传承时:抓一张牌、死亡时:若具有传承，抓一张牌']
    ]
  },
  {
    name: '黑夜射手',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [12, 10, '命中英雄:【洞察1】，随机敌军受到5点伤害'],
      [13, 12, '命中英雄:【洞察1】，随机敌军受到5点伤害'],
      [14, 13, '命中英雄:【洞察1】，随机敌军受到6点伤害'],
      [16, 15, '命中英雄:【洞察1】，随机敌军受到6点伤害'],
      [17, 17, '命中英雄:【洞察1】，随机敌军受到7点伤害'],
      [19, 18, '命中英雄:【洞察1】，随机敌军受到7点伤害'],
      [20, 20, '命中英雄:【洞察1】，随机敌军受到8点伤害'],
      [22, 22, '命中英雄:【洞察1】，随机敌军受到8点伤害'],
      [24, 24, '命中英雄:【洞察1】，随机敌军受到9点伤害']
    ]
  },
  {
    name: '黑水快剑手',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [10, 5, '【先攻】、登场:吸取敌方英雄6点生命'],
      [11, 6, '【先攻】、登场:吸取敌方英雄7点生命'],
      [12, 7, '【先攻】、登场:吸取敌方英雄8点生命'],
      [13, 9, '【先攻】、登场:吸取敌方英雄9点生命'],
      [15, 9, '【先攻】、登场:吸取敌方英雄10点生命'],
      [17, 9, '【先攻】、登场:吸取敌方英雄11点生命'],
      [19, 10, '【先攻】、登场:吸取敌方英雄12点生命'],
      [21, 12, '【先攻】、登场:吸取敌方英雄13点生命'],
      [23, 13, '【先攻】、登场:吸取敌方英雄15点生命']
    ]
  },
  {
    name: '亡命之徒',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [14, 4, '【洞察1】、【暴露1】、对英雄伤害+5'],
      [16, 4, '【洞察1】、【暴露1】、对英雄伤害+5'],
      [18, 5, '【洞察1】、【暴露1】、对英雄伤害+6'],
      [20, 6, '【洞察1】、【暴露1】、对英雄伤害+6'],
      [22, 7, '【洞察1】、【暴露1】、对英雄伤害+7'],
      [24, 8, '【洞察1】、【暴露1】、对英雄伤害+7'],
      [25, 9, '【洞察1】、【暴露1】、对英雄伤害+8'],
      [27, 9, '【洞察1】、【暴露1】、对英雄伤害+9'],
      [29, 10, '【洞察1】、【暴露1】、对英雄伤害+10']
    ]
  },
  {
    name: '黑夜突袭',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: '',
    data: [
      [0, 0, '【洞察1】、对随机单位造成32点伤害'],
      [0, 0, '【洞察1】、对随机单位造成35点伤害'],
      [0, 0, '【洞察1】、对随机单位造成38点伤害'],
      [0, 0, '【洞察1】、对随机单位造成42点伤害'],
      [0, 0, '【洞察1】、对随机单位造成45点伤害'],
      [0, 0, '【洞察1】、对随机单位造成47点伤害'],
      [0, 0, '【洞察1】、对随机单位造成50点伤害'],
      [0, 0, '【洞察1】、对随机单位造成53点伤害'],
      [0, 0, '【洞察1】、对随机单位造成56点伤害']
    ]
  },
  {
    name: '连锁电光',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: '',
    data: [
      [0, 0, '目标受到15点伤害，相邻敌军受到9点伤害'],
      [0, 0, '目标受到18点伤害，相邻敌军受到10点伤害'],
      [0, 0, '目标受到21点伤害，相邻敌军受到11点伤害'],
      [0, 0, '目标受到24点伤害，相邻敌军受到12点伤害'],
      [0, 0, '目标受到25点伤害，相邻敌军受到15点伤害'],
      [0, 0, '目标受到27点伤害，相邻敌军受到16点伤害'],
      [0, 0, '目标受到30点伤害，相邻敌军受到16点伤害'],
      [0, 0, '目标受到33点伤害，相邻敌军受到17点伤害'],
      [0, 0, '目标受到36点伤害，相邻敌军受到18点伤害']
    ]
  },
  {
    name: '火祭邪灵',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: '',
    data: [
      [0, 0, '回合结束:召唤9/20血炎焦木-lv12'],
      [0, 0, '回合结束:召唤10/23血炎焦木-lv13'],
      [0, 0, '回合结束:召唤11/26血炎焦木-lv14'],
      [0, 0, '回合结束:召唤12/30血炎焦木-lv15'],
      [0, 0, '回合结束:召唤13/35血炎焦木-lv16'],
      [0, 0, '回合结束:召唤15/37血炎焦木-lv17'],
      [0, 0, '回合结束:召唤17/40血炎焦木-lv18'],
      [0, 0, '回合结束:召唤19/43血炎焦木-lv19'],
      [0, 0, '回合结束:召唤20/49血炎焦木-lv20']
    ]
  },
  {
    name: '暗潮术士',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [8, 10, '死亡、回合结束获得《暗潮涌动》-lv5'],
      [9, 11, '死亡、回合结束获得《暗潮涌动》-lv6'],
      [10, 12, '死亡、回合结束获得《暗潮涌动》-lv7'],
      [11, 13, '死亡、回合结束获得《暗潮涌动》-lv8'],
      [13, 14, '死亡、回合结束获得《暗潮涌动》-lv9'],
      [15, 14, '死亡、回合结束获得《暗潮涌动》-lv10'],
      [16, 16, '死亡、回合结束获得《暗潮涌动》-lv11'],
      [18, 18, '死亡、回合结束获得《暗潮涌动》-lv12'],
      [20, 20, '死亡、回合结束获得《暗潮涌动》-lv13']
    ]
  },
  {
    name: '窃笑雪人',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [11, 15, '【守军】、【荆棘】、登场：冰封脚下'],
      [12, 17, '【守军】、【荆棘】、登场：冰封脚下'],
      [14, 18, '【守军】、【荆棘】、登场：冰封脚下'],
      [16, 20, '【守军】、【荆棘】、登场：冰封脚下'],
      [18, 22, '【守军】、【荆棘】、登场：冰封脚下'],
      [20, 25, '【守军】、【荆棘】、登场：冰封脚下'],
      [22, 28, '【守军】、【荆棘】、登场：冰封脚下'],
      [25, 31, '【守军】、【荆棘】、登场：冰封脚下'],
      [28, 35, '【守军】、【荆棘】、登场：冰封脚下']
    ]
  },
  {
    name: '传记学者',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [9, 13, '回合开始:每使用过一个法术或传记，随机友军+1/+5、初次使用传记:抽一张牌、【洞察1】'],
      [9, 16, '回合开始:每使用过一个法术或传记，随机友军+1/+5、初次使用传记:抽一张牌、【洞察1】'],
      [10, 18, '回合开始:每使用过一个法术或传记，随机友军+1/+5、初次使用传记:抽一张牌、【洞察1】'],
      [11, 19, '回合开始:每使用过一个法术或传记，随机友军+1/+6、初次使用传记:抽一张牌、【洞察1】'],
      [12, 21, '回合开始:每使用过一个法术或传记，随机友军+1/+7、初次使用传记:抽一张牌、【洞察1】'],
      [14, 22, '回合开始:每使用过一个法术或传记，随机友军+1/+8、初次使用传记:抽一张牌、【洞察1】'],
      [16, 24, '回合开始:每使用过一个法术或传记，随机友军+1/+9、初次使用传记:抽一张牌、【洞察1】'],
      [18, 27, '回合开始:每使用过一个法术或传记，随机友军+1/+10、初次使用传记:抽一张牌、【洞察1】'],
      [20, 30, '回合开始:每使用过一个法术或传记，随机友军+2/+10、初次使用传记:抽一张牌、【洞察1】']
    ]
  },
  {
    name: '热血矿工',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [10, 20, '【洞察1】、回合结束、死亡时:向敌方英雄投掷铁镐'],
      [11, 24, '【洞察1】、回合结束、死亡时:向敌方英雄投掷铁镐'],
      [12, 27, '【洞察1】、回合结束、死亡时:向敌方英雄投掷铁镐'],
      [13, 30, '【洞察1】、回合结束、死亡时:向敌方英雄投掷铁镐'],
      [15, 32, '【洞察1】、回合结束、死亡时:向敌方英雄投掷铁镐'],
      [16, 37, '【洞察1】、回合结束、死亡时:向敌方英雄投掷铁镐'],
      [18, 40, '【洞察1】、回合结束、死亡时:向敌方英雄投掷铁镐'],
      [20, 45, '【洞察1】、回合结束、死亡时:向敌方英雄投掷铁镐'],
      [22, 50, '【洞察1】、回合结束、死亡时:向敌方英雄投掷铁镐']
    ]
  },
  {
    name: '酗酒暴徒',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [7, 22, '回合结束:若英雄生命高于敌方，自身+5/+5，获得【磐龙】'],
      [8, 25, '回合结束:若英雄生命高于敌方，自身+5/+5，获得【磐龙】'],
      [9, 27, '回合结束:若英雄生命高于敌方，自身+6/+6，获得【磐龙】'],
      [10, 30, '回合结束:若英雄生命高于敌方，自身+6/+6，获得【磐龙】'],
      [12, 32, '回合结束:若英雄生命高于敌方，自身+6/+6，获得【磐龙】'],
      [13, 36, '回合结束:若英雄生命高于敌方，自身+7/+7，获得【磐龙】'],
      [15, 40, '回合结束:若英雄生命高于敌方，自身+7/+7，获得【磐龙】'],
      [16, 45, '回合结束:若英雄生命高于敌方，自身+8/+8，获得【磐龙】'],
      [18, 50, '回合结束:若英雄生命高于敌方，自身+8/+8，获得【磐龙】']
    ]
  },
  {
    name: '教廷学者',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [10, 18, '回合开始:随机四芒帝国友军和隐秘友军+2/+6，获得【护甲1】'],
      [12, 20, '回合开始:随机四芒帝国友军和隐秘友军+2/+7，获得【护甲1】'],
      [13, 23, '回合开始:随机四芒帝国友军和隐秘友军+2/+7，获得【护甲2】'],
      [15, 24, '回合开始:随机四芒帝国友军和隐秘友军+2/+8，获得【护甲2】'],
      [17, 25, '回合开始:随机四芒帝国友军和隐秘友军+3/+8，获得【护甲2】'],
      [19, 27, '回合开始:随机四芒帝国友军和隐秘友军+3/+9，获得【护甲2】'],
      [21, 30, '回合开始:随机四芒帝国友军和隐秘友军+3/+10，获得【护甲2】'],
      [24, 32, '回合开始:随机四芒帝国友军和隐秘友军+3/+11，获得【护甲2】'],
      [27, 35, '回合开始:随机四芒帝国友军和隐秘友军+3/+12，获得【护甲2】']
    ]
  },
  {
    name: '黑金刽子手',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [21, 16, '【迟缓】、【践踏】、对英雄伤害+3'],
      [23, 18, '【迟缓】、【践踏】、对英雄伤害+4'],
      [25, 20, '【迟缓】、【践踏】、对英雄伤害+5'],
      [27, 22, '【迟缓】、【践踏】、对英雄伤害+6'],
      [30, 24, '【迟缓】、【践踏】、对英雄伤害+7'],
      [33, 27, '【迟缓】、【践踏】、对英雄伤害+8'],
      [35, 30, '【迟缓】、【践踏】、对英雄伤害+9'],
      [39, 35, '【迟缓】、【践踏】、对英雄伤害+10'],
      [43, 36, '【迟缓】、【践踏】、对英雄伤害+11']
    ]
  },
  {
    name: '沙湾骆驼',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [3, 21, '法力上限+1、登场:两个其他友军+2/+3'],
      [3, 25, '法力上限+1、登场:两个其他友军+2/+3'],
      [4, 26, '法力上限+1、登场:两个其他友军+3/+3'],
      [4, 30, '法力上限+1、登场:两个其他友军+3/+4'],
      [5, 33, '法力上限+1、登场:两个其他友军+3/+5'],
      [5, 38, '法力上限+1、登场:两个其他友军+3/+5'],
      [6, 40, '法力上限+1、登场:两个其他友军+3/+6'],
      [7, 45, '法力上限+1、登场:两个其他友军+3/+8'],
      [8, 50, '法力上限+1、登场:两个其他友军+4/+8']
    ]
  },
  {
    name: '海燕迫击炮',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [0, 30, '【守军】、【协战8】、回合开始:炮击敌军横排随机区域'],
      [0, 35, '【守军】、【协战9】、回合开始:炮击敌军横排随机区域'],
      [0, 40, '【守军】、【协战10】、回合开始:炮击敌军横排随机区域'],
      [0, 45, '【守军】、【协战11】、回合开始:炮击敌军横排随机区域'],
      [0, 50, '【守军】、【协战12】、回合开始:炮击敌军横排随机区域'],
      [0, 55, '【守军】、【协战13】、回合开始:炮击敌军横排随机区域'],
      [0, 60, '【守军】、【协战15】、回合开始:炮击敌军横排随机区域'],
      [0, 65, '【守军】、【协战17】、回合开始:炮击敌军横排随机区域'],
      [0, 70, '【守军】、【协战19】、回合开始:炮击敌军横排随机区域']
    ]
  },
  {
    name: '黑旗舰队水手',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [10, 20, '攻击前:若英雄生命高于敌方，自身+2/+4'],
      [11, 24, '攻击前:若英雄生命高于敌方，自身+2/+4'],
      [13, 25, '攻击前:若英雄生命高于敌方，自身+2/+5'],
      [15, 28, '攻击前:若英雄生命高于敌方，自身+2/+5'],
      [16, 30, '攻击前:若英雄生命高于敌方，自身+3/+5'],
      [18, 33, '攻击前:若英雄生命高于敌方，自身+3/+5'],
      [20, 36, '攻击前:若英雄生命高于敌方，自身+3/+6'],
      [23, 40, '攻击前:若英雄生命高于敌方，自身+3/+7'],
      [25, 45, '攻击前:若英雄生命高于敌方，自身+3/+8']
    ]
  },
  {
    name: '魔力风暴',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: '',
    data: [
      [0, 0, '对横排所有敌军造成18点伤害、65%几率获得《真理石碎片》'],
      [0, 0, '对横排所有敌军造成19点伤害、70%几率获得《真理石碎片》'],
      [0, 0, '对横排所有敌军造成21点伤害、70%几率获得《真理石碎片》'],
      [0, 0, '对横排所有敌军造成23点伤害、75%几率获得《真理石碎片》'],
      [0, 0, '对横排所有敌军造成25点伤害、75%几率获得《真理石碎片》'],
      [0, 0, '对横排所有敌军造成27点伤害、75%几率获得《真理石碎片》'],
      [0, 0, '对横排所有敌军造成30点伤害、75%几率获得《真理石碎片》'],
      [0, 0, '对横排所有敌军造成32点伤害、75%几率获得《真理石碎片》'],
      [0, 0, '对横排所有敌军造成35点伤害、75%几率获得《真理石碎片》']
    ]
  },
  {
    name: '不法交易',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: '',
    data: [
      [0, 0, '【洞察1】、英雄生命-2，抽两张牌、敌方英雄生命-15'],
      [0, 0, '【洞察1】、英雄生命-2，抽两张牌、敌方英雄生命-17'],
      [0, 0, '【洞察1】、英雄生命-2，抽两张牌、敌方英雄生命-20'],
      [0, 0, '【洞察1】、英雄生命-2，抽两张牌、敌方英雄生命-24'],
      [0, 0, '【洞察1】、英雄生命-2，抽两张牌、敌方英雄生命-30'],
      [0, 0, '【洞察1】、英雄生命-2，抽两张牌、敌方英雄生命-35'],
      [0, 0, '【洞察1】、英雄生命-2，抽两张牌、敌方英雄生命-40'],
      [0, 0, '【洞察1】、英雄生命-2，抽两张牌、敌方英雄生命-44'],
      [0, 0, '【洞察1】、英雄生命-2，抽两张牌、敌方英雄生命-48']
    ]
  },
  {
    name: '黑市商人',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [7, 19, '【魔防5】、攻击前：人数多于敌方，吸取敌方英雄7点生命'],
      [8, 19, '【魔防5】、攻击前：人数多于敌方，吸取敌方英雄8点生命'],
      [9, 19, '【魔防6】、攻击前：人数多于敌方，吸取敌方英雄9点生命'],
      [10, 20, '【魔防7】、攻击前：人数多于敌方，吸取敌方英雄10点生命'],
      [11, 22, '【魔防7】、攻击前：人数多于敌方，吸取敌方英雄11点生命'],
      [12, 25, '【魔防8】、攻击前：人数多于敌方，吸取敌方英雄12点生命'],
      [13, 29, '【魔防9】、攻击前：人数多于敌方，吸取敌方英雄13点生命'],
      [14, 33, '【魔防10】、攻击前：人数多于敌方，吸取敌方英雄14点生命'],
      [15, 36, '【魔防12】、攻击前：人数多于敌方，吸取敌方英雄15点生命']
    ]
  },
  {
    name: '掠夺草人',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [0, 13, '登场：敌方受到12点伤害、每当一个敌军死亡：随机友军攻击+4'],
      [0, 15, '登场：敌方受到13点伤害、每当一个敌军死亡：随机友军攻击+4'],
      [0, 17, '登场：敌方受到14点伤害、每当一个敌军死亡：随机友军攻击+5'],
      [0, 20, '登场：敌方受到16点伤害、每当一个敌军死亡：随机友军攻击+5'],
      [0, 22, '登场：敌方受到18点伤害、每当一个敌军死亡：随机友军攻击+6'],
      [0, 25, '登场：敌方受到20点伤害、每当一个敌军死亡：随机友军攻击+6'],
      [0, 28, '登场：敌方受到22点伤害、每当一个敌军死亡：随机友军攻击+7'],
      [0, 32, '登场：敌方受到24点伤害、每当一个敌军死亡：随机友军攻击+7'],
      [0, 36, '登场：敌方受到26点伤害、每当一个敌军死亡：随机友军攻击+8']
    ]
  },
  {
    name: '节日南瓜',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: '',
    data: [
      [0, 0, '全体友军+3/+4、英雄生命+12'],
      [0, 0, '全体友军+3/+4、英雄生命+15'],
      [0, 0, '全体友军+3/+5、英雄生命+15'],
      [0, 0, '全体友军+4/+5、英雄生命+15'],
      [0, 0, '全体友军+5/+5、英雄生命+15'],
      [0, 0, '全体友军+5/+6、英雄生命+15'],
      [0, 0, '全体友军+6/+6、英雄生命+16'],
      [0, 0, '全体友军+6/+7、英雄生命+17'],
      [0, 0, '全体友军+7/+7、英雄生命+18']
    ]
  },
  {
    name: '酗酒醉汉',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [11, 23, '登场、每当一个敌军死亡时:酒瓶投掷敌方横排随机区域（11点伤害）'],
      [12, 26, '登场、每当一个敌军死亡时:酒瓶投掷敌方横排随机区域（12点伤害）'],
      [13, 29, '登场、每当一个敌军死亡时:酒瓶投掷敌方横排随机区域（13点伤害）'],
      [14, 32, '登场、每当一个敌军死亡时:酒瓶投掷敌方横排随机区域（14点伤害）'],
      [15, 35, '登场、每当一个敌军死亡时:酒瓶投掷敌方横排随机区域（15点伤害）'],
      [16, 39, '登场、每当一个敌军死亡时:酒瓶投掷敌方横排随机区域（16点伤害）'],
      [18, 40, '登场、每当一个敌军死亡时:酒瓶投掷敌方横排随机区域（18点伤害）'],
      [20, 42, '登场、每当一个敌军死亡时:酒瓶投掷敌方横排随机区域（20点伤害）'],
      [22, 45, '登场、每当一个敌军死亡时:酒瓶投掷敌方横排随机区域（22点伤害）']
    ]
  },
  {
    name: '心灵风暴',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: '',
    data: [
      [0, 0, '目标区域敌军吹回手上（敌军等级<=12）、敌方玩家弃一张牌'],
      [0, 0, '目标区域敌军吹回手上（敌军等级<=13）、敌方玩家弃一张牌'],
      [0, 0, '目标区域敌军吹回手上（敌军等级<=14）、敌方玩家弃一张牌'],
      [0, 0, '目标区域敌军吹回手上（敌军等级<=15）、敌方玩家弃一张牌'],
      [0, 0, '目标区域敌军吹回手上（敌军等级<=16）、敌方玩家弃一张牌'],
      [0, 0, '目标区域敌军吹回手上（敌军等级<=17）、敌方玩家弃一张牌'],
      [0, 0, '目标区域敌军吹回手上（敌军等级<=18）、敌方玩家弃一张牌'],
      [0, 0, '目标区域敌军吹回手上（敌军等级<=19）、敌方玩家弃一张牌'],
      [0, 0, '目标区域敌军吹回手上（敌军等级<=20）、敌方玩家弃一张牌']
    ]
  },
  {
    name: '南瓜大婶',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [10, 26, '登场:将南瓜扔向随机敌军，10点伤害'],
      [11, 29, '登场:将南瓜扔向随机敌军，11点伤害'],
      [12, 33, '登场:将南瓜扔向随机敌军，12点伤害'],
      [13, 38, '登场:将南瓜扔向随机敌军，13点伤害'],
      [15, 40, '登场:将南瓜扔向随机敌军，15点伤害'],
      [17, 43, '登场:将南瓜扔向随机敌军，17点伤害'],
      [19, 48, '登场:将南瓜扔向随机敌军，19点伤害'],
      [21, 52, '登场:将南瓜扔向随机敌军，21点伤害'],
      [24, 56, '登场:将南瓜扔向随机敌军，24点伤害']
    ]
  },
  {
    name: '妖娆女巫',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [14, 14, '攻击前:本回合你使用过法术，随机敌军回手，自身攻击+5，若是传记，另一友军+5/+5'],
      [15, 15, '攻击前:本回合你使用过法术，随机敌军回手，自身攻击+6，若是传记，另一友军+6/+6'],
      [17, 17, '攻击前:本回合你使用过法术，随机敌军回手，自身攻击+7，若是传记，另一友军+7/+7'],
      [19, 19, '攻击前:本回合你使用过法术，随机敌军回手，自身攻击+8，若是传记，另一友军+8/+8'],
      [21, 21, '攻击前:本回合你使用过法术，随机敌军回手，自身攻击+9，若是传记，另一友军+9/+9'],
      [23, 23, '攻击前:本回合你使用过法术，随机敌军回手，自身攻击+10，若是传记，另一友军+10/+10'],
      [25, 25, '攻击前:本回合你使用过法术，随机敌军回手，自身攻击+11，若是传记，另一友军+11/+11'],
      [27, 27, '攻击前:本回合你使用过法术，随机敌军回手，自身攻击+12，若是传记，另一友军+12/+12'],
      [30, 30, '攻击前:本回合你使用过法术，随机敌军回手，自身攻击+13，若是传记，另一友军+13/+13']
    ]
  },
  {
    name: '黑旗舰队飞斧手',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [12, 27, '攻击前:若英雄生命高于敌方，向对面横排投掷飞斧，12点伤害'],
      [13, 31, '攻击前:若英雄生命高于敌方，向对面横排投掷飞斧，13点伤害'],
      [15, 33, '攻击前:若英雄生命高于敌方，向对面横排投掷飞斧，15点伤害'],
      [16, 39, '攻击前:若英雄生命高于敌方，向对面横排投掷飞斧，16点伤害'],
      [18, 40, '攻击前:若英雄生命高于敌方，向对面横排投掷飞斧，18点伤害'],
      [20, 42, '攻击前:若英雄生命高于敌方，向对面横排投掷飞斧，20点伤害'],
      [22, 45, '攻击前:若英雄生命高于敌方，向对面横排投掷飞斧，22点伤害'],
      [25, 47, '攻击前:若英雄生命高于敌方，向对面横排投掷飞斧，25点伤害'],
      [28, 50, '攻击前:若英雄生命高于敌方，向对面横排投掷飞斧，28点伤害']
    ]
  },
  {
    name: '电光术士',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [11, 9, '登场：敌方随机位置坠落闪电（11点伤害）、攻击前：人数高于对手，坠落闪电'],
      [12, 10, '登场：敌方随机位置坠落闪电（12点伤害）、攻击前：人数高于对手，坠落闪电'],
      [13, 12, '登场：敌方随机位置坠落闪电（13点伤害）、攻击前：人数高于对手，坠落闪电'],
      [14, 14, '登场：敌方随机位置坠落闪电（14点伤害）、攻击前：人数高于对手，坠落闪电'],
      [15, 16, '登场：敌方随机位置坠落闪电（15点伤害）、攻击前：人数高于对手，坠落闪电'],
      [17, 17, '登场：敌方随机位置坠落闪电（17点伤害）、攻击前：人数高于对手，坠落闪电'],
      [19, 19, '登场：敌方随机位置坠落闪电（19点伤害）、攻击前：人数高于对手，坠落闪电'],
      [21, 21, '登场：敌方随机位置坠落闪电（21点伤害）、攻击前：人数高于对手，坠落闪电'],
      [24, 24, '登场：敌方随机位置坠落闪电（24点伤害）、攻击前：人数高于对手，坠落闪电']
    ]
  },
  {
    name: '恶犬屠夫',
    quality: '蓝',
    cost: 5,
    type: 1,
    img: '',
    data: [
      [8, 26, '登场:召唤2个3/3凶恶幼犬-lv9'],
      [10, 28, '登场:召唤2个3/3凶恶幼犬-lv10'],
      [11, 33, '登场:召唤2个4/4凶恶幼犬-lv11'],
      [13, 36, '登场:召唤2个5/4凶恶幼犬-lv12'],
      [15, 40, '登场:召唤2个6/5凶恶幼犬-lv13'],
      [16, 46, '登场:召唤2个6/6凶恶幼犬-lv14'],
      [18, 50, '登场:召唤2个7/7凶恶幼犬-lv15'],
      [21, 55, '登场:召唤2个8/8凶恶幼犬-lv16'],
      [24, 60, '登场:召唤2个9/9凶恶幼犬-lv17']
    ]
  },
  {
    name: '传记·风暴之夜',
    quality: '蓝',
    cost: 1,
    type: 3,
    img: '',
    data: [
      [0, 0, '敌方生命-12、获得【传记·抢滩登陆】'],
      [0, 0, '敌方生命-13、获得【传记·抢滩登陆】'],
      [0, 0, '敌方生命-14、获得【传记·抢滩登陆】'],
      [0, 0, '敌方生命-15、获得【传记·抢滩登陆】'],
      [0, 0, '敌方生命-16、获得【传记·抢滩登陆】'],
      [0, 0, '敌方生命-17、获得【传记·抢滩登陆】'],
      [0, 0, '敌方生命-18、获得【传记·抢滩登陆】'],
      [0, 0, '敌方生命-19、获得【传记·抢滩登陆】'],
      [0, 0, '敌方生命-20、获得【传记·抢滩登陆】']
    ]
  },
  {
    name: '传记·抢滩登陆',
    quality: '蓝',
    cost: 2,
    type: 3,
    img: '',
    data: [
      [0, 0, '掠夺敌方英雄12点生命、获得【传记·残酷掠夺】'],
      [0, 0, '掠夺敌方英雄13点生命、获得【传记·残酷掠夺】'],
      [0, 0, '掠夺敌方英雄14点生命、获得【传记·残酷掠夺】'],
      [0, 0, '掠夺敌方英雄15点生命、获得【传记·残酷掠夺】'],
      [0, 0, '掠夺敌方英雄16点生命、获得【传记·残酷掠夺】'],
      [0, 0, '掠夺敌方英雄17点生命、获得【传记·残酷掠夺】'],
      [0, 0, '掠夺敌方英雄18点生命、获得【传记·残酷掠夺】'],
      [0, 0, '掠夺敌方英雄19点生命、获得【传记·残酷掠夺】'],
      [0, 0, '掠夺敌方英雄20点生命、获得【传记·残酷掠夺】']
    ]
  },
  {
    name: '传记·残酷掠夺',
    quality: '蓝',
    cost: 3,
    type: 3,
    img: '',
    data: [
      [0, 0, '掠夺敌方英雄12点生命、若你的生命高于对手:召唤水手-lv12'],
      [0, 0, '掠夺敌方英雄13点生命、若你的生命高于对手:召唤水手-lv13'],
      [0, 0, '掠夺敌方英雄14点生命、若你的生命高于对手:召唤水手-lv14'],
      [0, 0, '掠夺敌方英雄15点生命、若你的生命高于对手:召唤水手-lv15'],
      [0, 0, '掠夺敌方英雄16点生命、若你的生命高于对手:召唤水手-lv16'],
      [0, 0, '掠夺敌方英雄17点生命、若你的生命高于对手:召唤水手-lv17'],
      [0, 0, '掠夺敌方英雄18点生命、若你的生命高于对手:召唤水手-lv18'],
      [0, 0, '掠夺敌方英雄19点生命、若你的生命高于对手:召唤水手-lv19'],
      [0, 0, '掠夺敌方英雄20点生命、若你的生命高于对手:召唤水手-lv20']
    ]
  },
  {
    name: '走私狂徒',
    quality: '紫',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [9, 4, '【洞察1】、登场:召唤18/28珍奇兽-lv12'],
      [10, 5, '【洞察1】、登场:召唤20/30珍奇兽-lv13'],
      [11, 5, '【洞察1】、登场:召唤22/35珍奇兽-lv14'],
      [12, 6, '【洞察1】、登场:召唤24/40珍奇兽-lv15'],
      [13, 7, '【洞察1】、登场:召唤25/45珍奇兽-lv16'],
      [15, 8, '【洞察1】、登场:召唤27/50珍奇兽-lv17'],
      [16, 10, '【洞察1】、登场:召唤30/55珍奇兽-lv18'],
      [18, 10, '【洞察1】、登场:召唤33/60珍奇兽-lv19'],
      [20, 10, '【洞察1】、登场:召唤36/66珍奇兽-lv20']
    ]
  },
  {
    name: '异域驯兽使',
    quality: '紫',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [13, 14, '【洞察1】、唤醒其他迟缓友军、登场:本回合隐形'],
      [15, 15, '【洞察1】、唤醒其他迟缓友军、登场:本回合隐形'],
      [17, 17, '【洞察1】、唤醒其他迟缓友军、登场:本回合隐形'],
      [19, 19, '【洞察1】、唤醒其他迟缓友军、登场:本回合隐形'],
      [21, 21, '【洞察1】、唤醒其他迟缓友军、登场:本回合隐形'],
      [23, 23, '【洞察1】、唤醒其他迟缓友军、登场:本回合隐形'],
      [25, 25, '【洞察1】、唤醒其他迟缓友军、登场:本回合隐形'],
      [27, 27, '【洞察1】、唤醒其他迟缓友军、登场:本回合隐形'],
      [29, 29, '【洞察1】、唤醒其他迟缓友军、登场:本回合隐形']
    ]
  },
  {
    name: '海燕精卫',
    quality: '紫',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [8, 13, '登场:【枪击】、攻击前:友军多于敌军则【枪击】，无敌军则枪击英雄'],
      [9, 14, '登场:【枪击】、攻击前:友军多于敌军则【枪击】，无敌军则枪击英雄'],
      [10, 16, '登场:【枪击】、攻击前:友军多于敌军则【枪击】，无敌军则枪击英雄'],
      [11, 18, '登场:【枪击】、攻击前:友军多于敌军则【枪击】，无敌军则枪击英雄'],
      [12, 20, '登场:【枪击】、攻击前:友军多于敌军则【枪击】，无敌军则枪击英雄'],
      [14, 22, '登场:【枪击】、攻击前:友军多于敌军则【枪击】，无敌军则枪击英雄'],
      [16, 24, '登场:【枪击】、攻击前:友军多于敌军则【枪击】，无敌军则枪击英雄'],
      [18, 26, '登场:【枪击】、攻击前:友军多于敌军则【枪击】，无敌军则枪击英雄'],
      [20, 29, '登场:【枪击】、攻击前:友军多于敌军则【枪击】，无敌军则枪击英雄']
    ]
  },
  {
    name: '红海猎魔人',
    quality: '紫',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [13, 7, '【洞察1】、【先攻】、攻击前:本回合你每使用过一个法术或传记，随机敌军生命-3，自身攻击+3'],
      [14, 8, '【洞察1】、【先攻】、攻击前:本回合你每使用过一个法术或传记，随机敌军生命-4，自身攻击+3'],
      [15, 9, '【洞察1】、【先攻】、攻击前:本回合你每使用过一个法术或传记，随机敌军生命-4，自身攻击+4'],
      [16, 10, '【洞察1】、【先攻】、攻击前:本回合你每使用过一个法术或传记，随机敌军生命-4，自身攻击+4'],
      [19, 10, '【洞察1】、【先攻】、攻击前:本回合你每使用过一个法术或传记，随机敌军生命-5，自身攻击+5'],
      [21, 11, '【洞察1】、【先攻】、攻击前:本回合你每使用过一个法术或传记，随机敌军生命-5，自身攻击+5'],
      [23, 11, '【洞察1】、【先攻】、攻击前:本回合你每使用过一个法术或传记，随机敌军生命-6，自身攻击+6'],
      [25, 12, '【洞察1】、【先攻】、攻击前:本回合你每使用过一个法术或传记，随机敌军生命-6，自身攻击+6'],
      [27, 13, '【洞察1】、【先攻】、攻击前:本回合你每使用过一个法术或传记，随机敌军生命-7，自身攻击+7']
    ]
  },
  {
    name: '海神赐福',
    quality: '紫',
    cost: 2,
    type: 2,
    img: '',
    data: [
      [0, 0, '【洞察1】、随机友军+8/+8获得【回命】、抽一张牌、无友军则再抽一张牌并且【洞察1】'],
      [0, 0, '【洞察1】、随机友军+9/+9获得【回命】、抽一张牌、无友军则再抽一张牌并且【洞察1】'],
      [0, 0, '【洞察1】、随机友军+10/+10获得【回命】、抽一张牌、无友军则再抽一张牌并且【洞察1】'],
      [0, 0, '【洞察1】、随机友军+11/+11获得【回命】、抽一张牌、无友军则再抽一张牌并且【洞察1】'],
      [0, 0, '【洞察1】、随机友军+12/+12获得【回命】、抽一张牌、无友军则再抽一张牌并且【洞察1】'],
      [0, 0, '【洞察1】、随机友军+13/+14获得【回命】、抽一张牌、无友军则再抽一张牌并且【洞察1】'],
      [0, 0, '【洞察1】、随机友军+15/+15获得【回命】、抽一张牌、无友军则再抽一张牌并且【洞察1】'],
      [0, 0, '【洞察1】、随机友军+17/+17获得【回命】、抽一张牌、无友军则再抽一张牌并且【洞察1】'],
      [0, 0, '【洞察1】、随机友军+19/+19获得【回命】、抽一张牌、无友军则再抽一张牌并且【洞察1】']
    ]
  },
  {
    name: '幸福空间',
    quality: '紫',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [3, 25, '登场:随机另一友军+3/+3，获得【回命】、回合结束:若英雄生命高于敌方，抽一张牌'],
      [4, 28, '登场:随机另一友军+3/+4，获得【回命】、回合结束:若英雄生命高于敌方，抽一张牌'],
      [4, 32, '登场:随机另一友军+4/+4，获得【回命】、回合结束:若英雄生命高于敌方，抽一张牌'],
      [5, 36, '登场:随机另一友军+5/+5，获得【回命】、回合结束:若英雄生命高于敌方，抽一张牌'],
      [6, 40, '登场:随机另一友军+6/+6，获得【回命】、回合结束:若英雄生命高于敌方，抽一张牌'],
      [6, 46, '登场:随机另一友军+7/+7，获得【回命】、回合结束:若英雄生命高于敌方，抽一张牌'],
      [7, 50, '登场:随机另一友军+7/+7，获得【回命】、回合结束:若英雄生命高于敌方，抽一张牌'],
      [8, 55, '登场:随机另一友军+8/+8，获得【回命】、回合结束:若英雄生命高于敌方，抽一张牌'],
      [9, 60, '登场:随机另一友军+9/+9，获得【回命】、回合结束:若英雄生命高于敌方，抽一张牌']
    ]
  },
  {
    name: '无情夺命客',
    quality: '紫',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [11, 11, '【洞察1】、【二连击】、敌方英雄受伤时:攻击+1'],
      [12, 12, '【洞察1】、【二连击】、敌方英雄受伤时:攻击+1'],
      [13, 14, '【洞察1】、【二连击】、敌方英雄受伤时:攻击+1'],
      [15, 15, '【洞察1】、【二连击】、敌方英雄受伤时:攻击+1'],
      [17, 17, '【洞察1】、【二连击】、敌方英雄受伤时:攻击+1'],
      [19, 19, '【洞察1】、【二连击】、敌方英雄受伤时:攻击+1'],
      [21, 21, '【洞察1】、【二连击】、敌方英雄受伤时:攻击+1'],
      [23, 23, '【洞察1】、【二连击】、敌方英雄受伤时:攻击+1'],
      [25, 25, '【洞察1】、【二连击】、敌方英雄受伤时:攻击+1']
    ]
  },
  {
    name: '深山老巫',
    quality: '紫',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [12, 18, '登场:隐形3回合、攻击前:本回合每使用过一个法术，吸取敌方英雄12点生命'],
      [13, 20, '登场:隐形3回合、攻击前:本回合每使用过一个法术，吸取敌方英雄13点生命'],
      [14, 22, '登场:隐形3回合、攻击前:本回合每使用过一个法术，吸取敌方英雄14点生命'],
      [15, 25, '登场:隐形3回合、攻击前:本回合每使用过一个法术，吸取敌方英雄15点生命'],
      [16, 28, '登场:隐形3回合、攻击前:本回合每使用过一个法术，吸取敌方英雄16点生命'],
      [18, 30, '登场:隐形3回合、攻击前:本回合每使用过一个法术，吸取敌方英雄17点生命'],
      [20, 32, '登场:隐形3回合、攻击前:本回合每使用过一个法术，吸取敌方英雄18点生命'],
      [22, 35, '登场:隐形3回合、攻击前:本回合每使用过一个法术，吸取敌方英雄19点生命'],
      [25, 38, '登场:隐形3回合、攻击前:本回合每使用过一个法术，吸取敌方英雄20点生命']
    ]
  },
  {
    name: '黑水伏击',
    quality: '紫',
    cost: 3,
    type: 2,
    img: '',
    data: [
      [0, 0, '随机敌军-8/-8（无视神佑、魔免）、召唤黑水快剑手-lv12'],
      [0, 0, '随机敌军-9/-9（无视神佑、魔免）、召唤黑水快剑手-lv13'],
      [0, 0, '随机敌军-10/-10（无视神佑、魔免）、召唤黑水快剑手-lv14'],
      [0, 0, '随机敌军-12/-12（无视神佑、魔免）、召唤黑水快剑手-lv15'],
      [0, 0, '随机敌军-14/-14（无视神佑、魔免）、召唤黑水快剑手-lv16'],
      [0, 0, '随机敌军-15/-15（无视神佑、魔免）、召唤黑水快剑手-lv17'],
      [0, 0, '随机敌军-17/-17（无视神佑、魔免）、召唤黑水快剑手-lv18'],
      [0, 0, '随机敌军-19/-19（无视神佑、魔免）、召唤黑水快剑手-lv19'],
      [0, 0, '随机敌军-21/-21（无视神佑、魔免）、召唤黑水快剑手-lv20']
    ]
  },
  {
    name: '寒夜灯灵',
    quality: '紫',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [23, 2, '【魔免】、对手不能回复生命、登场:冰封脚下'],
      [26, 2, '【魔免】、对手不能回复生命、登场:冰封脚下'],
      [29, 2, '【魔免】、对手不能回复生命、登场:冰封脚下'],
      [32, 2, '【魔免】、对手不能回复生命、登场:冰封脚下'],
      [35, 2, '【魔免】、对手不能回复生命、登场:冰封脚下'],
      [38, 2, '【魔免】、对手不能回复生命、登场:冰封脚下'],
      [42, 2, '【魔免】、对手不能回复生命、登场:冰封脚下'],
      [45, 2, '【魔免】、对手不能回复生命、登场:冰封脚下'],
      [48, 2, '【魔免】、对手不能回复生命、登场:冰封脚下']
    ]
  },
  {
    name: '封魔幼兽',
    quality: '紫',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [10, 10, '【法力封锁2】、受到传承:成长为封魔巨兽-lv12、死亡:获得封魔巨兽-lv12'],
      [11, 11, '【法力封锁2】、受到传承:成长为封魔巨兽-lv13、死亡:获得封魔巨兽-lv13'],
      [12, 12, '【法力封锁2】、受到传承:成长为封魔巨兽-lv14、死亡:获得封魔巨兽-lv14'],
      [13, 13, '【法力封锁2】、受到传承:成长为封魔巨兽-lv15、死亡:获得封魔巨兽-lv15'],
      [14, 15, '【法力封锁2】、受到传承:成长为封魔巨兽-lv16、死亡:获得封魔巨兽-lv16'],
      [16, 16, '【法力封锁2】、受到传承:成长为封魔巨兽-lv17、死亡:获得封魔巨兽-lv17'],
      [18, 18, '【法力封锁2】、受到传承:成长为封魔巨兽-lv18、死亡:获得封魔巨兽-lv18'],
      [20, 20, '【法力封锁2】、受到传承:成长为封魔巨兽-lv19、死亡:获得封魔巨兽-lv19'],
      [23, 23, '【法力封锁2】、受到传承:成长为封魔巨兽-lv20、死亡:获得封魔巨兽-lv20']
    ]
  },
  {
    name: '晨光魔宠',
    quality: '紫',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [11, 7, '【魔防10】、登场、命中英雄:手上一张卡牌法力-1'],
      [12, 8, '【魔防11】、登场、命中英雄:手上一张卡牌法力-1'],
      [13, 9, '【魔防12】、登场、命中英雄:手上一张卡牌法力-1'],
      [15, 10, '【魔防13】、登场、命中英雄:手上一张卡牌法力-1'],
      [16, 12, '【魔防14】、登场、命中英雄:手上一张卡牌法力-1'],
      [18, 13, '【魔防15】、登场、命中英雄:手上一张卡牌法力-1'],
      [19, 16, '【魔防16】、登场、命中英雄:手上一张卡牌法力-1'],
      [21, 18, '【魔防17】、登场、命中英雄:手上一张卡牌法力-1'],
      [24, 19, '【魔防18】、登场、命中英雄:手上一张卡牌法力-1']
    ]
  },
  {
    name: '海盗船长',
    quality: '紫',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [16, 30, '攻击前:若友军多于敌军:全军+1/+3，全体敌军-1/-0'],
      [18, 33, '攻击前:若友军多于敌军:全军+1/+3，全体敌军-1/-0'],
      [20, 35, '攻击前:若友军多于敌军:全军+2/+3，全体敌军-1/-0'],
      [22, 39, '攻击前:若友军多于敌军:全军+2/+3，全体敌军-1/-0'],
      [25, 42, '攻击前:若友军多于敌军:全军+3/+3，全体敌军-1/-0'],
      [28, 46, '攻击前:若友军多于敌军:全军+3/+3，全体敌军-1/-0'],
      [30, 50, '攻击前:若友军多于敌军:全军+3/+3，全体敌军-1/-1'],
      [32, 55, '攻击前:若友军多于敌军:全军+4/+4，全体敌军-1/-1'],
      [35, 60, '攻击前:若友军多于敌军:全军+4/+4，全体敌军-2/-2']
    ]
  },
  {
    name: '炼金术士',
    quality: '紫',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [11, 25, '攻击前:随机敌军-6/-6，否则随机友军+6/+6'],
      [12, 28, '攻击前:随机敌军-7/-7，否则随机友军+7/+7'],
      [14, 29, '攻击前:随机敌军-8/-8，否则随机友军+8/+8'],
      [15, 33, '攻击前:随机敌军-9/-9，否则随机友军+9/+9'],
      [16, 38, '攻击前:随机敌军-10/-10，否则随机友军+10/+10'],
      [18, 40, '攻击前:随机敌军-11/-11，否则随机友军+11/+11'],
      [20, 42, '攻击前:随机敌军-12/-12，否则随机友军+12/+12'],
      [22, 44, '攻击前:随机敌军-13/-13，否则随机友军+13/+13'],
      [25, 45, '攻击前:随机敌军-15/-15，否则随机友军+15/+15']
    ]
  },
  {
    name: '动物学家',
    quality: '紫',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [15, 30, '登场:蛮石和禅意友军本回合获得【神佑】、回合开始:随机蛮石和禅意友军+5/+5'],
      [17, 33, '登场:蛮石和禅意友军本回合获得【神佑】、回合开始:随机蛮石和禅意友军+6/+6'],
      [19, 36, '登场:蛮石和禅意友军本回合获得【神佑】、回合开始:随机蛮石和禅意友军+7/+7'],
      [21, 40, '登场:蛮石和禅意友军本回合获得【神佑】、回合开始:随机蛮石和禅意友军+8/+8'],
      [23, 45, '登场:蛮石和禅意友军本回合获得【神佑】、回合开始:随机蛮石和禅意友军+9/+9'],
      [25, 50, '登场:蛮石和禅意友军本回合获得【神佑】、回合开始:随机蛮石和禅意友军+10/+10'],
      [28, 55, '登场:蛮石和禅意友军本回合获得【神佑】、回合开始:随机蛮石和禅意友军+10/+10'],
      [30, 60, '登场:蛮石和禅意友军本回合获得【神佑】、回合开始:随机蛮石和禅意友军+11/+11'],
      [33, 65, '登场:蛮石和禅意友军本回合获得【神佑】、回合开始:随机蛮石和禅意友军+12/+12']
    ]
  },
  {
    name: '黑金诈术师',
    quality: '紫',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [10, 10, '【迟缓】、对手法力上限-1、登场:吹回随机敌军、攻击前:75%几率，吹回随机敌军'],
      [11, 12, '【迟缓】、对手法力上限-1、登场:吹回随机敌军、攻击前:75%几率，吹回随机敌军'],
      [13, 13, '【迟缓】、对手法力上限-1、登场:吹回随机敌军、攻击前:75%几率，吹回随机敌军'],
      [15, 15, '【迟缓】、对手法力上限-1、登场:吹回随机敌军、攻击前:75%几率，吹回随机敌军'],
      [17, 17, '【迟缓】、对手法力上限-1、登场:吹回随机敌军、攻击前:75%几率，吹回随机敌军'],
      [20, 20, '【迟缓】、对手法力上限-1、登场:吹回随机敌军、攻击前:75%几率，吹回随机敌军'],
      [23, 23, '【迟缓】、对手法力上限-1、登场:吹回随机敌军、攻击前:75%几率，吹回随机敌军'],
      [26, 26, '【迟缓】、对手法力上限-1、登场:吹回随机敌军、攻击前:75%几率，吹回随机敌军'],
      [30, 30, '【迟缓】、对手法力上限-1、登场:吹回随机敌军、攻击前:75%几率，吹回随机敌军']
    ]
  },
  {
    name: '缴械逆袭',
    quality: '紫',
    cost: 4,
    type: 2,
    img: '',
    data: [
      [0, 0, '吸取敌方英雄6点生命、随机6个敌军-6/-0、随机6个友军+6/+0'],
      [0, 0, '吸取敌方英雄10点生命、随机6个敌军-6/-0、随机6个友军+6/+0'],
      [0, 0, '吸取敌方英雄12点生命、随机6个敌军-7/-0、随机6个友军+7/+0'],
      [0, 0, '吸取敌方英雄18点生命、随机6个敌军-7/-0、随机6个友军+7/+0'],
      [0, 0, '吸取敌方英雄20点生命、随机6个敌军-8/-0、随机6个友军+8/+0'],
      [0, 0, '吸取敌方英雄22点生命、随机6个敌军-9/-0、随机6个友军+9/+0'],
      [0, 0, '吸取敌方英雄25点生命、随机6个敌军-10/-0、随机6个友军+10/+0'],
      [0, 0, '吸取敌方英雄25点生命、随机7个敌军-11/-0、随机6个友军+11/+0'],
      [0, 0, '吸取敌方英雄25点生命、随机7个敌军-13/-0、随机6个友军+13/+0']
    ]
  },
  {
    name: '磐石工匠',
    quality: '紫',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [12, 28, '回合开始:若英雄生命高于敌方，随机友军+6/+6，获得【磐龙】'],
      [14, 32, '回合开始:若英雄生命高于敌方，随机友军+6/+7，获得【磐龙】'],
      [16, 36, '回合开始:若英雄生命高于敌方，随机友军+7/+7，获得【磐龙】'],
      [18, 40, '回合开始:若英雄生命高于敌方，随机友军+8/+8，获得【磐龙】'],
      [20, 46, '回合开始:若英雄生命高于敌方，随机友军+8/+8，获得【磐龙】'],
      [22, 52, '回合开始:若英雄生命高于敌方，随机友军+9/+9，获得【磐龙】'],
      [25, 60, '回合开始:若英雄生命高于敌方，随机友军+9/+9，获得【磐龙】'],
      [28, 65, '回合开始:若英雄生命高于敌方，随机友军+10/+10，获得【磐龙】'],
      [30, 70, '回合开始:若英雄生命高于敌方，随机友军+10/+10，获得【磐龙】']
    ]
  },
  {
    name: '奴役黑猿',
    quality: '紫',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [27, 50, '场上人数高于敌方时，才可以攻击'],
      [30, 55, '场上人数高于敌方时，才可以攻击'],
      [33, 60, '场上人数高于敌方时，才可以攻击'],
      [36, 66, '场上人数高于敌方时，才可以攻击'],
      [40, 70, '场上人数高于敌方时，才可以攻击'],
      [45, 75, '场上人数高于敌方时，才可以攻击'],
      [50, 82, '场上人数高于敌方时，才可以攻击'],
      [55, 90, '场上人数高于敌方时，才可以攻击'],
      [60, 99, '场上人数高于敌方时，才可以攻击']
    ]
  },
  {
    name: '红海领航员',
    quality: '紫',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [13, 13, '【洞察1】、【先攻】、攻击前：全体先攻友军+4/+2'],
      [14, 16, '【洞察1】、【先攻】、攻击前：全体先攻友军+4/+2'],
      [16, 16, '【洞察1】、【先攻】、攻击前：全体先攻友军+4/+3'],
      [18, 18, '【洞察1】、【先攻】、攻击前：全体先攻友军+4/+3'],
      [20, 19, '【洞察1】、【先攻】、攻击前：全体先攻友军+5/+3'],
      [22, 20, '【洞察1】、【先攻】、攻击前：全体先攻友军+5/+3'],
      [25, 20, '【洞察1】、【先攻】、攻击前：全体先攻友军+5/+4'],
      [28, 22, '【洞察1】、【先攻】、攻击前：全体先攻友军+5/+4'],
      [30, 23, '【洞察1】、【先攻】、攻击前：全体先攻友军+6/+4']
    ]
  },
  {
    name: '在逃重犯',
    quality: '紫',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [19, 36, '【磐龙】、登场：敌方召唤2/1警卫lv1、回合结束：若本回合有2个单位死亡，自身+6/+6获得【践踏】'],
      [20, 40, '【磐龙】、登场：敌方召唤2/1警卫lv1、回合结束：若本回合有2个单位死亡，自身+7/+7获得【践踏】'],
      [22, 45, '【磐龙】、登场：敌方召唤2/1警卫lv1、回合结束：若本回合有2个单位死亡，自身+7/+7获得【践踏】'],
      [24, 50, '【磐龙】、登场：敌方召唤2/1警卫lv1、回合结束：若本回合有2个单位死亡，自身+8/+8获得【践踏】'],
      [27, 55, '【磐龙】、登场：敌方召唤2/1警卫lv1、回合结束：若本回合有2个单位死亡，自身+9/+9获得【践踏】'],
      [30, 60, '【磐龙】、登场：敌方召唤2/1警卫lv1、回合结束：若本回合有2个单位死亡，自身+9/+9获得【践踏】'],
      [33, 65, '【磐龙】、登场：敌方召唤2/1警卫lv1、回合结束：若本回合有2个单位死亡，自身+10/+10获得【践踏】'],
      [36, 70, '【磐龙】、登场：敌方召唤2/1警卫lv1、回合结束：若本回合有2个单位死亡，自身+12/+12获得【践踏】'],
      [39, 75, '【磐龙】、登场：敌方召唤2/1警卫lv1、回合结束：若本回合有2个单位死亡，自身+13/+13获得【践踏】']
    ]
  },
  {
    name: '地心冒险家',
    quality: '紫',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [18, 28, '【法力封锁2】、攻击前:每使用过一个法术或传记，自身+2/+5，使用传记:获得【回命】'],
      [20, 30, '【法力封锁2】、攻击前:每使用过一个法术或传记，自身+2/+5，使用传记:获得【回命】'],
      [22, 32, '【法力封锁2】、攻击前:每使用过一个法术或传记，自身+3/+5，使用传记:获得【回命】'],
      [25, 36, '【法力封锁2】、攻击前:每使用过一个法术或传记，自身+3/+5，使用传记:获得【回命】'],
      [28, 40, '【法力封锁2】、攻击前:每使用过一个法术或传记，自身+3/+6，使用传记:获得【回命】'],
      [31, 45, '【法力封锁2】、攻击前:每使用过一个法术或传记，自身+3/+7，使用传记:获得【回命】'],
      [35, 50, '【法力封锁2】、攻击前:每使用过一个法术或传记，自身+3/+8，使用传记:获得【回命】'],
      [37, 55, '【法力封锁2】、攻击前:每使用过一个法术或传记，自身+4/+9，使用传记:获得【回命】'],
      [40, 60, '【法力封锁2】、攻击前:每使用过一个法术或传记，自身+5/+10，使用传记:获得【回命】']
    ]
  },
  {
    name: '贵族运输象',
    quality: '紫',
    cost: 5,
    type: 1,
    img: '',
    data: [
      [16, 25, '登场:英雄生命+25，随机另一友军+3/+6、若有帝国或蛮石友军在场，抓一张牌'],
      [18, 30, '登场:英雄生命+30，随机另一友军+4/+6、若有帝国或蛮石友军在场，抓一张牌'],
      [20, 35, '登场:英雄生命+35，随机另一友军+5/+6、若有帝国或蛮石友军在场，抓一张牌'],
      [22, 40, '登场:英雄生命+40，随机另一友军+6/+6、若有帝国或蛮石友军在场，抓一张牌'],
      [25, 45, '登场:英雄生命+45，随机另一友军+7/+7、若有帝国或蛮石友军在场，抓一张牌'],
      [27, 50, '登场:英雄生命+50，随机另一友军+8/+8、若有帝国或蛮石友军在场，抓一张牌'],
      [30, 55, '登场:英雄生命+55，随机另一友军+9/+9、若有帝国或蛮石友军在场，抓一张牌'],
      [33, 60, '登场:英雄生命+60，随机另一友军+10/+10、若有帝国或蛮石友军在场，抓一张牌'],
      [36, 66, '登场:英雄生命+66，随机另一友军+12/+12、若有帝国或蛮石友军在场，抓一张牌']
    ]
  },
  {
    name: '黑旗舰队双枪客',
    quality: '紫',
    cost: 5,
    type: 1,
    img: '',
    data: [
      [19, 19, '登场:射击随机敌军，12点伤害、攻击前:若英雄生命高于敌方，射击随机2个敌军，6点伤害'],
      [21, 21, '登场:射击随机敌军，13点伤害、攻击前:若英雄生命高于敌方，射击随机2个敌军，7点伤害'],
      [23, 23, '登场:射击随机敌军，15点伤害、攻击前:若英雄生命高于敌方，射击随机2个敌军，7点伤害'],
      [25, 25, '登场:射击随机敌军，16点伤害、攻击前:若英雄生命高于敌方，射击随机2个敌军，8点伤害'],
      [27, 27, '登场:射击随机敌军，18点伤害、攻击前:若英雄生命高于敌方，射击随机2个敌军，9点伤害'],
      [30, 30, '登场:射击随机敌军，21点伤害、攻击前:若英雄生命高于敌方，射击随机2个敌军，10点伤害'],
      [33, 33, '登场:射击随机敌军，24点伤害、攻击前:若英雄生命高于敌方，射击随机2个敌军，12点伤害'],
      [37, 37, '登场:射击随机敌军，26点伤害、攻击前:若英雄生命高于敌方，射击随机2个敌军，13点伤害'],
      [40, 40, '登场:射击随机敌军，30点伤害、攻击前:若英雄生命高于敌方，射击随机2个敌军，15点伤害']
    ]
  },
  {
    name: '星辰陨落',
    quality: '紫',
    cost: 5,
    type: 2,
    img: '',
    data: [
      [0, 0, '目标区域坠落24点伤害，随机7个区域坠落3点伤害'],
      [0, 0, '目标区域坠落29点伤害，随机7个区域坠落3点伤害'],
      [0, 0, '目标区域坠落30点伤害，随机7个区域坠落4点伤害'],
      [0, 0, '目标区域坠落38点伤害，随机7个区域坠落4点伤害'],
      [0, 0, '目标区域坠落45点伤害，随机7个区域坠落4点伤害'],
      [0, 0, '目标区域坠落45点伤害，随机7个区域坠落5点伤害'],
      [0, 0, '目标区域坠落55点伤害，随机7个区域坠落5点伤害'],
      [0, 0, '目标区域坠落55点伤害，随机7个区域坠落6点伤害'],
      [0, 0, '目标区域坠落66点伤害，随机7个区域坠落6点伤害']
    ]
  },
  {
    name: '万圣节秘树',
    quality: '紫',
    cost: 5,
    type: 1,
    img: '',
    data: [
      [0, 66, '法力上限+1、【磐龙】、回合结束:获得《节日南瓜》-lv12'],
      [0, 72, '法力上限+1、【磐龙】、回合结束:获得《节日南瓜》-lv13'],
      [0, 79, '法力上限+1、【磐龙】、回合结束:获得《节日南瓜》-lv14'],
      [0, 88, '法力上限+1、【磐龙】、回合结束:获得《节日南瓜》-lv15'],
      [0, 99, '法力上限+1、【磐龙】、回合结束:获得《节日南瓜》-lv16'],
      [0, 111, '法力上限+1、【磐龙】、回合结束:获得《节日南瓜》-lv17'],
      [0, 127, '法力上限+1、【磐龙】、回合结束:获得《节日南瓜》-lv18'],
      [0, 145, '法力上限+1、【磐龙】、回合结束:获得《节日南瓜》-lv19'],
      [0, 160, '法力上限+1、【磐龙】、回合结束:获得《节日南瓜》-lv20']
    ]
  },
  {
    name: '烈日大祭师',
    quality: '紫',
    cost: 5,
    type: 1,
    img: '',
    data: [
      [15, 18, '回合开始：英雄生命高于对手，坠落闪电、攻击前：人数高于对手，投射火球'],
      [16, 21, '回合开始：英雄生命高于对手，坠落闪电、攻击前：人数高于对手，投射火球'],
      [18, 24, '回合开始：英雄生命高于对手，坠落闪电、攻击前：人数高于对手，投射火球'],
      [20, 27, '回合开始：英雄生命高于对手，坠落闪电、攻击前：人数高于对手，投射火球'],
      [22, 30, '回合开始：英雄生命高于对手，坠落闪电、攻击前：人数高于对手，投射火球'],
      [25, 32, '回合开始：英雄生命高于对手，坠落闪电、攻击前：人数高于对手，投射火球'],
      [28, 35, '回合开始：英雄生命高于对手，坠落闪电、攻击前：人数高于对手，投射火球'],
      [30, 40, '回合开始：英雄生命高于对手，坠落闪电、攻击前：人数高于对手，投射火球'],
      [35, 40, '回合开始：英雄生命高于对手，坠落闪电、攻击前：人数高于对手，投射火球']
    ]
  },
  {
    name: '钢斧开山者',
    quality: '紫',
    cost: 6,
    type: 1,
    img: '',
    data: [
      [10, 40, '【磐龙】、回合开始、回合结束:轰炸敌方随机区域10点伤害'],
      [11, 45, '【磐龙】、回合开始、回合结束:轰炸敌方随机区域11点伤害'],
      [12, 52, '【磐龙】、回合开始、回合结束:轰炸敌方随机区域12点伤害'],
      [13, 60, '【磐龙】、回合开始、回合结束:轰炸敌方随机区域13点伤害'],
      [15, 65, '【磐龙】、回合开始、回合结束:轰炸敌方随机区域15点伤害'],
      [16, 75, '【磐龙】、回合开始、回合结束:轰炸敌方随机区域16点伤害'],
      [18, 85, '【磐龙】、回合开始、回合结束:轰炸敌方随机区域18点伤害'],
      [21, 95, '【磐龙】、回合开始、回合结束:轰炸敌方随机区域21点伤害'],
      [25, 100, '【磐龙】、回合开始、回合结束:轰炸敌方随机区域24点伤害']
    ]
  },
  {
    name: '黑旗舰队船长',
    quality: '紫',
    cost: 6,
    type: 1,
    img: '',
    data: [
      [11, 36, '回合开始:吸取对手11点生命、攻击前:若英雄生命高于敌方，吸取随机敌军7点攻击'],
      [12, 42, '回合开始:吸取对手12点生命、攻击前:若英雄生命高于敌方，吸取随机敌军7点攻击'],
      [13, 49, '回合开始:吸取对手13点生命、攻击前:若英雄生命高于敌方，吸取随机敌军8点攻击'],
      [15, 55, '回合开始:吸取对手15点生命、攻击前:若英雄生命高于敌方，吸取随机敌军8点攻击'],
      [16, 60, '回合开始:吸取对手16点生命、攻击前:若英雄生命高于敌方，吸取随机敌军9点攻击'],
      [18, 65, '回合开始:吸取对手18点生命、攻击前:若英雄生命高于敌方，吸取随机敌军9点攻击'],
      [20, 70, '回合开始:吸取对手20点生命、攻击前:若英雄生命高于敌方，吸取随机敌军10点攻击'],
      [23, 75, '回合开始:吸取对手23点生命、攻击前:若英雄生命高于敌方，吸取随机敌军11点攻击'],
      [26, 80, '回合开始:吸取对手26点生命、攻击前:若英雄生命高于敌方，吸取随机敌军12点攻击']
    ]
  },
  {
    name: '封魔巨兽',
    quality: '紫',
    cost: 6,
    type: 1,
    img: '',
    data: [
      [18, 36, '【迟缓】、【磐龙】、【魂歌】、敌方法力上限-2'],
      [20, 40, '【迟缓】、【磐龙】、【魂歌】、敌方法力上限-2'],
      [22, 45, '【迟缓】、【磐龙】、【魂歌】、敌方法力上限-2'],
      [25, 50, '【迟缓】、【磐龙】、【魂歌】、敌方法力上限-2'],
      [28, 55, '【迟缓】、【磐龙】、【魂歌】、敌方法力上限-2'],
      [32, 60, '【迟缓】、【磐龙】、【魂歌】、敌方法力上限-2'],
      [35, 70, '【迟缓】、【磐龙】、【魂歌】、敌方法力上限-2'],
      [37, 80, '【迟缓】、【磐龙】、【魂歌】、敌方法力上限-2'],
      [40, 90, '【迟缓】、【磐龙】、【魂歌】、敌方法力上限-2']
    ]
  },
  {
    name: '蕾拉密卷',
    quality: '橙',
    cost: 2,
    type: 2,
    img: '',
    data: [
      [0, 0, '获得3张《蕾拉火弹》-lv12、70%获得《真理残片》'],
      [0, 0, '获得3张《蕾拉火弹》-lv13、75%获得《真理残片》'],
      [0, 0, '获得3张《蕾拉火弹》-lv14、80%获得《真理残片》'],
      [0, 0, '获得3张《蕾拉火弹》-lv15、85%获得《真理残片》'],
      [0, 0, '获得3张《蕾拉火弹》-lv16、获得《真理残片》'],
      [0, 0, '获得3张《蕾拉火弹》-lv17、获得《真理残片》'],
      [0, 0, '获得3张《蕾拉火弹》-lv18、获得《真理残片》'],
      [0, 0, '获得3张《蕾拉火弹》-lv19、获得《真理残片》'],
      [0, 0, '获得3张《蕾拉火弹》-lv20、获得《真理残片》']
    ]
  },
  {
    name: '花剑绅士·翔',
    quality: '橙',
    cost: 2,
    type: 1,
    img: '',
    data: [
      [10, 10, '【先攻】、【回命】、【协战4】'],
      [11, 11, '【先攻】、【回命】、【协战5】'],
      [12, 12, '【先攻】、【回命】、【协战6】'],
      [13, 13, '【先攻】、【回命】、【协战7】'],
      [14, 15, '【先攻】、【回命】、【协战8】'],
      [16, 16, '【先攻】、【回命】、【协战9】'],
      [18, 18, '【先攻】、【回命】、【协战10】'],
      [20, 20, '【先攻】、【回命】、【协战11】'],
      [23, 23, '【先攻】、【回命】、【协战12】']
    ]
  },
  {
    name: '海燕·鲍莉',
    quality: '橙',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [11, 11, '登场:召唤8/8水手-lv11、攻击前:随机敌军受到11点伤害、回合结束:自身回手'],
      [13, 13, '登场:召唤9/9水手-lv12、攻击前:随机敌军受到13点伤害、回合结束:自身回手'],
      [15, 15, '登场:召唤10/10水手-lv13、攻击前:随机敌军受到15点伤害、回合结束:自身回手'],
      [17, 17, '登场:召唤11/11水手-lv14、攻击前:随机敌军受到17点伤害、回合结束:自身回手'],
      [19, 19, '登场:召唤12/12水手-lv15、攻击前:随机敌军受到19点伤害、回合结束:自身回手'],
      [22, 22, '登场:召唤13/13水手-lv16、攻击前:随机敌军受到22点伤害、回合结束:自身回手'],
      [25, 25, '登场:召唤15/15水手-lv18、攻击前:随机敌军受到25点伤害、回合结束:自身回手'],
      [27, 27, '登场:召唤16/17水手-lv19、攻击前:随机敌军受到27点伤害、回合结束:自身回手'],
      [30, 30, '登场:召唤18/18水手-lv20、攻击前:随机敌军受到30点伤害、回合结束:自身回手']
    ]
  },
  {
    name: '欢乐歌唱的戴维',
    quality: '橙',
    cost: 3,
    type: 1,
    img: '',
    data: [
      [13, 14, '【魂音】、回合开始:手上一张卡牌法力-1，若人数多于对手，全体友军+1/+3'],
      [15, 15, '【魂音】、回合开始:手上一张卡牌法力-1，若人数多于对手，全体友军+1/+4'],
      [17, 17, '【魂音】、回合开始:手上一张卡牌法力-1，若人数多于对手，全体友军+1/+4'],
      [19, 19, '【魂音】、回合开始:手上一张卡牌法力-1，若人数多于对手，全体友军+1/+4'],
      [21, 21, '【魂音】、回合开始:手上一张卡牌法力-1，若人数多于对手，全体友军+1/+5'],
      [23, 25, '【魂音】、回合开始:手上一张卡牌法力-1，若人数多于对手，全体友军+1/+6'],
      [26, 26, '【魂音】、回合开始:手上一张卡牌法力-1，若人数多于对手，全体友军+1/+7'],
      [29, 29, '【魂音】、回合开始:手上一张卡牌法力-1，若人数多于对手，全体友军+1/+7'],
      [32, 32, '【魂音】、回合开始:手上一张卡牌法力-1，若人数多于对手，全体友军+1/+7']
    ]
  },
  {
    name: '魔卡幻术师·梅基',
    quality: '橙',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [9, 19, '充能:随机敌军-3/-3，命中英雄:你抓一张牌，对手弃掉一张牌，若对手无手牌，则随机敌军-9/-9'],
      [10, 21, '充能:随机敌军-4/-4，命中英雄:你抓一张牌，对手弃掉一张牌，若对手无手牌，则随机敌军-10/-10'],
      [12, 24, '充能:随机敌军-5/-5，命中英雄:你抓一张牌，对手弃掉一张牌，若对手无手牌，则随机敌军-11/-11'],
      [13, 29, '充能:随机敌军-6/-6，命中英雄:你抓一张牌，对手弃掉一张牌，若对手无手牌，则随机敌军-12/-12'],
      [15, 33, '充能:随机敌军-7/-7，命中英雄:你抓一张牌，对手弃掉一张牌，若对手无手牌，则随机敌军-13/-13'],
      [18, 36, '充能:随机敌军-9/-9，命中英雄:你抓一张牌，对手弃掉一张牌，若对手无手牌，则随机敌军-15/-15'],
      [21, 39, '充能:随机敌军-10/-10，命中英雄:你抓一张牌，对手弃掉一张牌，若对手无手牌，则随机敌军-18/-18'],
      [24, 42, '充能:随机敌军-11/-11，命中英雄:你抓一张牌，对手弃掉一张牌，若对手无手牌，则随机敌军-21/-21'],
      [27, 45, '充能:随机敌军-13/-13，命中英雄:你抓一张牌，对手弃掉一张牌，若对手无手牌，则随机敌军-24/-24']
    ]
  },
  {
    name: '赤影·艾希尔',
    quality: '橙',
    cost: 4,
    type: 1,
    img: '',
    data: [
      [15, 7, '【洞察2】、【连击】、【魔防50】、回合开始：若生命高于对手，获得【隐形】1回合；若人数多于对手，攻击+1'],
      [16, 9, '【洞察2】、【连击】、【魔防60】、回合开始：若生命高于对手，获得【隐形】1回合；若人数多于对手，攻击+1'],
      [18, 10, '【洞察2】、【连击】、【魔防70】、回合开始：若生命高于对手，获得【隐形】1回合；若人数多于对手，攻击+1'],
      [21, 10, '【洞察2】、【连击】、【魔防80】、回合开始：若生命高于对手，获得【隐形】1回合；若人数多于对手，攻击+1'],
      [23, 12, '【洞察2】、【连击】、【魔防90】、回合开始：若生命高于对手，获得【隐形】1回合；若人数多于对手，攻击+1'],
      [26, 14, '【洞察2】、【连击】、【魔防100】、回合开始：若生命高于对手，获得【隐形】1回合；若人数多于对手，攻击+1'],
      [28, 15, '【洞察2】、【连击】、【魔防100】、回合开始：若生命高于对手，获得【隐形】1回合；若人数多于对手，攻击+2'],
      [30, 16, '【洞察2】、【连击】、【魔防110】、回合开始：若生命高于对手，获得【隐形】1回合；若人数多于对手，攻击+2'],
      [33, 17, '【洞察2】、【连击】、【魔防120】、回合开始：若生命高于对手，获得【隐形】1回合；若人数多于对手，攻击+3']
    ]
  },
  {
    name: '钢之咆哮·布瑞恩',
    quality: '橙',
    cost: 5,
    type: 1,
    img: '',
    data: [
      [15, 15, '【护甲7】、【践踏】、登场:横排敌军受到10点伤害、攻击前:友军多于敌军，自身+2/+4'],
      [17, 17, '【护甲8】、【践踏】、登场:横排敌军受到11点伤害、攻击前:友军多于敌军，自身+2/+6'],
      [19, 19, '【护甲9】、【践踏】、登场:横排敌军受到12点伤害、攻击前:友军多于敌军，自身+3/+6'],
      [21, 21, '【护甲10】、【践踏】、登场:横排敌军受到13点伤害、攻击前:友军多于敌军，自身+4/+8'],
      [24, 24, '【护甲10】、【践踏】、登场:横排敌军受到14点伤害、攻击前:友军多于敌军，自身+4/+9'],
      [27, 27, '【护甲11】、【践踏】、登场:横排敌军受到16点伤害、攻击前:友军多于敌军，自身+5/+11'],
      [30, 30, '【护甲12】、【践踏】、登场:横排敌军受到18点伤害、攻击前:友军多于敌军，自身+6/+12'],
      [35, 35, '【护甲13】、【践踏】、登场:横排敌军受到20点伤害、攻击前:友军多于敌军，自身+6/+14'],
      [40, 40, '【护甲14】、【践踏】、登场:横排敌军受到22点伤害、攻击前:友军多于敌军，自身+7/+15']
    ]
  },
  {
    name: '烈火·蕾拉',
    quality: '橙',
    cost: 5,
    type: 1,
    img: '',
    data: [
      [27, 15, '登场:获得2张《蕾拉火弹》-lv12、回合结束、命中英雄:获得《蕾拉火弹》-lv12'],
      [32, 16, '登场:获得3张《蕾拉火弹》-lv13、回合结束、命中英雄:获得《蕾拉火弹》-lv13'],
      [36, 18, '登场:获得3张《蕾拉火弹》-lv14、回合结束、命中英雄:获得《蕾拉火弹》-lv14'],
      [40, 20, '登场:获得3张《蕾拉火弹》-lv15、回合结束、命中英雄:获得《蕾拉火弹》-lv15'],
      [45, 22, '登场:获得3张《蕾拉火弹》-lv16、回合结束、命中英雄:获得《蕾拉火弹》-lv16'],
      [52, 25, '登场:获得3张《蕾拉火弹》-lv17、回合结束、命中英雄:获得《蕾拉火弹》-lv17'],
      [60, 30, '登场:获得3张《蕾拉火弹》-lv18、回合结束、命中英雄:获得《蕾拉火弹》-lv18'],
      [68, 33, '登场:获得3张《蕾拉火弹》-lv19、回合结束、命中英雄:获得《蕾拉火弹》-lv19'],
      [77, 35, '登场:获得3张《蕾拉火弹》-lv20、回合结束、命中英雄:获得《蕾拉火弹》-lv20']
    ]
  },
  {
    name: '黑金三代目·梅森',
    quality: '橙',
    cost: 7,
    type: 1,
    img: '',
    data: [
      [18, 36, '【磐龙】、攻击前:消灭对面首位敌军、命中英雄时:75%几率，敌军受到20点伤害'],
      [20, 40, '【磐龙】、攻击前:消灭对面首位敌军、命中英雄时:75%几率，敌军受到24点伤害'],
      [25, 45, '【磐龙】、攻击前:消灭对面首位敌军、命中英雄时:80%几率，敌军受到25点伤害'],
      [30, 50, '【磐龙】、攻击前:消灭对面首位敌军、命中英雄时:80%几率，敌军受到30点伤害'],
      [35, 55, '【磐龙】、攻击前:消灭对面首位敌军、命中英雄时:80%几率，敌军受到35点伤害'],
      [36, 65, '【磐龙】、攻击前:消灭对面首位敌军、命中英雄时:敌军受到36点伤害'],
      [40, 75, '【磐龙】、攻击前:消灭对面首位敌军、命中英雄时:敌军受到40点伤害'],
      [45, 85, '【磐龙】、攻击前:消灭对面首位敌军、命中英雄时:敌军受到45点伤害'],
      [50, 95, '【磐龙】、攻击前:消灭对面首位敌军、命中英雄时:敌军受到50点伤害']
    ]
  }
];
