export default [
  {
    name: '学仆-基础型',
    quality: '白',
    cost: 0,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_jichuxing.jpg', import.meta.url),
    data: [
      [7, 7, '/'],
      [8, 8, '/'],
      [9, 9, '/'],
      [10, 10, '/'],
      [11, 11, '/'],
      [12, 12, '/'],
      [13, 13, '/'],
      [14, 14, '/'],
      [15, 15, '/']
    ]
  },
  {
    name: '灵能炸弹',
    quality: '白',
    cost: 0,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/lingnengzhadan.jpg', import.meta.url),
    data: [
      [0, 1, '【隐形】、【守军】、【魔免】、充能时爆炸:英雄受到14点伤害，所有相邻友军受到5点伤害'],
      [0, 1, '【隐形】、【守军】、【魔免】、充能时爆炸:英雄受到16点伤害，所有相邻友军受到6点伤害'],
      [0, 1, '【隐形】、【守军】、【魔免】、充能时爆炸:英雄受到18点伤害，所有相邻友军受到6点伤害'],
      [0, 1, '【隐形】、【守军】、【魔免】、充能时爆炸:英雄受到20点伤害，所有相邻友军受到7点伤害'],
      [0, 1, '【隐形】、【守军】、【魔免】、充能时爆炸:英雄受到22点伤害，所有相邻友军受到7点伤害'],
      [0, 1, '【隐形】、【守军】、【魔免】、充能时爆炸:英雄受到24点伤害，所有相邻友军受到8点伤害'],
      [0, 1, '【隐形】、【守军】、【魔免】、充能时爆炸:英雄受到26点伤害，所有相邻友军受到8点伤害'],
      [0, 1, '【隐形】、【守军】、【魔免】、充能时爆炸:英雄受到28点伤害，所有相邻友军受到9点伤害'],
      [0, 1, '【隐形】、【守军】、【魔免】、充能时爆炸:英雄受到30点伤害，所有相邻友军受到10点伤害']
    ]
  },
  {
    name: '沉默术',
    quality: '白',
    cost: 1,
    type: 2,
    img: new URL('@/assets/zhongzu/yinmizhe/chenmoshu.jpg', import.meta.url),
    data: [
      [0, 0, '目标区域坠落12点伤害，并沉默目标单位'],
      [0, 0, '目标区域坠落13点伤害，并沉默目标单位'],
      [0, 0, '目标区域坠落14点伤害，并沉默目标单位'],
      [0, 0, '目标区域坠落15点伤害，并沉默目标单位'],
      [0, 0, '目标区域坠落16点伤害，并沉默目标单位'],
      [0, 0, '目标区域坠落17点伤害，并沉默目标单位'],
      [0, 0, '目标区域坠落18点伤害，并沉默目标单位'],
      [0, 0, '目标区域坠落19点伤害，并沉默目标单位'],
      [0, 0, '目标区域坠落20点伤害，并沉默目标单位']
    ]
  },
  {
    name: '幻象巨蛇',
    quality: '白',
    cost: 1,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/huanxiangjushe.jpg', import.meta.url),
    data: [
      [13, 13, '【幻象】'],
      [14, 14, '【幻象】'],
      [16, 16, '【幻象】'],
      [18, 18, '【幻象】'],
      [20, 20, '【幻象】'],
      [22, 22, '【幻象】'],
      [24, 24, '【幻象】'],
      [26, 26, '【幻象】'],
      [28, 28, '【幻象】']
    ]
  },
  {
    name: '机械系学徒',
    quality: '白',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/jixiexixuetu.jpg', import.meta.url),
    data: [
      [8, 8, '【穿透】'],
      [9, 9, '【穿透】'],
      [10, 11, '【穿透】'],
      [12, 12, '【穿透】'],
      [13, 13, '【穿透】'],
      [14, 15, '【穿透】'],
      [16, 16, '【穿透】'],
      [18, 18, '【穿透】'],
      [20, 20, '【穿透】']
    ]
  },
  {
    name: '学仆-发条型',
    quality: '白',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_fatiaoxing.jpg', import.meta.url),
    data: [
      [12, 12, '死亡:随机友军+4/+4'],
      [13, 13, '死亡:随机友军+5/+5'],
      [14, 14, '死亡:随机友军+6/+6'],
      [15, 15, '死亡:随机友军+7/+7'],
      [16, 16, '死亡:随机友军+8/+8'],
      [17, 17, '死亡:随机友军+9/+9'],
      [18, 18, '死亡:随机友军+10/+10'],
      [19, 19, '死亡:随机友军+11/+11'],
      [20, 20, '死亡:随机友军+12/+12']
    ]
  },
  {
    name: '扭曲之力',
    quality: '白',
    cost: 2,
    type: 2,
    img: new URL('@/assets/zhongzu/yinmizhe/niuquzhili.jpg', import.meta.url),
    data: [
      [0, 0, '目标单位+12/-12'],
      [0, 0, '目标单位+13/-13'],
      [0, 0, '目标单位+14/-14'],
      [0, 0, '目标单位+15/-15'],
      [0, 0, '目标单位+16/-16'],
      [0, 0, '目标单位+17/-17'],
      [0, 0, '目标单位+18/-18'],
      [0, 0, '目标单位+19/-19'],
      [0, 0, '目标单位+20/-20']
    ]
  },
  {
    name: '学仆-联能型',
    quality: '白',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_liannengxing.jpg', import.meta.url),
    data: [
      [12, 6, '攻击前:随机敌军受到2点伤害'],
      [13, 6, '攻击前:随机敌军受到3点伤害'],
      [15, 7, '攻击前:随机敌军受到3点伤害'],
      [16, 10, '攻击前:随机敌军受到3点伤害'],
      [18, 11, '攻击前:随机敌军受到3点伤害'],
      [20, 12, '攻击前:随机敌军受到3点伤害'],
      [21, 13, '攻击前:随机敌军受到4点伤害'],
      [22, 14, '攻击前:随机敌军受到4点伤害'],
      [23, 15, '攻击前:随机敌军受到4点伤害']
    ]
  },
  {
    name: '学仆-增强型',
    quality: '白',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_zengqiangxing.jpg', import.meta.url),
    data: [
      [13, 13, '登场:随机友军+4/+4'],
      [14, 14, '登场:随机友军+5/+5'],
      [15, 15, '登场:随机友军+6/+6'],
      [16, 16, '登场:随机友军+7/+7'],
      [18, 18, '登场:随机友军+7/+7'],
      [20, 20, '登场:随机友军+8/+8'],
      [22, 22, '登场:随机友军+9/+9'],
      [24, 24, '登场:随机友军+10/+10'],
      [26, 26, '登场:随机友军+11/+11']
    ]
  },
  {
    name: '邪月蝙蝠',
    quality: '蓝',
    cost: 1,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xieyuebianfu.jpg', import.meta.url),
    data: [
      [10, 4, '攻击前:本回合你每使用过一个法术，自身攻击+6，若为传记则获得【隐形】1回合'],
      [11, 4, '攻击前:本回合你每使用过一个法术，自身攻击+7，若为传记则获得【隐形】1回合'],
      [13, 4, '攻击前:本回合你每使用过一个法术，自身攻击+7，若为传记则获得【隐形】1回合'],
      [14, 5, '攻击前:本回合你每使用过一个法术，自身攻击+8，若为传记则获得【隐形】1回合'],
      [16, 5, '攻击前:本回合你每使用过一个法术，自身攻击+8，若为传记则获得【隐形】1回合'],
      [17, 6, '攻击前:本回合你每使用过一个法术，自身攻击+9，若为传记则获得【隐形】1回合'],
      [19, 6, '攻击前:本回合你每使用过一个法术，自身攻击+9，若为传记则获得【隐形】1回合'],
      [20, 7, '攻击前:本回合你每使用过一个法术，自身攻击+10，若为传记则获得【隐形】1回合'],
      [22, 8, '攻击前:本回合你每使用过一个法术，自身攻击+10，若为传记则获得【隐形】1回合']
    ]
  },
  {
    name: '预言系教授',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/yuyanxijiaoshou.jpg', import.meta.url),
    data: [
      [7, 7, '登场:抓一张牌、死亡:英雄生命+9'],
      [8, 8, '登场:抓一张牌、死亡:英雄生命+10'],
      [9, 9, '登场:抓一张牌、死亡:英雄生命+11'],
      [10, 10, '登场:抓一张牌、死亡:英雄生命+12'],
      [11, 11, '登场:抓一张牌、死亡:英雄生命+13'],
      [12, 12, '登场:抓一张牌、死亡:英雄生命+14'],
      [13, 13, '登场:抓一张牌、死亡:英雄生命+15'],
      [14, 15, '登场:抓一张牌、死亡:英雄生命+16'],
      [16, 16, '登场:抓一张牌、死亡:英雄生命+18']
    ]
  },
  {
    name: '方尖魔碑',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/fangjianmobei.jpg', import.meta.url),
    data: [
      [0, 18, '【守军】、敌方法力上限-1、回合结束:60%几率【洞察1】'],
      [0, 20, '【守军】、敌方法力上限-1、回合结束:60%几率【洞察1】'],
      [0, 22, '【守军】、敌方法力上限-1、回合结束:65%几率【洞察1】'],
      [0, 25, '【守军】、敌方法力上限-1、回合结束:65%几率【洞察1】'],
      [0, 27, '【守军】、敌方法力上限-1、回合结束:68%几率【洞察1】'],
      [0, 29, '【守军】、敌方法力上限-1、回合结束:69%几率【洞察1】'],
      [0, 32, '【守军】、敌方法力上限-1、回合结束:70%几率【洞察1】'],
      [0, 36, '【守军】、敌方法力上限-1、回合结束:70%几率【洞察1】'],
      [0, 40, '【守军】、敌方法力上限-1、回合结束:70%几率【洞察1】']
    ]
  },
  {
    name: '雷火工组',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/leihuogongzu.jpg', import.meta.url),
    data: [
      [8, 18, '回合开始:你每有1点法力，敌方随机区域坠落2点伤害'],
      [9, 21, '回合开始:你每有1点法力，敌方随机区域坠落2点伤害'],
      [10, 22, '回合开始:你每有1点法力，敌方随机区域坠落3点伤害'],
      [11, 25, '回合开始:你每有1点法力，敌方随机区域坠落3点伤害'],
      [13, 26, '回合开始:你每有1点法力，敌方随机区域坠落3点伤害'],
      [15, 28, '回合开始:你每有1点法力，敌方随机区域坠落3点伤害'],
      [16, 30, '回合开始:你每有1点法力，敌方随机区域坠落4点伤害'],
      [18, 34, '回合开始:你每有1点法力，敌方随机区域坠落4点伤害'],
      [20, 38, '回合开始:你每有1点法力，敌方随机区域坠落4点伤害']
    ]
  },
  {
    name: '邪月妖猫',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xieyueyaomao.jpg', import.meta.url),
    data: [
      [13, 9, '攻击前:本回合你每使用过一个法术，自身+3/+3，若为传记获得【践踏】1回合'],
      [15, 10, '攻击前:本回合你每使用过一个法术，自身+3/+3，若为传记获得【践踏】1回合'],
      [16, 12, '攻击前:本回合你每使用过一个法术，自身+4/+3，若为传记获得【践踏】1回合'],
      [18, 13, '攻击前:本回合你每使用过一个法术，自身+4/+3，若为传记获得【践踏】1回合'],
      [20, 14, '攻击前:本回合你每使用过一个法术，自身+4/+4，若为传记获得【践踏】1回合'],
      [22, 16, '攻击前:本回合你每使用过一个法术，自身+4/+4，若为传记获得【践踏】1回合'],
      [25, 16, '攻击前:本回合你每使用过一个法术，自身+5/+5，若为传记获得【践踏】1回合'],
      [27, 19, '攻击前:本回合你每使用过一个法术，自身+5/+5，若为传记获得【践踏】1回合'],
      [30, 20, '攻击前:本回合你每使用过一个法术，自身+5/+5，若为传记获得【践踏】1回合']
    ]
  },
  {
    name: '沉重否定',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: new URL('@/assets/zhongzu/yinmizhe/chenzhongfouding.jpg', import.meta.url),
    data: [
      [0, 0, '目标敌军攻击-35，并沉默、70%获得《真理碎片》'],
      [0, 0, '目标敌军攻击-40，并沉默、70%获得《真理碎片》'],
      [0, 0, '目标敌军攻击-45，并沉默、75%获得《真理碎片》'],
      [0, 0, '目标敌军攻击-50，并沉默、80%获得《真理碎片》'],
      [0, 0, '目标敌军攻击-55，并沉默、85%获得《真理碎片》'],
      [0, 0, '目标敌军攻击-60，并沉默、85%获得《真理碎片》'],
      [0, 0, '目标敌军攻击-65，并沉默、获得《真理碎片》'],
      [0, 0, '目标敌军攻击-70，并沉默、%获得《真理碎片》'],
      [0, 0, '目标敌军攻击-75，并沉默、获得《真理碎片》']
    ]
  },
  {
    name: '学仆-观测型',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_guancexing.jpg', import.meta.url),
    data: [
      [9, 15, '洞察时：自身+2/+3、死亡：【洞察1】，英雄恢复生命（等同攻击力）'],
      [10, 17, '洞察时：自身+2/+3、死亡：【洞察1】，英雄恢复生命（等同攻击力）'],
      [11, 19, '洞察时：自身+3/+3、死亡：【洞察1】，英雄恢复生命（等同攻击力）'],
      [13, 20, '洞察时：自身+3/+3、死亡：【洞察1】，英雄恢复生命（等同攻击力）'],
      [15, 21, '洞察时：自身+3/+4、死亡：【洞察1】，英雄恢复生命（等同攻击力）'],
      [16, 24, '洞察时：自身+3/+4、死亡：【洞察1】，英雄恢复生命（等同攻击力）'],
      [18, 26, '洞察时：自身+4/+4、死亡：【洞察1】，英雄恢复生命（等同攻击力）'],
      [20, 29, '洞察时：自身+4/+4、死亡：【洞察1】，英雄恢复生命（等同攻击力）'],
      [22, 32, '洞察时：自身+4/+4、死亡：【洞察1】，英雄恢复生命（等同攻击力）']
    ]
  },
  {
    name: '幻象学者',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/huanxiangxuezhe.jpg', import.meta.url),
    data: [
      [11, 9, '登场:获得《幻象巨蛇》-lv12'],
      [12, 10, '登场:获得《幻象巨蛇》-lv13'],
      [13, 11, '登场:获得《幻象巨蛇》-lv14'],
      [14, 12, '登场:获得《幻象巨蛇》-lv15'],
      [15, 13, '登场:获得《幻象巨蛇》-lv16'],
      [17, 14, '登场:获得《幻象巨蛇》-lv17'],
      [19, 15, '登场:获得《幻象巨蛇》-lv18'],
      [21, 17, '登场:获得《幻象巨蛇》-lv19'],
      [24, 18, '登场:获得《幻象巨蛇》-lv20']
    ]
  },
  {
    name: '御魔术',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: new URL('@/assets/zhongzu/yinmizhe/yumoshu.jpg', import.meta.url),
    data: [
      [0, 0, '目标友军+4/+4、获得【魔防7】、抽一张牌'],
      [0, 0, '目标友军+4/+5、获得【魔防8】、抽一张牌'],
      [0, 0, '目标友军+5/+5、获得【魔防9】、抽一张牌'],
      [0, 0, '目标友军+6/+6、获得【魔防9】、抽一张牌'],
      [0, 0, '目标友军+7/+7、获得【魔防10】、抽一张牌'],
      [0, 0, '目标友军+8/+8、获得【魔防11】、抽一张牌'],
      [0, 0, '目标友军+9/+9、获得【魔防12】、抽一张牌'],
      [0, 0, '目标友军+10/+11、获得【魔防13】、抽一张牌'],
      [0, 0, '目标友军+12/+12、获得【魔防15】、抽一张牌']
    ]
  },
  {
    name: '粗心的化学家',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/cuxindehuaxuejia.jpg', import.meta.url),
    data: [
      [8, 13, '攻击前:相邻一个友军受到1点伤害，随机敌军受到3点伤害'],
      [9, 15, '攻击前:相邻一个友军受到1点伤害，随机敌军受到3点伤害'],
      [10, 17, '攻击前:相邻一个友军受到1点伤害，随机敌军受到3点伤害'],
      [10, 19, '攻击前:相邻一个友军受到1点伤害，随机敌军受到4点伤害'],
      [12, 20, '攻击前:相邻一个友军受到1点伤害，随机敌军受到4点伤害'],
      [13, 21, '攻击前:相邻一个友军受到1点伤害，随机敌军受到5点伤害'],
      [15, 23, '攻击前:相邻一个友军受到1点伤害，随机敌军受到5点伤害'],
      [16, 26, '攻击前:相邻一个友军受到1点伤害，随机敌军受到6点伤害'],
      [18, 29, '攻击前:相邻一个友军受到1点伤害，随机敌军受到6点伤害']
    ]
  },
  {
    name: '万圣节草人',
    quality: '蓝',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/wanshengjiecaoren.jpg', import.meta.url),
    data: [
      [0, 13, '回合结束:45%几率敌方一张手牌法力+1、死亡:原地召唤幻象蛇-lv12'],
      [0, 15, '回合结束:50%几率敌方一张手牌法力+1、死亡:原地召唤幻象蛇-lv13'],
      [0, 17, '回合结束:50%几率敌方一张手牌法力+1、死亡:原地召唤幻象蛇-lv14'],
      [0, 19, '回合结束:50%几率敌方一张手牌法力+1、死亡:原地召唤幻象蛇-lv15'],
      [0, 21, '回合结束:50%几率敌方一张手牌法力+1、死亡:原地召唤幻象蛇-lv16'],
      [0, 23, '回合结束:50%几率敌方一张手牌法力+1、死亡:原地召唤幻象蛇-lv17'],
      [0, 25, '回合结束:50%几率敌方一张手牌法力+1、死亡:原地召唤幻象蛇-lv18'],
      [0, 27, '回合结束:50%几率敌方一张手牌法力+1、死亡:原地召唤幻象蛇-lv19'],
      [0, 30, '回合结束:50%几率敌方一张手牌法力+1、死亡:原地召唤幻象蛇-lv20']
    ]
  },
  {
    name: '灵能布控',
    quality: '蓝',
    cost: 2,
    type: 2,
    img: new URL('@/assets/zhongzu/yinmizhe/lingnengbukong.jpg', import.meta.url),
    data: [
      [0, 0, '回合结束:在敌方区域召唤灵能炸弹-lv12、抽一张牌'],
      [0, 0, '回合结束:在敌方区域召唤灵能炸弹-lv13、抽一张牌'],
      [0, 0, '回合结束:在敌方区域召唤灵能炸弹-lv14、抽一张牌'],
      [0, 0, '回合结束:在敌方区域召唤灵能炸弹-lv15、抽一张牌'],
      [0, 0, '回合结束:在敌方区域召唤灵能炸弹-lv16、抽一张牌'],
      [0, 0, '回合结束:在敌方区域召唤灵能炸弹-lv17、抽一张牌'],
      [0, 0, '回合结束:在敌方区域召唤灵能炸弹-lv18、抽一张牌'],
      [0, 0, '回合结束:在敌方区域召唤灵能炸弹-lv19、抽一张牌'],
      [0, 0, '回合结束:在敌方区域召唤灵能炸弹-lv20、抽一张牌']
    ]
  },
  {
    name: '学仆-补给型',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_bujixing.jpg', import.meta.url),
    data: [
      [5, 30, '回合结束:你每有1点法力，自身+2/+3'],
      [6, 32, '回合结束:你每有1点法力，自身+2/+3'],
      [6, 35, '回合结束:你每有1点法力，自身+2/+4'],
      [7, 37, '回合结束:你每有1点法力，自身+2/+4'],
      [8, 40, '回合结束:你每有1点法力，自身+2/+4'],
      [9, 43, '回合结束:你每有1点法力，自身+2/+5'],
      [10, 48, '回合结束:你每有1点法力，自身+2/+5'],
      [12, 50, '回合结束:你每有1点法力，自身+2/+6'],
      [14, 55, '回合结束:你每有1点法力，自身+2/+6']
    ]
  },
  {
    name: '魔药系学士',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/moyaoxixueshi.jpg', import.meta.url),
    data: [
      [9, 17, '登场:获得卡牌《扭曲之力》-lv12'],
      [10, 19, '登场:获得卡牌《扭曲之力》-lv13'],
      [11, 22, '登场:获得卡牌《扭曲之力》-lv14'],
      [12, 25, '登场:获得卡牌《扭曲之力》-lv15'],
      [13, 28, '登场:获得卡牌《扭曲之力》-lv16'],
      [15, 29, '登场:获得卡牌《扭曲之力》-lv17'],
      [17, 30, '登场:获得卡牌《扭曲之力》-lv18'],
      [19, 33, '登场:获得卡牌《扭曲之力》-lv19'],
      [21, 36, '登场:获得卡牌《扭曲之力》-lv20']
    ]
  },
  {
    name: '生命工组',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/shengminggongzu.jpg', import.meta.url),
    data: [
      [9, 26, '回合开始:你每有1点法力，英雄生命+3'],
      [10, 28, '回合开始:你每有1点法力，英雄生命+4'],
      [12, 30, '回合开始:你每有1点法力，英雄生命+4'],
      [13, 35, '回合开始:你每有1点法力，英雄生命+4'],
      [13, 39, '回合开始:你每有1点法力，英雄生命+4'],
      [15, 42, '回合开始:你每有1点法力，英雄生命+5'],
      [16, 45, '回合开始:你每有1点法力，英雄生命+6'],
      [18, 50, '回合开始:你每有1点法力，英雄生命+6'],
      [20, 55, '回合开始:你每有1点法力，英雄生命+6']
    ]
  },
  {
    name: '学仆-投射型',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_toushexing.jpg', import.meta.url),
    data: [
      [13, 13, '攻击前:投射5点伤害'],
      [14, 14, '攻击前:投射6点伤害'],
      [16, 16, '攻击前:投射6点伤害'],
      [17, 17, '攻击前:投射7点伤害'],
      [18, 18, '攻击前:投射8点伤害'],
      [19, 19, '攻击前:投射9点伤害'],
      [20, 20, '攻击前:投射10点伤害'],
      [22, 22, '攻击前:投射11点伤害'],
      [24, 24, '攻击前:投射12点伤害']
    ]
  },
  {
    name: '虚化术',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/yinmizhe/xuhuashu.jpg', import.meta.url),
    data: [
      [0, 0, '目标单位+10/+16，并获得【穿透】'],
      [0, 0, '目标单位+12/+18，并获得【穿透】'],
      [0, 0, '目标单位+13/+22，并获得【穿透】'],
      [0, 0, '目标单位+15/+25，并获得【穿透】'],
      [0, 0, '目标单位+18/+26，并获得【穿透】'],
      [0, 0, '目标单位+20/+29，并获得【穿透】'],
      [0, 0, '目标单位+22/+32，并获得【穿透】'],
      [0, 0, '目标单位+24/+35，并获得【穿透】'],
      [0, 0, '目标单位+26/+38，并获得【穿透】']
    ]
  },
  {
    name: '全数否定',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/yinmizhe/quanshufouding.jpg', import.meta.url),
    data: [
      [0, 0, '【洞察1】、横排敌军攻击-12'],
      [0, 0, '【洞察1】、横排敌军攻击-14'],
      [0, 0, '【洞察1】、横排敌军攻击-16'],
      [0, 0, '【洞察1】、横排敌军攻击-18'],
      [0, 0, '【洞察1】、横排敌军攻击-20'],
      [0, 0, '【洞察1】、横排敌军攻击-22'],
      [0, 0, '【洞察1】、横排敌军攻击-25'],
      [0, 0, '【洞察1】、横排敌军攻击-29'],
      [0, 0, '【洞察1】、横排敌军攻击-33']
    ]
  },
  {
    name: '隐秘核心',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/yinmihexing.jpg', import.meta.url),
    data: [
      [0, 35, '【守军】、【隐形】、法力上限+2'],
      [0, 35, '【守军】、【隐形】、法力上限+3'],
      [0, 42, '【守军】、【隐形】、法力上限+3'],
      [0, 50, '【守军】、【隐形】、法力上限+3'],
      [0, 60, '【守军】、【隐形】、法力上限+3'],
      [0, 70, '【守军】、【隐形】、法力上限+3'],
      [0, 80, '【守军】、【隐形】、法力上限+3'],
      [0, 90, '【守军】、【隐形】、法力上限+3'],
      [0, 100, '【守军】、【隐形】、法力上限+3']
    ]
  },
  {
    name: '催眠系教授',
    quality: '蓝',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/cuimianxijiaoshou.jpg', import.meta.url),
    data: [
      [8, 16, '回合开始:每使用过一个法术，随机敌军攻击-6，若是传记，随机敌军不能攻击1回合'],
      [9, 19, '回合开始:每使用过一个法术，随机敌军攻击-6，若是传记，随机敌军不能攻击1回合'],
      [9, 22, '回合开始:每使用过一个法术，随机敌军攻击-7，若是传记，随机敌军不能攻击1回合'],
      [10, 25, '回合开始:每使用过一个法术，随机敌军攻击-7，若是传记，随机敌军不能攻击1回合'],
      [12, 27, '回合开始:每使用过一个法术，随机敌军攻击-8，若是传记，随机敌军不能攻击1回合'],
      [14, 29, '回合开始:每使用过一个法术，随机敌军攻击-8，若是传记，随机敌军不能攻击1回合'],
      [16, 30, '回合开始:每使用过一个法术，随机敌军攻击-9，若是传记，随机敌军不能攻击1回合'],
      [18, 33, '回合开始:每使用过一个法术，随机敌军攻击-9，若是传记，随机敌军不能攻击1回合'],
      [20, 36, '回合开始:每使用过一个法术，随机敌军攻击-10，若是传记，随机敌军不能攻击1回合']
    ]
  },
  {
    name: '虚化印记',
    quality: '蓝',
    cost: 3,
    type: 2,
    img: new URL('@/assets/zhongzu/yinmizhe/xuhuayinji.jpg', import.meta.url),
    data: [
      [0, 0, '目标敌军攻击-27，获得【隐形】'],
      [0, 0, '目标敌军攻击-30，获得【隐形】'],
      [0, 0, '目标敌军攻击-35，获得【隐形】'],
      [0, 0, '目标敌军攻击-40，获得【隐形】'],
      [0, 0, '目标敌军攻击-45，获得【隐形】'],
      [0, 0, '目标敌军攻击-50，获得【隐形】'],
      [0, 0, '目标敌军攻击-55，获得【隐形】'],
      [0, 0, '目标敌军攻击-60，获得【隐形】'],
      [0, 0, '目标敌军攻击-65，获得【隐形】']
    ]
  },
  {
    name: '滋养守卫',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/ziyangshouwei.jpg', import.meta.url),
    data: [
      [8, 33, '攻击前:你每有1点法力，吸取随机敌军2点攻击'],
      [9, 36, '攻击前:你每有1点法力，吸取随机敌军2点攻击'],
      [10, 40, '攻击前:你每有1点法力，吸取随机敌军2点攻击'],
      [11, 45, '攻击前:你每有1点法力，吸取随机敌军2点攻击'],
      [12, 45, '攻击前:你每有1点法力，吸取随机敌军3点攻击'],
      [14, 50, '攻击前:你每有1点法力，吸取随机敌军3点攻击'],
      [16, 55, '攻击前:你每有1点法力，吸取随机敌军3点攻击'],
      [18, 60, '攻击前:你每有1点法力，吸取随机敌军3点攻击'],
      [20, 66, '攻击前:你每有1点法力，吸取随机敌军3点攻击']
    ]
  },
  {
    name: '幻象熊',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/huanxiangxiong.jpg', import.meta.url),
    data: [
      [22, 22, '【践踏】、【幻象】'],
      [24, 24, '【践踏】、【幻象】'],
      [26, 26, '【践踏】、【幻象】'],
      [29, 29, '【践踏】、【幻象】'],
      [32, 32, '【践踏】、【幻象】'],
      [36, 36, '【践踏】、【幻象】'],
      [40, 40, '【践踏】、【幻象】'],
      [45, 45, '【践踏】、【幻象】'],
      [50, 50, '【践踏】、【幻象】']
    ]
  },
  {
    name: '学仆-焚化型',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_fenhuaxing.jpg', import.meta.url),
    data: [
      [7, 27, '回合开始:其他所有生物受到1点伤害、充能:敌方所有生物受到3点伤害'],
      [8, 31, '回合开始:其他所有生物受到1点伤害、充能:敌方所有生物受到3点伤害'],
      [9, 35, '回合开始:其他所有生物受到1点伤害、充能:敌方所有生物受到3点伤害'],
      [10, 40, '回合开始:其他所有生物受到1点伤害、充能:敌方所有生物受到3点伤害'],
      [11, 44, '回合开始:其他所有生物受到1点伤害、充能:敌方所有生物受到3点伤害'],
      [13, 48, '回合开始:其他所有生物受到1点伤害、充能:敌方所有生物受到4点伤害'],
      [15, 52, '回合开始:其他所有生物受到1点伤害、充能:敌方所有生物受到4点伤害'],
      [17, 57, '回合开始:其他所有生物受到1点伤害、充能:敌方所有生物受到4点伤害'],
      [20, 60, '回合开始:其他所有生物受到1点伤害、充能:敌方所有生物受到4点伤害']
    ]
  },
  {
    name: '学仆-渗透型',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_shentouxing.jpg', import.meta.url),
    data: [
      [16, 16, '【洞察1】、【穿透】、【护甲4】'],
      [17, 17, '【洞察1】、【穿透】、【护甲5】'],
      [19, 19, '【洞察1】、【穿透】、【护甲5】'],
      [21, 21, '【洞察1】、【穿透】、【护甲6】'],
      [23, 24, '【洞察1】、【穿透】、【护甲6】'],
      [25, 25, '【洞察1】、【穿透】、【护甲7】'],
      [28, 28, '【洞察1】、【穿透】、【护甲7】'],
      [31, 31, '【洞察1】、【穿透】、【护甲8】'],
      [35, 35, '【洞察1】、【穿透】、【护甲8】']
    ]
  },
  {
    name: '学仆-魔蛛型',
    quality: '蓝',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_mozhuxing.jpg', import.meta.url),
    data: [
      [14, 11, '【先攻】、攻击前：本回合每使用过一个法术自身+5/+2'],
      [15, 13, '【先攻】、攻击前：本回合每使用过一个法术自身+5/+3'],
      [17, 14, '【先攻】、攻击前：本回合每使用过一个法术自身+6/+3'],
      [19, 15, '【先攻】、攻击前：本回合每使用过一个法术自身+6/+4'],
      [21, 16, '【先攻】、攻击前：本回合每使用过一个法术自身+7/+4'],
      [24, 18, '【先攻】、攻击前：本回合每使用过一个法术自身+7/+5'],
      [27, 20, '【先攻】、攻击前：本回合每使用过一个法术自身+8/+5'],
      [30, 22, '【先攻】、攻击前：本回合每使用过一个法术自身+8/+6'],
      [33, 25, '【先攻】、攻击前：本回合每使用过一个法术自身+9/+6']
    ]
  },
  {
    name: '黑曜石像鬼',
    quality: '蓝',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/heiyaoshixianggui.jpg', import.meta.url),
    data: [
      [12, 30, '【迟缓】、敌方法力上限-1、登场回合具有【护甲12】'],
      [13, 33, '【迟缓】、敌方法力上限-1、登场回合具有【护甲14】'],
      [14, 36, '【迟缓】、敌方法力上限-1、登场回合具有【护甲16】'],
      [15, 39, '【迟缓】、敌方法力上限-1、登场回合具有【护甲20】'],
      [18, 40, '【迟缓】、敌方法力上限-1、登场回合具有【护甲20】'],
      [21, 42, '【迟缓】、敌方法力上限-1、登场回合具有【护甲21】'],
      [24, 45, '【迟缓】、敌方法力上限-1、登场回合具有【护甲24】'],
      [27, 50, '【迟缓】、敌方法力上限-1、登场回合具有【护甲27】'],
      [30, 55, '【迟缓】、敌方法力上限-1、登场回合具有【护甲30】']
    ]
  },
  {
    name: '学仆-战斗型',
    quality: '蓝',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_zhandouxing.jpg', import.meta.url),
    data: [
      [19, 19, '充能:自身-1/-1，随机敌军受到8点伤害'],
      [20, 20, '充能:自身-1/-1，随机敌军受到9点伤害'],
      [23, 23, '充能:自身-1/-1，随机敌军受到9点伤害'],
      [25, 25, '充能:自身-1/-1，随机敌军受到10点伤害'],
      [28, 28, '充能:自身-1/-1，随机敌军受到10点伤害'],
      [31, 31, '充能:自身-1/-1，随机敌军受到11点伤害'],
      [35, 35, '充能:自身-1/-1，随机敌军受到12点伤害'],
      [40, 40, '充能:自身-1/-1，随机敌军受到13点伤害'],
      [45, 45, '充能:自身-1/-1，随机敌军受到14点伤害']
    ]
  },
  {
    name: '学仆-能源型',
    quality: '蓝',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_nengyuanxing.jpg', import.meta.url),
    data: [
      [8, 23, '【护甲5】、法力上限+2'],
      [10, 24, '【护甲6】、法力上限+2'],
      [12, 26, '【护甲6】、法力上限+2'],
      [14, 29, '【护甲7】、法力上限+2'],
      [16, 32, '【护甲7】、法力上限+2'],
      [18, 35, '【护甲8】、法力上限+2'],
      [20, 40, '【护甲8】、法力上限+2'],
      [22, 45, '【护甲9】、法力上限+2'],
      [25, 50, '【护甲9】、法力上限+2']
    ]
  },
  {
    name: '魔咒老妪',
    quality: '蓝',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/mozhoulaoyu.jpg', import.meta.url),
    data: [
      [9, 15, '登场:对手弃一张牌，对手无手牌，随机敌军-20/-4，被沉默'],
      [10, 16, '登场:对手弃一张牌，对手无手牌，随机敌军-20/-5，被沉默'],
      [11, 18, '登场:对手弃一张牌，对手无手牌，随机敌军-20/-6，被沉默'],
      [12, 20, '登场:对手弃一张牌，对手无手牌，随机敌军-20/-7，被沉默'],
      [13, 23, '登场:对手弃一张牌，对手无手牌，随机敌军-20/-7，被沉默'],
      [15, 25, '登场:对手弃一张牌，对手无手牌，随机敌军-20/-11，被沉默'],
      [17, 27, '登场:对手弃一张牌，对手无手牌，随机敌军-20/-13，被沉默'],
      [20, 30, '登场:对手弃一张牌，对手无手牌，随机敌军-20/-16，被沉默'],
      [23, 33, '登场:对手弃一张牌，对手无手牌，随机敌军-20/-20，被沉默']
    ]
  },
  {
    name: '请示隐秘者',
    quality: '蓝',
    cost: 5,
    type: 2,
    img: new URL('@/assets/zhongzu/yinmizhe/qingshiyinmizhe.jpg', import.meta.url),
    data: [
      [0, 0, '【洞察1】、抽2张牌、随机友军生命+25、充能:多抽一张牌'],
      [0, 0, '【洞察1】、抽2张牌、随机友军生命+30、充能:多抽一张牌'],
      [0, 0, '【洞察1】、抽2张牌、随机友军生命+35、充能:多抽一张牌'],
      [0, 0, '【洞察1】、抽2张牌、随机友军生命+40、充能:多抽一张牌'],
      [0, 0, '【洞察1】、抽2张牌、随机友军生命+45、充能:多抽一张牌'],
      [0, 0, '【洞察1】、抽2张牌、随机友军生命+50、充能:多抽一张牌'],
      [0, 0, '【洞察1】、抽2张牌、随机友军生命+55、充能:多抽一张牌'],
      [0, 0, '【洞察1】、抽2张牌、随机友军生命+60、充能:多抽一张牌'],
      [0, 0, '【洞察1】、抽2张牌、随机友军生命+66、充能:多抽一张牌']
    ]
  },
  {
    name: '隐形术',
    quality: '紫',
    cost: 1,
    type: 2,
    img: new URL('@/assets/zhongzu/yinmizhe/yinxingshu.jpg', import.meta.url),
    data: [
      [0, 0, '【洞察1】、目标单位+8/+8，获得【隐形】'],
      [0, 0, '【洞察1】、目标单位+9/+10，获得【隐形】'],
      [0, 0, '【洞察1】、目标单位+11/+11，获得【隐形】'],
      [0, 0, '【洞察1】、目标单位+13/+13，获得【隐形】'],
      [0, 0, '【洞察1】、目标单位+15/+15，获得【隐形】'],
      [0, 0, '【洞察1】、目标单位+16/+18，获得【隐形】'],
      [0, 0, '【洞察1】、目标单位+18/+20，获得【隐形】'],
      [0, 0, '【洞察1】、目标单位+21/+21，获得【隐形】'],
      [0, 0, '【洞察1】、目标单位+23/+23，获得【隐形】']
    ]
  },
  {
    name: '学仆-冲锋型',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_chongfengxing.jpg', import.meta.url),
    data: [
      [11, 9, '【先攻】、攻击前:你每有1点法力，自身+2/+1'],
      [12, 11, '【先攻】、攻击前:你每有1点法力，自身+2/+1'],
      [13, 13, '【先攻】、攻击前:你每有1点法力，自身+2/+1'],
      [15, 13, '【先攻】、攻击前:你每有1点法力，自身+2/+2'],
      [16, 15, '【先攻】、攻击前:你每有1点法力，自身+2/+2'],
      [18, 16, '【先攻】、攻击前:你每有1点法力，自身+2/+2'],
      [20, 17, '【先攻】、攻击前:你每有1点法力，自身+3/+2'],
      [22, 19, '【先攻】、攻击前:你每有1点法力，自身+3/+2'],
      [25, 20, '【先攻】、攻击前:你每有1点法力，自身+3/+2']
    ]
  },
  {
    name: '咒术系学士',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/zhoushuxixueshi.jpg', import.meta.url),
    data: [
      [4, 17, '回合结束:若本回合你使用过法术，抓一张牌，英雄生命+12，若为传记则自身+4/+4'],
      [5, 19, '回合结束:若本回合你使用过法术，抓一张牌，英雄生命+13，若为传记则自身+4/+4'],
      [6, 21, '回合结束:若本回合你使用过法术，抓一张牌，英雄生命+14，若为传记则自身+5/+5'],
      [7, 23, '回合结束:若本回合你使用过法术，抓一张牌，英雄生命+15，若为传记则自身+5/+5'],
      [8, 26, '回合结束:若本回合你使用过法术，抓一张牌，英雄生命+16，若为传记则自身+6/+6'],
      [10, 28, '回合结束:若本回合你使用过法术，抓一张牌，英雄生命+18，若为传记则自身+6/+6'],
      [12, 30, '回合结束:若本回合你使用过法术，抓一张牌，英雄生命+20，若为传记则自身+7/+7'],
      [15, 32, '回合结束:若本回合你使用过法术，抓一张牌，英雄生命+22，若为传记则自身+8/+8'],
      [18, 35, '回合结束:若本回合你使用过法术，抓一张牌，英雄生命+24，若为传记则自身+9/+9']
    ]
  },
  {
    name: '破魔系教授',
    quality: '紫',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/pomoxijiaoshou.jpg', import.meta.url),
    data: [
      [7, 13, '【洞察1】、登场:沉默随机敌军、命中时:40%几率【洞察1】、回合结束:25%几率沉默随机敌军'],
      [8, 14, '【洞察1】、登场:沉默随机敌军、命中时:40%几率【洞察1】、回合结束:30%几率沉默随机敌军'],
      [9, 16, '【洞察1】、登场:沉默随机敌军、命中时:50%几率【洞察1】、回合结束:30%几率沉默随机敌军'],
      [10, 18, '【洞察1】、登场:沉默随机敌军、命中时:50%几率【洞察1】、回合结束:35%几率沉默随机敌军'],
      [12, 19, '【洞察1】、登场:沉默随机敌军、命中时:50%几率【洞察1】、回合结束:35%几率沉默随机敌军'],
      [14, 20, '【洞察1】、登场:沉默随机敌军、命中时:55%几率【洞察1】、回合结束:35%几率沉默随机敌军'],
      [16, 22, '【洞察1】、登场:沉默随机敌军、命中时:55%几率【洞察1】、回合结束:35%几率沉默随机敌军'],
      [18, 25, '【洞察1】、登场:沉默随机敌军、命中时:60%几率【洞察1】、回合结束:35%几率沉默随机敌军'],
      [21, 27, '【洞察1】、登场:沉默随机敌军、命中时:65%几率【洞察1】、回合结束:35%几率沉默随机敌军']
    ]
  },
  {
    name: '克隆术',
    quality: '紫',
    cost: 2,
    type: 2,
    img: new URL('@/assets/zhongzu/yinmizhe/kelongshu.jpg', import.meta.url),
    data: [
      [0, 0, '复制目标单位到手上，英雄生命+20'],
      [0, 0, '复制目标单位到手上，英雄生命+22'],
      [0, 0, '【洞察1】、复制目标单位到手上，英雄生命+22'],
      [0, 0, '【洞察1】、复制目标单位到手上，英雄生命+25'],
      [0, 0, '【洞察1】、复制目标单位到手上，英雄生命+28'],
      [0, 0, '【洞察1】、复制目标单位到手上，英雄生命+30'],
      [0, 0, '【洞察1】、复制目标单位到手上，英雄生命+33'],
      [0, 0, '【洞察1】、复制目标单位到手上，英雄生命+36'],
      [0, 0, '【洞察1】、复制目标单位到手上，英雄生命+40']
    ]
  },
  {
    name: '防护系教授',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/fanghuxijiaoshou.jpg', import.meta.url),
    data: [
      [6, 24, '回合开始:随机敌军攻击-3，随机友军生命+3'],
      [7, 26, '回合开始:随机敌军攻击-3，随机友军生命+4'],
      [8, 30, '回合开始:随机敌军攻击-4，随机友军生命+4'],
      [10, 33, '回合开始:随机敌军攻击-4，随机友军生命+4'],
      [12, 36, '回合开始:随机敌军攻击-4，随机友军生命+4'],
      [13, 40, '回合开始:随机敌军攻击-5，随机友军生命+5'],
      [15, 45, '回合开始:随机敌军攻击-5，随机友军生命+5'],
      [17, 50, '回合开始:随机敌军攻击-6，随机友军生命+6'],
      [20, 55, '回合开始:随机敌军攻击-6，随机友军生命+6']
    ]
  },
  {
    name: '魔像-御咒铁卫',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/moxiang_yuzhoutiewei.jpg', import.meta.url),
    data: [
      [13, 13, '【护甲6】、攻击前:本回合你每使用过一个法术，自身+3/+3，护甲+1，若为传记则护甲额外+1'],
      [14, 15, '【护甲6】、攻击前:本回合你每使用过一个法术，自身+3/+4，护甲+1，若为传记则护甲额外+1'],
      [16, 16, '【护甲7】、攻击前:本回合你每使用过一个法术，自身+3/+4，护甲+2，若为传记则护甲额外+1'],
      [18, 18, '【护甲7】、攻击前:本回合你每使用过一个法术，自身+4/+4，护甲+2，若为传记则护甲额外+1'],
      [20, 20, '【护甲8】、攻击前:本回合你每使用过一个法术，自身+4/+4，护甲+2，若为传记则护甲额外+1'],
      [22, 22, '【护甲8】、攻击前:本回合你每使用过一个法术，自身+5/+5，护甲+2，若为传记则护甲额外+1'],
      [24, 24, '【护甲9】、攻击前:本回合你每使用过一个法术，自身+5/+5，护甲+2，若为传记则护甲额外+1'],
      [27, 27, '【护甲9】、攻击前:本回合你每使用过一个法术，自身+6/+6，护甲+2，若为传记则护甲额外+1'],
      [30, 30, '【护甲10】、攻击前:本回合你每使用过一个法术，自身+6/+6，护甲+2，若为传记则护甲额外+1']
    ]
  },
  {
    name: '缄言法师',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/jianyanfashi.jpg', import.meta.url),
    data: [
      [15, 6, '登场:获得卡牌《沉默术》-lv6、死亡:获得《沉默术》-lv6'],
      [16, 8, '登场:获得卡牌《沉默术》-lv6、死亡:获得《沉默术》-lv6'],
      [17, 9, '登场:获得卡牌《沉默术》-lv7、死亡:获得《沉默术》-lv7'],
      [19, 9, '登场:获得卡牌《沉默术》-lv7、死亡:获得《沉默术》-lv7'],
      [20, 10, '登场:获得卡牌《沉默术》-lv8、死亡:获得《沉默术》-lv8'],
      [22, 10, '登场:获得卡牌《沉默术》-lv9、死亡:获得《沉默术》-lv9'],
      [23, 11, '登场:获得卡牌《沉默术》-lv10、死亡:获得《沉默术》-lv10'],
      [25, 12, '登场:获得卡牌《沉默术》-lv11、死亡:获得《沉默术》-lv11'],
      [27, 13, '登场:获得卡牌《沉默术》-lv12、死亡:获得《沉默术》-lv12']
    ]
  },
  {
    name: '学仆-猛禽型',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_mengqinxing.jpg', import.meta.url),
    data: [
      [12, 3, '【先攻】、命中时：【洞察1】、洞察时：全体先攻友军攻击+5'],
      [13, 3, '【先攻】、命中时：【洞察1】、洞察时：全体先攻友军攻击+5'],
      [14, 4, '【先攻】、命中时：【洞察1】、洞察时：全体先攻友军攻击+6'],
      [15, 6, '【先攻】、命中时：【洞察1】、洞察时：全体先攻友军攻击+6'],
      [17, 7, '【先攻】、命中时：【洞察1】、洞察时：全体先攻友军攻击+7'],
      [20, 8, '【先攻】、命中时：【洞察1】、洞察时：全体先攻友军攻击+7'],
      [22, 10, '【先攻】、命中时：【洞察1】、洞察时：全体先攻友军攻击+8'],
      [25, 12, '【先攻】、命中时：【洞察1】、洞察时：全体先攻友军攻击+8'],
      [27, 15, '【先攻】、命中时：【洞察1】、洞察时：全体先攻友军攻击+9']
    ]
  },
  {
    name: '学仆-脉冲型',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_maichongxing.jpg', import.meta.url),
    data: [
      [7, 14, '【洞察1】、洞察时：自身+1/+6，射击英雄'],
      [8, 15, '【洞察1】、洞察时：自身+1/+6，射击英雄'],
      [9, 16, '【洞察1】、洞察时：自身+2/+6，射击英雄'],
      [10, 18, '【洞察1】、洞察时：自身+2/+6，射击英雄'],
      [11, 20, '【洞察1】、洞察时：自身+2/+6，射击英雄'],
      [12, 21, '【洞察1】、洞察时：自身+2/+7，射击英雄'],
      [13, 24, '【洞察1】、洞察时：自身+2/+7，射击英雄'],
      [15, 26, '【洞察1】、洞察时：自身+2/+8，射击英雄'],
      [16, 30, '【洞察1】、洞察时：自身+3/+8，射击英雄']
    ]
  },
  {
    name: '夜幕魔宠',
    quality: '紫',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/yemumochong.jpg', import.meta.url),
    data: [
      [11, 7, '【魔防10】、登场、命中英雄:敌方一张手牌法力+1'],
      [12, 8, '【魔防11】、登场、命中英雄:敌方一张手牌法力+1'],
      [13, 9, '【魔防12】、登场、命中英雄:敌方一张手牌法力+1'],
      [15, 10, '【魔防13】、登场、命中英雄:敌方一张手牌法力+1'],
      [16, 12, '【魔防14】、登场、命中英雄:敌方一张手牌法力+1'],
      [18, 13, '【魔防15】、登场、命中英雄:敌方一张手牌法力+1'],
      [19, 16, '【魔防16】、登场、命中英雄:敌方一张手牌法力+1'],
      [21, 18, '【魔防17】、登场、命中英雄:敌方一张手牌法力+1'],
      [24, 19, '【魔防18】、登场、命中英雄:敌方一张手牌法力+1']
    ]
  },
  {
    name: '白首魔根',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/baishoumogen.jpg', import.meta.url),
    data: [
      [6, 30, '【洞察1】、【魔免】、回合结束:自身攻击加倍'],
      [7, 33, '【洞察1】、【魔免】、回合结束:自身攻击加倍'],
      [8, 36, '【洞察1】、【魔免】、回合结束:自身攻击加倍'],
      [9, 40, '【洞察1】、【魔免】、回合结束:自身攻击加倍'],
      [10, 45, '【洞察1】、【魔免】、回合结束:自身攻击加倍'],
      [11, 50, '【洞察1】、【魔免】、回合结束:自身攻击加倍'],
      [13, 55, '【洞察1】、【魔免】、回合结束:自身攻击加倍'],
      [15, 60, '【洞察1】、【魔免】、回合结束:自身攻击加倍'],
      [17, 67, '【洞察1】、【魔免】、回合结束:自身攻击加倍']
    ]
  },
  {
    name: '幻域秘树',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/huanyumishu.jpg', import.meta.url),
    data: [
      [0, 32, '【洞察1】、法力上限+2、回合开始:随机敌军-x/-x(x为你的法力)'],
      [0, 33, '【洞察1】、【魔防2】、法力上限+2、回合开始:随机敌军-x/-x(x为你的法力)'],
      [0, 35, '【洞察1】、【魔防3】、法力上限+2、回合开始:随机敌军-x/-x(x为你的法力)'],
      [0, 37, '【洞察1】、【魔防4】、法力上限+2、回合开始:随机敌军-x/-x(x为你的法力)'],
      [0, 39, '【洞察1】、【魔防5】、法力上限+2、回合开始:随机敌军-x/-x(x为你的法力)'],
      [0, 42, '【洞察1】、【魔防5】、法力上限+2、回合开始:随机敌军-x/-x(x为你的法力)'],
      [0, 45, '【洞察1】、【魔防5】、法力上限+2、回合开始:随机敌军-x/-x(x为你的法力)'],
      [0, 49, '【洞察1】、【魔防6】、法力上限+2、回合开始:随机敌军-x/-x(x为你的法力)'],
      [0, 54, '【洞察1】、【魔防6】、法力上限+2、回合开始:随机敌军-x/-x(x为你的法力)']
    ]
  },
  {
    name: '改造魔卷',
    quality: '紫',
    cost: 4,
    type: 2,
    img: new URL('@/assets/zhongzu/yinmizhe/gaizaomojuan.jpg', import.meta.url),
    data: [
      [0, 0, '消灭敌方单位，获得7/7量产型学仆-lv12'],
      [0, 0, '消灭敌方单位，获得8/8量产型学仆-lv13、0/1量产型学仆-lv1'],
      [0, 0, '消灭敌方单位，获得9/9量产型学仆-lv14、1/2量产型学仆-lv3'],
      [0, 0, '消灭敌方单位，获得10/10量产型学仆-lv15、3/3量产型学仆-lv6'],
      [0, 0, '消灭敌方单位，获得11/11量产型学仆-lv16、5/5量产型学仆-lv10'],
      [0, 0, '消灭敌方单位，获得12/12量产型学仆-lv17、6/6量产型学仆-lv11'],
      [0, 0, '消灭敌方单位，获得13/13量产型学仆-lv18、8/8量产型学仆-lv13'],
      [0, 0, '消灭敌方单位，获得14/14量产型学仆-lv19、10/10量产型学仆-lv15'],
      [0, 0, '消灭敌方单位，获得15/15量产型学仆-lv20、12/12量产型学仆-lv17']
    ]
  },
  {
    name: '实验室流浆',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/shiyanshiliujiang.jpg', import.meta.url),
    data: [
      [10, 27, '回合结束:若本回合受到过伤害，在相邻位置复制一个自己'],
      [11, 30, '回合结束:若本回合受到过伤害，在相邻位置复制一个自己'],
      [12, 33, '回合结束:若本回合受到过伤害，在相邻位置复制一个自己'],
      [13, 37, '回合结束:若本回合受到过伤害，在相邻位置复制一个自己'],
      [15, 40, '回合结束:若本回合受到过伤害，在相邻位置复制一个自己'],
      [16, 45, '回合结束:若本回合受到过伤害，在相邻位置复制一个自己'],
      [18, 49, '回合结束:若本回合受到过伤害，在相邻位置复制一个自己'],
      [20, 55, '回合结束:若本回合受到过伤害，在相邻位置复制一个自己'],
      [23, 60, '回合结束:若本回合受到过伤害，在相邻位置复制一个自己']
    ]
  },
  {
    name: '学仆-塑钢型',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_sugangxing.jpg', import.meta.url),
    data: [
      [18, 19, '【磐龙】、【护甲7】、洞察时：自身+2/+5，护甲+1'],
      [20, 20, '【磐龙】、【护甲8】、洞察时：自身+2/+5，护甲+1'],
      [21, 21, '【磐龙】、【护甲9】、洞察时：自身+2/+5，护甲+2'],
      [23, 23, '【磐龙】、【护甲10】、洞察时：自身+2/+5，护甲+2'],
      [26, 26, '【磐龙】、【护甲11】、洞察时：自身+3/+5，护甲+2'],
      [29, 29, '【磐龙】、【护甲12】、洞察时：自身+3/+5，护甲+2'],
      [32, 32, '【磐龙】、【护甲13】、洞察时：自身+3/+6，护甲+3'],
      [35, 35, '【磐龙】、【护甲14】、洞察时：自身+3/+6，护甲+3'],
      [38, 38, '【磐龙】、【护甲15】、洞察时：自身+3/+6，护甲+3']
    ]
  },
  {
    name: '幻象系教授',
    quality: '紫',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/huanxiangxijiaoshou.jpg', import.meta.url),
    data: [
      [11, 12, '登场:前方位置召唤5/5幻象蛇-lv6、回合开始:随机幻象友军+7/+7，获得【回命】'],
      [13, 13, '登场:前方位置召唤7/7幻象蛇-lv7、回合开始:随机幻象友军+8/+8，获得【回命】'],
      [14, 15, '登场:前方位置召唤9/9幻象蛇-lv8、回合开始:随机幻象友军+9/+9，获得【回命】'],
      [16, 16, '登场:前方位置召唤10/10幻象蛇-lv9、回合开始:随机幻象友军+10/+10，获得【回命】'],
      [17, 18, '登场:前方位置召唤11/11幻象蛇-lv10、回合开始:随机幻象友军+11/+11，获得【回命】'],
      [19, 19, '登场:前方位置召唤12/12幻象蛇-lv11、回合开始:随机幻象友军+12/+12，获得【回命】'],
      [21, 21, '登场:前方位置召唤14/14幻象蛇-lv13、回合开始:随机幻象友军+13/+13，获得【回命】'],
      [23, 23, '登场:前方位置召唤16/16幻象蛇-lv14、回合开始:随机幻象友军+14/+14，获得【回命】'],
      [25, 25, '登场:前方位置召唤18/18幻象蛇-lv15、回合开始:随机幻象友军+15/+15，获得【回命】']
    ]
  },
  {
    name: '魔像-术法风暴',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/moxiang_shufafengbao.jpg', import.meta.url),
    data: [
      [16, 30, '【践踏】、【磐龙】、攻击前:本回你每施放过一个法术，自身+5/+5，若为传记则获得【连击】1回合'],
      [18, 33, '【践踏】、【磐龙】、攻击前:本回你每施放过一个法术，自身+6/+6，若为传记则获得【连击】1回合'],
      [20, 36, '【践踏】、【磐龙】、攻击前:本回你每施放过一个法术，自身+6/+6，若为传记则获得【连击】1回合'],
      [22, 40, '【践踏】、【磐龙】、攻击前:本回你每施放过一个法术，自身+7/+7，若为传记则获得【连击】1回合'],
      [25, 45, '【践踏】、【磐龙】、攻击前:本回你每施放过一个法术，自身+7/+7，若为传记则获得【连击】1回合'],
      [27, 50, '【践踏】、【磐龙】、攻击前:本回你每施放过一个法术，自身+8/+8，若为传记则获得【连击】1回合'],
      [30, 58, '【践踏】、【磐龙】、攻击前:本回你每施放过一个法术，自身+8/+8，若为传记则获得【连击】1回合'],
      [33, 65, '【践踏】、【磐龙】、攻击前:本回你每施放过一个法术，自身+9/+9，若为传记则获得【连击】1回合'],
      [35, 75, '【践踏】、【磐龙】、攻击前:本回你每施放过一个法术，自身+10/+10，若为传记则获得【连击】1回合']
    ]
  },
  {
    name: '召熊幻术师',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/zhaoxionghuanshushi.jpg', import.meta.url),
    data: [
      [5, 5, '登场、回合结束:召唤22/22幻象熊-lv12'],
      [6, 6, '登场、回合结束:召唤24/24幻象熊-lv13'],
      [7, 7, '登场、回合结束:召唤26/26幻象熊-lv14'],
      [8, 8, '登场、回合结束:召唤29/29幻象熊-lv15'],
      [9, 9, '登场、回合结束:召唤32/32幻象熊-lv16'],
      [10, 11, '登场、回合结束:召唤36/36幻象熊-lv17'],
      [12, 12, '登场、回合结束:召唤40/40幻象熊-lv18'],
      [13, 14, '登场、回合结束:召唤45/45幻象熊-lv19'],
      [15, 15, '登场、回合结束:召唤50/50幻象熊-lv20']
    ]
  },
  {
    name: '观星台大预言家',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/guanxingtaidayuyanjia.jpg', import.meta.url),
    data: [
      [6, 18, '【洞察1】、【魔防6】、洞察时：抽一张牌'],
      [7, 19, '【洞察1】、【魔防7】、洞察时：抽一张牌'],
      [8, 21, '【洞察1】、【魔防8】、洞察时：抽一张牌'],
      [9, 23, '【洞察1】、【魔防9】、洞察时：抽一张牌'],
      [10, 26, '【洞察1】、【魔防10】、洞察时：抽一张牌'],
      [12, 28, '【洞察1】、【魔防12】、洞察时：抽一张牌'],
      [14, 30, '【洞察1】、【魔防14】、洞察时：抽一张牌'],
      [17, 32, '【洞察1】、【魔防17】、洞察时：抽一张牌'],
      [20, 35, '【洞察1】、【魔防20】、洞察时：抽一张牌']
    ]
  },
  {
    name: '御魔史芬斯',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/yumoshifensi.jpg', import.meta.url),
    data: [
      [19, 15, '【先攻】、登场：全体先攻友军魔防+12，获得【神佑】1回合'],
      [21, 16, '【先攻】、登场：全体先攻友军魔防+13，获得【神佑】1回合'],
      [23, 18, '【先攻】、登场：全体先攻友军魔防+14，获得【神佑】1回合'],
      [25, 20, '【先攻】、登场：全体先攻友军魔防+15，获得【神佑】1回合'],
      [28, 22, '【先攻】、登场：全体先攻友军魔防+16，获得【神佑】1回合'],
      [32, 24, '【先攻】、登场：全体先攻友军魔防+17，获得【神佑】1回合'],
      [36, 26, '【先攻】、登场：全体先攻友军魔防+18，获得【神佑】1回合'],
      [40, 28, '【先攻】、登场：全体先攻友军魔防+19，获得【神佑】1回合'],
      [45, 30, '【先攻】、登场：全体先攻友军魔防+20，获得【神佑】1回合']
    ]
  },
  {
    name: '格斗系教授',
    quality: '紫',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/gedouxijiaoshou.jpg', import.meta.url),
    data: [
      [14, 35, '回合开始:相邻一个友军获得【先攻】1回合，先攻友军+2/+4'],
      [16, 38, '回合开始:相邻一个友军获得【先攻】1回合，先攻友军+2/+4'],
      [18, 42, '回合开始:相邻一个友军获得【先攻】1回合，先攻友军+2/+4'],
      [20, 46, '回合开始:相邻一个友军获得【先攻】1回合，先攻友军+2/+5'],
      [23, 50, '回合开始:相邻一个友军获得【先攻】1回合，先攻友军+2/+5'],
      [25, 53, '回合开始:相邻一个友军获得【先攻】1回合，先攻友军+3/+5'],
      [27, 60, '回合开始:相邻一个友军获得【先攻】1回合，先攻友军+3/+5'],
      [30, 66, '回合开始:相邻一个友军获得【先攻】1回合，先攻友军+3/+5'],
      [33, 70, '回合开始:相邻一个友军获得【先攻】1回合，先攻友军+4/+5']
    ]
  },
  {
    name: '学仆-分裂型',
    quality: '紫',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/xuepu_fenliexing.jpg', import.meta.url),
    data: [
      [20, 27, '攻击前:投射10点伤害、充能:召唤6/6学仆投射型-lv6'],
      [23, 30, '攻击前:投射11点伤害、充能:召唤7/7学仆投射型-lv7'],
      [26, 33, '攻击前:投射12点伤害、充能:召唤8/8学仆投射型-lv8'],
      [29, 40, '攻击前:投射13点伤害、充能:召唤9/9学仆投射型-lv9'],
      [32, 48, '攻击前:投射14点伤害、充能:召唤10/10学仆投射型-lv10'],
      [36, 54, '攻击前:投射16点伤害、充能:召唤11/11学仆投射型-lv11'],
      [40, 60, '攻击前:投射18点伤害、充能:召唤13/13学仆投射型-lv12'],
      [45, 65, '攻击前:投射20点伤害、充能:召唤16/16学仆投射型-lv14'],
      [50, 70, '攻击前:投射22点伤害、充能:召唤18/18学仆投射型-lv16']
    ]
  },
  {
    name: '幻象巨龙',
    quality: '紫',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/huanxiangjulong.jpg', import.meta.url),
    data: [
      [40, 40, '【魔免】、【幻象】、登场:全体敌军攻击-5'],
      [45, 45, '【魔免】、【幻象】、登场:全体敌军攻击-5'],
      [50, 50, '【魔免】、【幻象】、登场:全体敌军攻击-6'],
      [60, 60, '【魔免】、【幻象】、登场:全体敌军攻击-6'],
      [66, 66, '【魔免】、【幻象】、登场:全体敌军攻击-7'],
      [72, 72, '【魔免】、【幻象】、登场:全体敌军攻击-8'],
      [80, 80, '【魔免】、【幻象】、登场:全体敌军攻击-9'],
      [90, 90, '【魔免】、【幻象】、登场:全体敌军攻击-9'],
      [100, 100, '【魔免】、【幻象】、登场:全体敌军攻击-10']
    ]
  },
  {
    name: '巨型石像鬼',
    quality: '紫',
    cost: 7,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/juxingshixianggui.jpg', import.meta.url),
    data: [
      [34, 34, '【迟缓】、敌方法力上限永久-1、登场:吹回随机敌军，本回合具有【护甲20】'],
      [38, 38, '【迟缓】、敌方法力上限永久-1、登场:吹回随机敌军，本回合具有【护甲22】'],
      [43, 43, '【迟缓】、敌方法力上限永久-1、登场:吹回随机敌军，本回合具有【护甲25】'],
      [49, 49, '【迟缓】、敌方法力上限永久-1、登场:吹回随机敌军，本回合具有【护甲30】'],
      [55, 55, '【迟缓】、敌方法力上限永久-1、登场:吹回随机敌军，本回合具有【护甲35】'],
      [62, 62, '【迟缓】、敌方法力上限永久-1、登场:吹回随机敌军，本回合具有【护甲40】'],
      [70, 70, '【迟缓】、敌方法力上限永久-1、登场:吹回随机敌军，本回合具有【护甲45】'],
      [80, 80, '【迟缓】、敌方法力上限永久-1、登场:吹回随机敌军，本回合具有【护甲50】'],
      [90, 90, '【迟缓】、敌方法力上限永久-1、登场:吹回随机敌军，本回合具有【护甲55】']
    ]
  },
  {
    name: '睿智史芬斯',
    quality: '紫',
    cost: 7,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/ruizhishifensi.jpg', import.meta.url),
    data: [
      [15, 49, '充能:随机友军+1/+12、回合结束:抽1张牌，若本回合你有充能，多抽1张牌'],
      [17, 52, '充能:随机友军+1/+13、回合结束:抽1张牌，若本回合你有充能，多抽1张牌'],
      [19, 55, '充能:随机友军+2/+13、回合结束:抽1张牌，若本回合你有充能，多抽1张牌'],
      [21, 59, '充能:随机友军+3/+13、回合结束:抽1张牌，若本回合你有充能，多抽1张牌'],
      [24, 60, '充能:随机友军+3/+14、回合结束:抽1张牌，若本回合你有充能，多抽1张牌'],
      [27, 62, '充能:随机友军+3/+15、回合结束:抽1张牌，若本回合你有充能，多抽1张牌'],
      [30, 65, '充能:随机友军+4/+15、回合结束:抽1张牌，若本回合你有充能，多抽1张牌'],
      [33, 68, '充能:随机友军+4/+16、回合结束:抽1张牌，若本回合你有充能，多抽1张牌'],
      [36, 72, '充能:随机友军+4/+18、回合结束:抽1张牌，若本回合你有充能，多抽1张牌']
    ]
  },
  {
    name: '心灵操控',
    quality: '紫',
    cost: 7,
    type: 2,
    img: new URL('@/assets/zhongzu/yinmizhe/xinlingcaokong.jpg', import.meta.url),
    data: [
      [0, 0, '英雄生命-2，目标单位+9/+9，被你操控'],
      [0, 0, '英雄生命-2，目标单位+10/+10，被你操控'],
      [0, 0, '英雄生命-2，目标单位+11/+11，被你操控'],
      [0, 0, '英雄生命-2，目标单位+12/+12，被你操控'],
      [0, 0, '英雄生命-2，目标单位+13/+13，被你操控'],
      [0, 0, '英雄生命-2，目标单位+14/+14，被你操控'],
      [0, 0, '英雄生命-2，目标单位+15/+15，被你操控'],
      [0, 0, '英雄生命-2，目标单位+17/+17，被你操控'],
      [0, 0, '英雄生命-2，目标单位+19/+19，被你操控']
    ]
  },
  {
    name: '米拉方舟',
    quality: '紫',
    cost: 7,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/milafangzhou.jpg', import.meta.url),
    data: [
      [20, 40, '【洞察1】、【磐龙】、【穿透】、【护甲7】、【魔防7】、洞察时：获得《渗透型》lv11、护甲友军死亡：自身+6/+12'],
      [22, 45, '【洞察1】、【磐龙】、【穿透】、【护甲8】、【魔防8】、洞察时：获得《渗透型》lv13、护甲友军死亡：自身+6/+13'],
      [24, 50, '【洞察1】、【磐龙】、【穿透】、【护甲9】、【魔防9】、洞察时：获得《渗透型》lv14、护甲友军死亡：自身+6/+14'],
      [25, 60, '【洞察1】、【磐龙】、【穿透】、【护甲10】、【魔防10】、洞察时：获得《渗透型》lv15、护甲友军死亡：自身+6/+15'],
      [30, 65, '【洞察1】、【磐龙】、【穿透】、【护甲10】、【魔防10】、洞察时：获得《渗透型》lv16、护甲友军死亡：自身+6/+18'],
      [35, 72, '【洞察1】、【磐龙】、【穿透】、【护甲11】、【魔防11】、洞察时：获得《渗透型》lv17、护甲友军死亡：自身+6/+20'],
      [40, 80, '【洞察1】、【磐龙】、【穿透】、【护甲12】、【魔防12】、洞察时：获得《渗透型》lv18、护甲友军死亡：自身+8/+20'],
      [45, 90, '【洞察1】、【磐龙】、【穿透】、【护甲13】、【魔防13】、洞察时：获得《渗透型》lv19、护甲友军死亡：自身+8/+22'],
      [50, 100, '【洞察1】、【磐龙】、【穿透】、【护甲15】、【魔防15】、洞察时：获得《渗透型》lv20、护甲友军死亡：自身+8/+24']
    ]
  },
  {
    name: '魔钢',
    quality: '紫',
    cost: 8,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/mogang.jpg', import.meta.url),
    data: [
      [45, 45, '【护甲5】、【磐龙】、充能:护甲+3、攻击前:本回合你使用过法术，自身+7/+7'],
      [49, 49, '【护甲6】、【磐龙】、充能:护甲+3、攻击前:本回合你使用过法术，自身+8/+8'],
      [55, 55, '【护甲6】、【磐龙】、充能:护甲+4、攻击前:本回合你使用过法术，自身+8/+8'],
      [60, 60, '【护甲6】、【磐龙】、充能:护甲+4、攻击前:本回合你使用过法术，自身+10/+10'],
      [66, 66, '【护甲7】、【磐龙】、充能:护甲+5、攻击前:本回合你使用过法术，自身+10/+10'],
      [73, 73, '【护甲7】、【磐龙】、充能:护甲+5、攻击前:本回合你使用过法术，自身+12/+12'],
      [80, 80, '【护甲8】、【磐龙】、充能:护甲+5、攻击前:本回合你使用过法术，自身+12/+12'],
      [88, 88, '【护甲9】、【磐龙】、充能:护甲+6、攻击前:本回合你使用过法术，自身+13/+13'],
      [99, 99, '【护甲10】、【磐龙】、充能:护甲+7、攻击前:本回合你使用过法术，自身+15/+15']
    ]
  },
  {
    name: '魔像-钢翼仲裁者',
    quality: '紫',
    cost: 9,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/moxiang_gangyizhongcaizhe.jpg', import.meta.url),
    data: [
      [40, 30, '登场:消灭随机敌军、充能:随机敌军受到40点伤害'],
      [45, 35, '登场:消灭随机敌军、充能:随机敌军受到45点伤害'],
      [50, 40, '登场:消灭随机敌军、充能:随机敌军受到50点伤害'],
      [60, 40, '登场:消灭随机敌军、充能:随机敌军受到60点伤害'],
      [65, 45, '登场:消灭随机敌军、充能:随机敌军受到65点伤害'],
      [70, 50, '登场:消灭随机敌军、充能:随机敌军受到70点伤害'],
      [75, 55, '登场:消灭随机敌军、充能:随机敌军受到75点伤害'],
      [83, 60, '登场:消灭随机敌军、充能:随机敌军受到83点伤害'],
      [90, 66, '登场:消灭随机敌军、充能:随机敌军受到90点伤害']
    ]
  },
  {
    name: '传记·海市蜃楼·蛇',
    quality: '紫',
    cost: 2,
    type: 3,
    img: new URL('@/assets/zhongzu/yinmizhe/zhuanji_haishishenloushe.jpg', import.meta.url),
    data: [
      [0, 0, '横排随机位置，召唤幻象蛇-lv12，获得【传记·海市蜃楼·熊】'],
      [0, 0, '横排随机位置，召唤幻象蛇-lv13，获得【传记·海市蜃楼·熊】'],
      [0, 0, '横排随机位置，召唤幻象蛇-lv14，获得【传记·海市蜃楼·熊】'],
      [0, 0, '横排随机位置，召唤幻象蛇-lv15，获得【传记·海市蜃楼·熊】'],
      [0, 0, '横排随机位置，召唤幻象蛇-lv16，获得【传记·海市蜃楼·熊】'],
      [0, 0, '横排随机位置，召唤幻象蛇-lv17，获得【传记·海市蜃楼·熊】'],
      [0, 0, '横排随机位置，召唤幻象蛇-lv18，获得【传记·海市蜃楼·熊】'],
      [0, 0, '横排随机位置，召唤幻象蛇-lv19，获得【传记·海市蜃楼·熊】'],
      [0, 0, '横排随机位置，召唤幻象蛇-lv20，获得【传记·海市蜃楼·熊】']
    ]
  },
  {
    name: '传记·海市蜃楼·熊',
    quality: '紫',
    cost: 4,
    type: 3,
    img: new URL('@/assets/zhongzu/yinmizhe/zhuanji_haishishenlouxiong.jpg', import.meta.url),
    data: [
      [0, 0, '横排随机位置，召唤幻象熊-lv12，获得【传记·海市蜃楼·龙】'],
      [0, 0, '横排随机位置，召唤幻象熊-lv13，获得【传记·海市蜃楼·龙】'],
      [0, 0, '横排随机位置，召唤幻象熊-lv14，获得【传记·海市蜃楼·龙】'],
      [0, 0, '横排随机位置，召唤幻象熊-lv15，获得【传记·海市蜃楼·龙】'],
      [0, 0, '横排随机位置，召唤幻象熊-lv16，获得【传记·海市蜃楼·龙】'],
      [0, 0, '横排随机位置，召唤幻象熊-lv17，获得【传记·海市蜃楼·龙】'],
      [0, 0, '横排随机位置，召唤幻象熊-lv18，获得【传记·海市蜃楼·龙】'],
      [0, 0, '横排随机位置，召唤幻象熊-lv19，获得【传记·海市蜃楼·龙】'],
      [0, 0, '横排随机位置，召唤幻象熊-lv20，获得【传记·海市蜃楼·龙】']
    ]
  },
  {
    name: '传记·海市蜃楼·龙',
    quality: '紫',
    cost: 6,
    type: 3,
    img: new URL('@/assets/zhongzu/yinmizhe/zhuanji_haishishenloulong.jpg', import.meta.url),
    data: [
      [0, 0, '横排随机位置，召唤幻象龙-lv12'],
      [0, 0, '横排随机位置，召唤幻象龙-lv13'],
      [0, 0, '横排随机位置，召唤幻象龙-lv14'],
      [0, 0, '横排随机位置，召唤幻象龙-lv15'],
      [0, 0, '横排随机位置，召唤幻象龙-lv16'],
      [0, 0, '横排随机位置，召唤幻象龙-lv17'],
      [0, 0, '横排随机位置，召唤幻象龙-lv18'],
      [0, 0, '横排随机位置，召唤幻象龙-lv19'],
      [0, 0, '横排随机位置，召唤幻象龙-lv20']
    ]
  },
  {
    name: 'No.7鬼童·塞文',
    quality: '橙',
    cost: 0,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/No7_guitongsaiwen.jpg', import.meta.url),
    data: [
      [6, 6, '回合结束:若本回合已充能，则修复《鬼童-7号》lv12，回到手上'],
      [7, 7, '回合结束:若本回合已充能，则修复《鬼童-7号》lv13，回到手上'],
      [8, 8, '回合结束:若本回合已充能，则修复《鬼童-7号》lv14，回到手上'],
      [9, 9, '回合结束:若本回合已充能，则修复《鬼童-7号》lv15，回到手上'],
      [10, 10, '回合结束:若本回合已充能，则修复《鬼童-7号》lv16，回到手上'],
      [11, 11, '回合结束:若本回合已充能，则修复《鬼童-7号》lv17，回到手上'],
      [12, 12, '回合结束:若本回合已充能，则修复《鬼童-7号》lv18，回到手上'],
      [13, 13, '回合结束:若本回合已充能，则修复《鬼童-7号》lv19，回到手上'],
      [14, 14, '回合结束:若本回合已充能，则修复《鬼童-7号》lv20，回到手上']
    ]
  },
  {
    name: 'No.8雷鸣·泰拉德',
    quality: '橙',
    cost: 1,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/No8_leimingtaidela.jpg', import.meta.url),
    data: [
      [12, 16, '回合开始、攻击前、回合结束:敌方随机区域坠落x点伤害(x为剩余法力)'],
      [14, 18, '回合开始、攻击前、回合结束:敌方随机区域坠落x点伤害(x为剩余法力)'],
      [16, 21, '回合开始、攻击前、回合结束:敌方随机区域坠落x点伤害(x为剩余法力)'],
      [18, 24, '回合开始、攻击前、回合结束:敌方随机区域坠落x点伤害(x为剩余法力)'],
      [21, 25, '回合开始、攻击前、回合结束:敌方随机区域坠落x点伤害(x为剩余法力)'],
      [24, 28, '回合开始、攻击前、回合结束:敌方随机区域坠落x点伤害(x为剩余法力)'],
      [28, 30, '回合开始、攻击前、回合结束:敌方随机区域坠落x点伤害(x为剩余法力)'],
      [30, 33, '回合开始、攻击前、回合结束:敌方随机区域坠落x点伤害(x为剩余法力2倍)'],
      [35, 35, '回合开始、攻击前、回合结束:敌方随机区域坠落x点伤害(x为剩余法力2倍)']
    ]
  },
  {
    name: 'No.4希尔伯特',
    quality: '橙',
    cost: 2,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/No4_xierbote.jpg', import.meta.url),
    data: [
      [7, 21, '【护甲2】、【魔防2】、回合结束:敌方区域召唤灵能炸弹-lv12'],
      [8, 23, '【护甲3】、【魔防3】、回合结束:敌方区域召唤灵能炸弹-lv13'],
      [9, 26, '【护甲3】、【魔防3】、回合结束:敌方区域召唤灵能炸弹-lv14'],
      [10, 29, '【护甲3】、【魔防3】、回合结束:敌方区域召唤灵能炸弹-lv15'],
      [12, 31, '【护甲3】、【魔防3】、回合结束:敌方区域召唤灵能炸弹-lv16'],
      [14, 32, '【护甲4】、【魔防4】、回合结束:敌方区域召唤灵能炸弹-lv17'],
      [16, 35, '【护甲4】、【魔防4】、回合结束:敌方区域召唤灵能炸弹-lv18'],
      [18, 38, '【护甲4】、【魔防4】、回合结束:敌方区域召唤灵能炸弹-lv19'],
      [20, 40, '【护甲5】、【魔防5】、回合结束:敌方区域召唤灵能炸弹-lv20']
    ]
  },
  {
    name: 'No.5咒刃·布雷克',
    quality: '橙',
    cost: 3,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/No5_zhourenbuleike.jpg', import.meta.url),
    data: [
      [6, 22, '【魔免】、【先攻】、【二连击】、【护甲3】、攻击前:本回合你每使用过一个法术或传记，自身攻击+1'],
      [7, 23, '【魔免】、【先攻】、【二连击】、【护甲3】、攻击前:本回合你每使用过一个法术或传记，自身攻击+2'],
      [8, 24, '【魔免】、【先攻】、【二连击】、【护甲4】、攻击前:本回合你每使用过一个法术或传记，自身攻击+2'],
      [10, 25, '【魔免】、【先攻】、【二连击】、【护甲4】、攻击前:本回合你每使用过一个法术或传记，自身攻击+2'],
      [12, 26, '【魔免】、【先攻】、【二连击】、【护甲4】、攻击前:本回合你每使用过一个法术或传记，自身攻击+2'],
      [14, 27, '【魔免】、【先攻】、【二连击】、【护甲4】、攻击前:本回合你每使用过一个法术或传记，自身攻击+2'],
      [15, 30, '【魔免】、【先攻】、【二连击】、【护甲5】、攻击前:本回合你每使用过一个法术或传记，自身攻击+2'],
      [17, 32, '【魔免】、【先攻】、【二连击】、【护甲5】、攻击前:本回合你每使用过一个法术或传记，自身攻击+3'],
      [19, 35, '【魔免】、【先攻】、【二连击】、【护甲6】、攻击前:本回合你每使用过一个法术或传记，自身攻击+3']
    ]
  },
  {
    name: '鬼童7号',
    quality: '橙',
    cost: 4,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/guitongqihao.jpg', import.meta.url),
    data: [
      [13, 13, '登场:随机敌军受到13点伤害、攻击前:随机敌军受到5点伤害、死亡:召唤6/6赛文-lv12'],
      [14, 15, '登场:随机敌军受到14点伤害、攻击前:随机敌军受到5点伤害、死亡:召唤7/7赛文-lv13'],
      [16, 16, '登场:随机敌军受到16点伤害、攻击前:随机敌军受到6点伤害、死亡:召唤8/8赛文-lv14'],
      [18, 18, '登场:随机敌军受到18点伤害、攻击前:随机敌军受到6点伤害、死亡:召唤9/9赛文-lv15'],
      [20, 20, '登场:随机敌军受到20点伤害、攻击前:随机敌军受到7点伤害、死亡:召唤10/10赛文-lv16'],
      [23, 23, '登场:随机敌军受到23点伤害、攻击前:随机敌军受到8点伤害、死亡:召唤11/11赛文-lv17'],
      [26, 26, '登场:随机敌军受到26点伤害、攻击前:随机敌军受到10点伤害、死亡:召唤12/12赛文-lv18'],
      [29, 29, '登场:随机敌军受到29点伤害、攻击前:随机敌军受到11点伤害、死亡:召唤13/13赛文-lv19'],
      [33, 33, '登场:随机敌军受到33点伤害、攻击前:随机敌军受到12点伤害、死亡:召唤14/14赛文-lv20']
    ]
  },
  {
    name: 'No.2时光·米拉',
    quality: '橙',
    cost: 5,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/No2_shiguangmila.jpg', import.meta.url),
    data: [
      [8, 13, '法力上限+3，你的法术卡使用后，移回手上、死亡:自身回手，70%概率获得沉默术-lv5'],
      [10, 16, '法力上限+3，你的法术卡使用后，移回手上、死亡:自身回手，75%概率获得沉默术-lv5'],
      [12, 17, '法力上限+3，你的法术卡使用后，移回手上、死亡:自身回手，75%概率获得沉默术-lv6'],
      [15, 18, '法力上限+3，你的法术卡使用后，移回手上、死亡:自身回手，75%概率获得沉默术-lv6'],
      [17, 19, '法力上限+3，你的法术卡使用后，移回手上、死亡:自身回手，75%概率获得沉默术-lv7'],
      [19, 20, '法力上限+3，你的法术卡使用后，移回手上、死亡:自身回手，75%概率获得沉默术-lv8'],
      [22, 21, '法力上限+3，你的法术卡使用后，移回手上、死亡:自身回手，75%概率获得沉默术-lv9'],
      [25, 23, '法力上限+3，你的法术卡使用后，移回手上、死亡:自身回手，75%概率获得沉默术-lv10'],
      [29, 25, '法力上限+3，你的法术卡使用后，移回手上、死亡:自身回手，75%概率获得沉默术-lv11']
    ]
  },
  {
    name: 'No.9迪宁',
    quality: '橙',
    cost: 6,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/No9_dining.jpg', import.meta.url),
    data: [
      [9, 9, '【魔防8】、【先攻】、回合开始：全体先攻友军+2/+1、获得【连击】1回合'],
      [10, 10, '【魔防8】、【先攻】、回合开始：全体先攻友军+2/+2、获得【连击】1回合'],
      [11, 12, '【魔防9】、【先攻】、回合开始：全体先攻友军+2/+2、获得【连击】1回合'],
      [12, 12, '【魔防10】、【先攻】、回合开始：全体先攻友军+3/+2、获得【连击】1回合'],
      [14, 14, '【魔防12】、【先攻】、回合开始：全体先攻友军+3/+2、获得【连击】1回合'],
      [17, 17, '【魔防13】、【先攻】、回合开始：全体先攻友军+3/+3、获得【连击】1回合'],
      [19, 19, '【魔防15】、【先攻】、回合开始：全体先攻友军+4/+3、获得【连击】1回合'],
      [22, 22, '【魔防15】、【先攻】、回合开始：全体先攻友军+4/+3、获得【连击】1回合'],
      [25, 25, '【魔防15】、【先攻】、回合开始：全体先攻友军+4/+4、获得【连击】1回合']
    ]
  },
  {
    name: 'No.6沃凡瑞拉',
    quality: '橙',
    cost: 7,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/No6_wofanruila.jpg', import.meta.url),
    data: [
      [26, 18, '登场:前方竖排召唤三个13/13幻象巨蛇-lv12、回合结束:获得两个13/13幻象巨蛇-lv12'],
      [28, 22, '登场:前方竖排召唤三个14/14幻象巨蛇-lv13、回合结束:获得两个14/14幻象巨蛇-lv13'],
      [32, 26, '登场:前方竖排召唤三个16/16幻象巨蛇-lv14、回合结束:获得两个16/16幻象巨蛇-lv14'],
      [36, 29, '登场:前方竖排召唤三个18/18幻象巨蛇-lv15、回合结束:获得两个18/18幻象巨蛇-lv15'],
      [40, 32, '登场:前方竖排召唤三个20/20幻象巨蛇-lv16、回合结束:获得两个20/20幻象巨蛇-lv16'],
      [45, 35, '登场:前方竖排召唤三个22/22幻象巨蛇-lv17、回合结束:获得两个22/22幻象巨蛇-lv17'],
      [50, 38, '登场:前方竖排召唤三个24/24幻象巨蛇-lv18、回合结束:获得两个24/24幻象巨蛇-lv18'],
      [55, 40, '登场:前方竖排召唤三个26/26幻象巨蛇-lv19、回合结束:获得两个26/26幻象巨蛇-lv19'],
      [60, 42, '登场:前方竖排召唤三个28/28幻象巨蛇-lv20、回合结束:获得两个28/28幻象巨蛇-lv20']
    ]
  },
  {
    name: 'No.3伊斯多维尔',
    quality: '橙',
    cost: 7,
    type: 1,
    img: new URL('@/assets/zhongzu/yinmizhe/No3_yisiduoweier.jpg', import.meta.url),
    data: [
      [15, 15, '回合开始:心灵操控随机敌军，另一友军+11/+11'],
      [16, 16, '登场：获得【磐龙】1回合、回合开始:心灵操控随机敌军，另一友军+11/+11'],
      [18, 18, '登场：获得【磐龙】1回合、回合开始:心灵操控随机敌军，另一友军+12/+12'],
      [20, 20, '登场：获得【磐龙】1回合、回合开始:心灵操控随机敌军，另一友军+13/+13'],
      [23, 23, '登场：获得【磐龙】1回合、回合开始:心灵操控随机敌军，另一友军+14/+14'],
      [26, 26, '登场：获得【磐龙】1回合、回合开始:心灵操控随机敌军，另一友军+16/+16'],
      [30, 30, '登场：获得【磐龙】1回合、回合开始:心灵操控随机敌军，另一友军+18/+18'],
      [34, 34, '登场：获得【磐龙】1回合、回合开始:心灵操控随机敌军，另一友军+20/+20'],
      [39, 39, '登场：获得【磐龙】1回合、回合开始:心灵操控随机敌军，另一友军+22/+22']
    ]
  },
  {
    name: '传记·荒芜挽歌·序',
    quality: '橙',
    cost: 1,
    type: 3,
    img: new URL('@/assets/zhongzu/yinmizhe/zhuanji_huangwuwangexu.jpg', import.meta.url),
    data: [
      [0, 0, '随机敌军攻击-6，荒芜随机敌方区域，获得【传记·荒芜挽歌·破】'],
      [0, 0, '随机敌军攻击-7，荒芜随机敌方区域，获得【传记·荒芜挽歌·破】'],
      [0, 0, '随机敌军攻击-9，荒芜随机敌方区域，获得【传记·荒芜挽歌·破】'],
      [0, 0, '随机敌军攻击-11，荒芜随机敌方区域，获得【传记·荒芜挽歌·破】'],
      [0, 0, '随机敌军攻击-13，荒芜随机敌方区域，获得【传记·荒芜挽歌·破】'],
      [0, 0, '随机敌军攻击-16，荒芜随机敌方区域，获得【传记·荒芜挽歌·破】'],
      [0, 0, '随机敌军攻击-20，荒芜随机敌方区域，获得【传记·荒芜挽歌·破】'],
      [0, 0, '随机敌军攻击-24，荒芜随机敌方区域，获得【传记·荒芜挽歌·破】'],
      [0, 0, '随机敌军攻击-30，荒芜随机敌方区域，获得【传记·荒芜挽歌·破】']
    ]
  },
  {
    name: '传记·荒芜挽歌·破',
    quality: '橙',
    cost: 2,
    type: 3,
    img: new URL('@/assets/zhongzu/yinmizhe/zhuanji_huangwuwangepo.jpg', import.meta.url),
    data: [
      [0, 0, '在目标区域和随机区域召唤2个10/10幻想蛇-lv9，获得【传记·荒芜挽歌·终】'],
      [0, 0, '在目标区域和随机区域召唤2个11/11幻想蛇-lv10，获得【传记·荒芜挽歌·终】'],
      [0, 0, '在目标区域和随机区域召唤2个12/12幻想蛇-lv11，获得【传记·荒芜挽歌·终】'],
      [0, 0, '在目标区域和随机区域召唤2个14/14幻想蛇-lv13，获得【传记·荒芜挽歌·终】'],
      [0, 0, '在目标区域和随机区域召唤2个16/16幻想蛇-lv14，获得【传记·荒芜挽歌·终】'],
      [0, 0, '在目标区域和随机区域召唤2个18/18幻想蛇-lv15，获得【传记·荒芜挽歌·终】'],
      [0, 0, '在目标区域和随机区域召唤2个20/20幻想蛇-lv16，获得【传记·荒芜挽歌·终】'],
      [0, 0, '在目标区域和随机区域召唤2个22/22幻想蛇-lv17，获得【传记·荒芜挽歌·终】'],
      [0, 0, '在目标区域和随机区域召唤2个24/24幻想蛇-lv18，获得【传记·荒芜挽歌·终】']
    ]
  },
  {
    name: '传记·荒芜挽歌·终',
    quality: '橙',
    cost: 4,
    type: 3,
    img: new URL('@/assets/zhongzu/yinmizhe/zhuanji_huangwuwangezhong.jpg', import.meta.url),
    data: [
      [0, 0, '所有幻象生物+9/+9(无视魔免)'],
      [0, 0, '所有幻象生物+10/+10(无视魔免)'],
      [0, 0, '所有幻象生物+11/+11(无视魔免)'],
      [0, 0, '所有幻象生物+12/+12(无视魔免)'],
      [0, 0, '所有幻象生物+13/+13(无视魔免)'],
      [0, 0, '所有幻象生物+15/+15(无视魔免)'],
      [0, 0, '所有幻象生物+18/+18(无视魔免)'],
      [0, 0, '所有幻象生物+21/+21(无视魔免)'],
      [0, 0, '所有幻象生物+25/+25(无视魔免)']
    ]
  }
];
